{
    "f78l53y": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f78l53y",
                "Author": "klfet",
                "Date Created": "11-11-2019 11:53:17",
                "Upvotes": 198,
                "Text": "I was out with a family member. Her daughter is 8. She said to her daughter that she needed to get a salad to watch what she eats. She’s literally underweight and tiny. I couldn’t believe it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f78pcbh": [
                {
                    "Parent ID": "t1_f78l53y",
                    "Comment ID": "f78pcbh",
                    "Author": "fuckwhywhywhy",
                    "Date Created": "11-11-2019 12:22:13",
                    "Upvotes": 105,
                    "Text": ":( that’s so terrible!!\n\nAt my highest weight (the weight I was as a teenager) I was like 1-2 lbs below the lowest healthy weight for my height. My mom always made comments my entire life about needing to diet, gave me diet pills, etc. Plus I had to watch her have her own problems and basically check out of life bc she got fat and hated herself. \n\nI hope I never unintentionally inflict any of my eating disorder bullshit on my daughter. It’s partially why I’ve stopped weighing myself so much bc I don’t want her to see",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f797846": [
                        {
                            "Parent ID": "t1_f78pcbh",
                            "Comment ID": "f797846",
                            "Author": "TheShortGerman",
                            "Date Created": "11-11-2019 14:19:11",
                            "Upvotes": 51,
                            "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79otd0": [
                        {
                            "Parent ID": "t1_f78pcbh",
                            "Comment ID": "f79otd0",
                            "Author": "Satrina_petrova",
                            "Date Created": "11-11-2019 16:35:44",
                            "Upvotes": 20,
                            "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "f799y15": [
                {
                    "Parent ID": "t1_f78l53y",
                    "Comment ID": "f799y15",
                    "Author": "aggressivehealth9",
                    "Date Created": "11-11-2019 14:36:57",
                    "Upvotes": 29,
                    "Text": "My mom told me to start watching what I eat when I was little and now I just get filled with so much rage like- that was YOUR JOB to feed me, I was a kid!",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f79abni": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79abni",
                "Author": "xoxwoe",
                "Date Created": "11-11-2019 14:39:28",
                "Upvotes": 123,
                "Text": "Unrelated but kinda on the same note I used to work at a lingerie store and a couple came in asking for a bra for their 14 year old daughter with \"lots of push up\" and the dad was saying how she's flat chested and needs all the push up she can get. It was so fucking gross oh my god and the worst part is the girl was there too and she seemed so uncomfortable with it all.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f79ec57": [
                {
                    "Parent ID": "t1_f79abni",
                    "Comment ID": "f79ec57",
                    "Author": "thicchurros",
                    "Date Created": "11-11-2019 15:05:25",
                    "Upvotes": 54,
                    "Text": "wtf omg",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f79f0wt": [
                        {
                            "Parent ID": "t1_f79ec57",
                            "Comment ID": "f79f0wt",
                            "Author": "xoxwoe",
                            "Date Created": "11-11-2019 15:10:11",
                            "Upvotes": 90,
                            "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79hecz": [
                [
                    {
                        "Parent ID": "t1_f79f0wt",
                        "Comment ID": "f79hecz",
                        "Author": "wildflower_0ne",
                        "Date Created": "11-11-2019 15:26:56",
                        "Upvotes": 63,
                        "Text": "probably T.I.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7a4vnm": [
                        {
                            "Parent ID": "t1_f79hecz",
                            "Comment ID": "f7a4vnm",
                            "Author": "OhNoOreos",
                            "Date Created": "11-11-2019 19:00:35",
                            "Upvotes": 7,
                            "Text": "Wish I could upvote this twice 😂",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79fdfp": [
                [
                    {
                        "Parent ID": "t1_f79f0wt",
                        "Comment ID": "f79fdfp",
                        "Author": "thicchurros",
                        "Date Created": "11-11-2019 15:12:38",
                        "Upvotes": 25,
                        "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79skvf": [
                [
                    {
                        "Parent ID": "t1_f79f0wt",
                        "Comment ID": "f79skvf",
                        "Author": "red_ossifrage",
                        "Date Created": "11-11-2019 17:19:18",
                        "Upvotes": 15,
                        "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "f79i4wy": [
                {
                    "Parent ID": "t1_f79abni",
                    "Comment ID": "f79i4wy",
                    "Author": "fuckwhywhywhy",
                    "Date Created": "11-11-2019 15:32:09",
                    "Upvotes": 31,
                    "Text": "Eww. That is almost as cringey to read as it is to watch Scott’s Tots\n\nThat’s so disgusting and I’d me MORTIFIED if my father ever acted like that. One of my fiancé’s bestfriends parents paid for their daughter to get a boob job as a high school graduation present. 🤮",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f7ar1r0": [
                        {
                            "Parent ID": "t1_f79i4wy",
                            "Comment ID": "f7ar1r0",
                            "Author": "littlebabymegan",
                            "Date Created": "11-11-2019 23:37:22",
                            "Upvotes": 5,
                            "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7bc0dw": [
                [
                    {
                        "Parent ID": "t1_f7ar1r0",
                        "Comment ID": "f7bc0dw",
                        "Author": "fuckwhywhywhy",
                        "Date Created": "11-12-2019 07:13:06",
                        "Upvotes": 1,
                        "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "f79ctlz": [
                {
                    "Parent ID": "t1_f79abni",
                    "Comment ID": "f79ctlz",
                    "Author": "wildflower_0ne",
                    "Date Created": "11-11-2019 14:55:41",
                    "Upvotes": 15,
                    "Text": ".....................",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "f79i6ga": [
                {
                    "Parent ID": "t1_f79abni",
                    "Comment ID": "f79i6ga",
                    "Author": "therefore-peace",
                    "Date Created": "11-11-2019 15:32:26",
                    "Upvotes": 15,
                    "Text": "That reminds me I was looking at big girls bras on amazon (they’re cheaper and they do the job for my chest lmao) and there were reviews of people saying they bought the bras for their 7 year olds like bruh",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f79rza6": [
                        {
                            "Parent ID": "t1_f79i6ga",
                            "Comment ID": "f79rza6",
                            "Author": "frostfromfire",
                            "Date Created": "11-11-2019 17:13:09",
                            "Upvotes": 14,
                            "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f79cq6f": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79cq6f",
                "Author": "applecinnamonnn",
                "Date Created": "11-11-2019 14:55:05",
                "Upvotes": 34,
                "Text": "As a soon- to-be-mom still recovering from my ED this broke my heart in a million pieces. I’m already so worried and anxious about how I’m going to let my daughter have a good, healthy relationship with food and her body when I’m still working on mine (and still struggling everyday, pregnancy is being quite tough), thinking about the message spread throughout our whole society makes me panic even more.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f79gq0x": [
                {
                    "Parent ID": "t1_f79cq6f",
                    "Comment ID": "f79gq0x",
                    "Author": "amqs0913",
                    "Date Created": "11-11-2019 15:22:12",
                    "Upvotes": 13,
                    "Text": "I'm not even close to having kids yet and I worry about this all the time.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "f7ab3ew": [
                {
                    "Parent ID": "t1_f79cq6f",
                    "Comment ID": "f7ab3ew",
                    "Author": "fr0gcodes",
                    "Date Created": "11-11-2019 20:16:15",
                    "Upvotes": 8,
                    "Text": "i am sure you’re going to be a great mom. you got this, keep going! you’re worth living a full life with your daughter",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f7aucyc": [
                        {
                            "Parent ID": "t1_f7ab3ew",
                            "Comment ID": "f7aucyc",
                            "Author": "applecinnamonnn",
                            "Date Created": "11-12-2019 00:36:14",
                            "Upvotes": 4,
                            "Text": "Thank you so much :))",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f79bxka": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79bxka",
                "Author": "blue666-",
                "Date Created": "11-11-2019 14:50:00",
                "Upvotes": 30,
                "Text": "This kinda stuff oftens comes from just society i think, my parents never pushed weight loss or anything on me but i thought i was fat from the time i was 7 or 8 - i remember looking at shitty magazines with celebrity weight gains and stuff like that which probably had an effect",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f79kf7g": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79kf7g",
                "Author": "pounce-a-lot",
                "Date Created": "11-11-2019 15:48:06",
                "Upvotes": 25,
                "Text": "My family is so weight obsessed. We had a family funeral a few weeks ago and my aunt was telling my 13 year old niece that her dress made her look skinny and I got so mad",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f79gx37": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79gx37",
                "Author": "cloudsofdawn",
                "Date Created": "11-11-2019 15:23:37",
                "Upvotes": 21,
                "Text": "God that’s so sad.\n\nI remember being young and I wore oversized shirts for a year and a bit because I didn’t like how I looked, and it was also more tomboy-ish so I didn’t get questioned as much.\n\nI also remember those few years following. I would weigh myself and nearly have meltdowns because even though I was literally just growing normally, the closer I got to 100lbs the more upset I would get. I’d just have secret meltdowns over it. \n\nLooking back, it’s pretty fucked up how young I was going through that. \n\nI feel so bad for this kid. I really hope she doesn’t end up falling deeper into this mindset and going through what so many of us have.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f79gzh6": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79gzh6",
                "Author": "Spectrachic311311",
                "Date Created": "11-11-2019 15:24:05",
                "Upvotes": 17,
                "Text": "My niece is 9 and my idiot sister tells her to ease up on the carbs so she doesn’t get diabetes. I’m telling her that scaring the poor kid isn’t going to work. My parents tried to limit my snacks and I rebelled in college and gained a lot of weight.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f79ooj0": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79ooj0",
                "Author": "TrueRusher",
                "Date Created": "11-11-2019 16:33:29",
                "Upvotes": 14,
                "Text": "I remember my mother commenting on my cellulite at ~13\n\nI had gained a bit of weight (as you do when you grow) and cellulite came with it (as it often does). I was just lounging around in shorts one day and she goes “you’re getting cellulite on your legs, have you been gaining weight?” \n\nAnd that’s when I became focused on cellulite \n\n(My mom is a great mom but she has food and body issues she has never addressed and some of it leaked out onto me)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f7b0eal": [
                {
                    "Parent ID": "t1_f79ooj0",
                    "Comment ID": "f7b0eal",
                    "Author": "hammerprice",
                    "Date Created": "11-12-2019 02:52:52",
                    "Upvotes": 3,
                    "Text": ">(My mom is a great mom but she has food and body issues she has never addressed and some of it leaked out onto me)\n\nMe me me. It's so hard juggling a lot of pain that you have as a result of someone you genuinely love and care for and know cares for you in return. Like, my attitudes toward food/eating are so messed up and I've struggled with my weight all my life and a big portion of that was because of what I learned from/was taught by my mother, but like... I also know she didn't do it on purpose, it's because SHE also had those same struggles, and I love her but it's like, this burden isn't my fault, but it's nobody's fault, and I wish I had someone to blame, but it's my lonely responsibility now.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f796b1w": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f796b1w",
                "Author": "TbhIdekMyName",
                "Date Created": "11-11-2019 14:13:19",
                "Upvotes": 71,
                "Text": "My least favorite is the video where the mom scoops out the inside of her BABY DAUGHTER'S bagel because she doesnt want her to get fat.\n\nCHILD ABUSE, for many reasons. I'm a child development major, and something that is drilled into us is that babies and little ones MUST get fat. They need rolls and chubbiness because their brains are about to develop a hell of a lot, and guess what? Brains are fat.\n\nIt's disgusting. Her daughter could suffer with PERMANENT BRAIN ISSUES and MALNUTRITION because of her idiot mother.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f79obsl": [
                {
                    "Parent ID": "t1_f796b1w",
                    "Comment ID": "f79obsl",
                    "Author": "TrueRusher",
                    "Date Created": "11-11-2019 16:27:30",
                    "Upvotes": 19,
                    "Text": "I’m a child development minor and I was about to say the exact same thing before I read your second paragraph. \n\nI wish child development was a required class in high school so people would learn this stuff just in case they want to be parents. The only way to make better parents is to teach kids how to parent \n\n(Obligatory Boyinaband reference: they say it’s not the kids, the parents are the problem. But if you taught the kids to parent—that’s the problem solved, then)",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f79x1gs": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79x1gs",
                "Author": "klfet",
                "Date Created": "11-11-2019 17:56:59",
                "Upvotes": 10,
                "Text": "Wow. Sounds like we all had the same mothers!!!!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f7a451g": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f7a451g",
                "Author": "buttercorncandycream",
                "Date Created": "11-11-2019 18:51:37",
                "Upvotes": 10,
                "Text": "My brothers have been calling my 9 year old underweight sister “fat” for months now and I’m trying so hard to reverse what damage they’re doing but I’m only one person and I don’t know what to do.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f7b0ewm": [
                {
                    "Parent ID": "t1_f7a451g",
                    "Comment ID": "f7b0ewm",
                    "Author": "hammerprice",
                    "Date Created": "11-12-2019 02:53:18",
                    "Upvotes": 3,
                    "Text": "What the fuck. Why. Where are your parents in this. What is wrong with your brothers.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f7aghxf": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f7aghxf",
                "Author": "lilBloodpeach",
                "Date Created": "11-11-2019 21:18:03",
                "Upvotes": 9,
                "Text": "I remember being around 6- still in kindergarten, hating my chubby body and skipping dinner to do crunches in my room. \n\nMy daughter is 2.5 and I hope she never feels this way. I’m doing all I can to make her feel proud of herself.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f7alck3": [
                {
                    "Parent ID": "t1_f7aghxf",
                    "Comment ID": "f7alck3",
                    "Author": "fuckwhywhywhy",
                    "Date Created": "11-11-2019 22:18:25",
                    "Upvotes": 8,
                    "Text": ":(\n\nI feel the exact same way. My daughter will be 2.5 at the end of January. \n\nI’ve worked really hard to stop weighing myself daily (I’ve been averaging like every 13 days where as I used to weigh myself like 6 times a day until a few months ago). A lot of the reason is bc she (and my almost 4 year old son) would always see me weighing myself and I didn’t want them to learn to do that. My daughter weighed herself today after I did and I just praised her for growing so much and tried to make it as much of a positive experience of “oh my gosh, you’re such a big girl, I’m so proud of you for growing” as opposed caring about a weight\n\nI hope so much I can let go of all of my ED bs before she can ever recognize it",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7btuk0": [
                [
                    {
                        "Parent ID": "t1_f7bkssu",
                        "Comment ID": "f7btuk0",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 10:51:22",
                        "Upvotes": 1,
                        "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bwiyp": [
                        {
                            "Parent ID": "t1_f7btuk0",
                            "Comment ID": "f7bwiyp",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 11:20:04",
                            "Upvotes": 1,
                            "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bymm6": [
                [
                    {
                        "Parent ID": "t1_f7bwiyp",
                        "Comment ID": "f7bymm6",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 11:42:11",
                        "Upvotes": 1,
                        "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c19bx": [
                        {
                            "Parent ID": "t1_f7bymm6",
                            "Comment ID": "f7c19bx",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 12:09:50",
                            "Upvotes": 1,
                            "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7c2xk9": [
                [
                    {
                        "Parent ID": "t1_f7c19bx",
                        "Comment ID": "f7c2xk9",
                        "Author": "heartbrokenandok",
                        "Date Created": "11-12-2019 12:27:20",
                        "Upvotes": 1,
                        "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7cg1k6": [
                        {
                            "Parent ID": "t1_f7c2xk9",
                            "Comment ID": "f7cg1k6",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 14:44:32",
                            "Upvotes": 2,
                            "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f79cx3v": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79cx3v",
                "Author": "misscrimson16x",
                "Date Created": "11-11-2019 14:56:20",
                "Upvotes": 18,
                "Text": "When I was 8 the doctor told my mom in front of me that I was overweight. When I went to see a dietician for my ED and told her that she said that the ED could've very much come from that. Fuck any doctor who will say that to a little kid's face.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f79ebho": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f79ebho",
                "Author": "squirrels-rule",
                "Date Created": "11-11-2019 15:05:17",
                "Upvotes": 6,
                "Text": "oh man this breaks my heart 💔",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f7a7ziy": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f7a7ziy",
                "Author": "[deleted]",
                "Date Created": "11-11-2019 19:38:52",
                "Upvotes": 5,
                "Text": "Wtf???? At 7? She's probably been hearing stuff like that from her older family members. That's insane...",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f7bhr56": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f7bhr56",
                "Author": "heartbrokenandok",
                "Date Created": "11-12-2019 08:33:28",
                "Upvotes": 2,
                "Text": "This is why I am super conflicted on having kids. How do you teach healthy eating habits and healthy body image at the same time? As a sometimes orthorexic, my food habits sometimes get out of control just with respect to what's \"healthy\", so how do you avoid causing this in a kid, but also make sure that they maintain a healthy weight and don't become one of those people from My 600lb Life or get bullied for being fat? It always feels as though you're damned if you do unless you have a kid that just is crazy active, naturally thin, and craves healthy foods.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f7bkssu": [
                {
                    "Parent ID": "t1_f7bhr56",
                    "Comment ID": "f7bkssu",
                    "Author": "fuckwhywhywhy",
                    "Date Created": "11-12-2019 09:11:09",
                    "Upvotes": 1,
                    "Text": "Yea, I feel like „normal” people wouldn’t even think about this so I think just trying to remove any of your own issues dealing with food would be the best way but that’s obviously not easy\n\nMy parents let me eat & drink whatever I wanted. Let me binge on candy, bought me treat food a lot, no restriction really whatsoever. If I wanted candy before dinner, then I ate it and still ate my meal. I was never overweight (or even a healthy weight) so I just completely ate to my bodies hunger cues and I was super active\n\nMy mom would tell me I needed to diet or give me weight loss pills bc SHE was obsessed with her weight so she thought I should be too, I guess?! She missed pretty much all of my school/ sport events and basically sat in her room 24/7 and wouldn’t even eat dinner with us bc she hated herself for getting fat. I thought it was just bc she was always fucked up on pills (which she was) but I guess now she’s apologized and says she was embarrassed that she got fat and didn’t ever want to be seen\n\nI try to just take special “treat” foods off of a pedestal and just have my kids eat when they are hungry and never force them to finish food. It’s really hard though. \n\nIt is already hard though and my kids are just 2 and 3. If I ever have something negative to say about my body or things about food I don’t want them to hear, I just don’t say it around them or I’ll spell the offending words so they don’t hear it. \n\nI pretty much stopped weighing myself too bc they’d want to do it after me. I weigh myself like twice a month now and when they do see (which they’ve only seen like once in a few months) and weigh themselves I just tell them wow, you’re growing so well! Just to make it positive and that we are just checking weight like the doctors check at their appts to make sure they’re growing correctly \n\nSorry for the wall of text lol",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f7btuk0": [
                        {
                            "Parent ID": "t1_f7bkssu",
                            "Comment ID": "f7btuk0",
                            "Author": "heartbrokenandok",
                            "Date Created": "11-12-2019 10:51:22",
                            "Upvotes": 1,
                            "Text": "That's so awesome that you are managing it so well! I agree completely with not saying negative things about yourself around your kids etc. I think that's a great way to go about it. It's just so hard in today's society. Also, what would you do if your kid was overweight? I definitely remember being at a dr's appointment at 13 and being told by the Dr that I needed to lose weight, and it was crushing. But also, like, I needed to lose weight to be healthy. It's such a hard situation.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f797846": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f797846",
                        "Author": "TheShortGerman",
                        "Date Created": "11-11-2019 14:19:11",
                        "Upvotes": 51,
                        "Text": "One of my worst fears about becoming a mom is passing on my eating issues to a child",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79otd0": [
                [
                    {
                        "Parent ID": "t1_f78pcbh",
                        "Comment ID": "f79otd0",
                        "Author": "Satrina_petrova",
                        "Date Created": "11-11-2019 16:35:44",
                        "Upvotes": 20,
                        "Text": "Yeah I feel ya man, at 10 I started hearing how I'd be better off just smearing the cheesecake on my thighs cause that's where it'll end up anyway. And \"thunder-thighs\" was a fun nickname my godfather gave me... caught on like wildfire. To be fair I do have stupidly fat thighs at any weight but there's no reason for that kinda crap.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f79f0wt": [
                [
                    {
                        "Parent ID": "t1_f79ec57",
                        "Comment ID": "f79f0wt",
                        "Author": "xoxwoe",
                        "Date Created": "11-11-2019 15:10:11",
                        "Upvotes": 90,
                        "Text": "Ya my coworker and I were like wtf and for the sake of the girl we were like \"this brand is catered to her age group\" which just makes like cute stuff for girls in that tween/early teen age bracket but they kept going to the wall with the brand that's super suggestive why are some people allowed to have kids honestly\n\nAlso side note: wtf kind of weird dad goes to pick his daughters bras for her",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f79hecz": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79hecz",
                            "Author": "wildflower_0ne",
                            "Date Created": "11-11-2019 15:26:56",
                            "Upvotes": 63,
                            "Text": "probably T.I.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79fdfp": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79fdfp",
                            "Author": "thicchurros",
                            "Date Created": "11-11-2019 15:12:38",
                            "Upvotes": 25,
                            "Text": "i feel so bad for the girl, for exposing her to the beginning of her insecurities, fr some people really shouldnt have kids",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f79skvf": [
                        {
                            "Parent ID": "t1_f79f0wt",
                            "Comment ID": "f79skvf",
                            "Author": "red_ossifrage",
                            "Date Created": "11-11-2019 17:19:18",
                            "Upvotes": 15,
                            "Text": "Wow, just...wow. I really hope that girl is physically and emotionally safe.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7ar1r0": [
                [
                    {
                        "Parent ID": "t1_f79i4wy",
                        "Comment ID": "f7ar1r0",
                        "Author": "littlebabymegan",
                        "Date Created": "11-11-2019 23:37:22",
                        "Upvotes": 5,
                        "Text": "I have a friend who's parents paid for her boob job as a high school graduation present too lmao",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bc0dw": [
                        {
                            "Parent ID": "t1_f7ar1r0",
                            "Comment ID": "f7bc0dw",
                            "Author": "fuckwhywhywhy",
                            "Date Created": "11-12-2019 07:13:06",
                            "Upvotes": 1,
                            "Text": "Awkward. I know of some other people that went to my high school whose parents paid for theirs\n\nDo you live in the south?! I feel like that wouldn’t happen elsewhere",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f79rza6": [
                [
                    {
                        "Parent ID": "t1_f79i6ga",
                        "Comment ID": "f79rza6",
                        "Author": "frostfromfire",
                        "Date Created": "11-11-2019 17:13:09",
                        "Upvotes": 14,
                        "Text": "Parents can be absolutely crazy.  I had a fancy white dress when I was 4 or 5 that my mom made me wear a few times, and because it was cheap satin I guess you could see through it.  My mom forced me to wear the itchiest bra underneath the dress, it had stupid little peaches on it which showed right through the dress fabric.\n\nI probably wouldn’t remember this happening if the bra wasn’t the most uncomfortable, horrid thing I ever wore as a kid.  I still can’t believe she made me wear that shit before kindergarten!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7aucyc": [
                [
                    {
                        "Parent ID": "t1_f7ab3ew",
                        "Comment ID": "f7aucyc",
                        "Author": "applecinnamonnn",
                        "Date Created": "11-12-2019 00:36:14",
                        "Upvotes": 4,
                        "Text": "Thank you so much :))",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7bwiyp": [
                [
                    {
                        "Parent ID": "t1_f7btuk0",
                        "Comment ID": "f7bwiyp",
                        "Author": "fuckwhywhywhy",
                        "Date Created": "11-12-2019 11:20:04",
                        "Upvotes": 1,
                        "Text": "I’ve thought about this before, especially when the weight watchers kids app came out (not sure what came of that... everyone seemed to just stop talking about it). I wouldn’t ever mention weight or eating less or anything. Just change their diet and add in more daily activity. \n\nBut that does make it tough if the doctor says it in front of the kid. I don’t think calories or discussing needed to lose weight should be discussed with a child. It is tough though too bc some people are not going to develop an eating disorder just bc weight loss or calories are discussed with them.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "f7bymm6": [
                        {
                            "Parent ID": "t1_f7bwiyp",
                            "Comment ID": "f7bymm6",
                            "Author": "heartbrokenandok",
                            "Date Created": "11-12-2019 11:42:11",
                            "Upvotes": 1,
                            "Text": "I get it a bit at a certain age. At 13 I was getting more autonomy and doing things without my parents and basically should be reasonably expected to manage many of my own health concerns on my own. (I had already been in charge of making sure I took my ADHD meds daily for a few years). So at what age is it necessary to tell the child that they have to make better choices to control their own weight. A 12 year old is certainly going to notice if suddenly they are hungry and you tell them they can't eat anything more. Or they can't have that candy that they used to be allowed. Not saying there is an answer, just saying that it's such a complex issue.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7a4vnm": [
                [
                    {
                        "Parent ID": "t1_f79hecz",
                        "Comment ID": "f7a4vnm",
                        "Author": "OhNoOreos",
                        "Date Created": "11-11-2019 19:00:35",
                        "Upvotes": 7,
                        "Text": "Wish I could upvote this twice 😂",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f7c19bx": [
                [
                    {
                        "Parent ID": "t1_f7bymm6",
                        "Comment ID": "f7c19bx",
                        "Author": "fuckwhywhywhy",
                        "Date Created": "11-12-2019 12:09:50",
                        "Upvotes": 1,
                        "Text": "I completely agree!\n\nI wouldn’t restrict food if my kid was gaining weight, rather just provide them with healthier options. Maybe buy less snacks, have less (or no) candy in the house so it isn’t telling them they can’t have it, it just isn’t available. Or start cooking healthier meals & pack their school lunch if they’d been previously buying it at school so you know what they are eating.  Adding in more physical activity like walks as a family or pick up hiking or riding bikes as a family.. or try to get them more active. You can make these lifestyle changes for/ with your child as a way to be healthier without specifically commenting on their weight or body. If you teach them to live a healthy, active lifestyle they shouldn’t have to worry about weight\n\nI do think you should teach children that some foods are more nutritious than others, such as an apple being better for you than candy, but still not put it on a pedestal like “if you eat your carrots, then you can have icecream” bc you’re putting emphasis that the icecream is better and you only should eat the carrots to get the dessert.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "f7c2xk9": [
                        {
                            "Parent ID": "t1_f7c19bx",
                            "Comment ID": "f7c2xk9",
                            "Author": "heartbrokenandok",
                            "Date Created": "11-12-2019 12:27:20",
                            "Upvotes": 1,
                            "Text": "I see what your saying, and that makes a ton of sense. I'm glad you've found such a healthy way to approach all this. I'm definitely starting to feel like it is a more achievable goal. I 100% plan to make being physically active a big role in my family activities (because I love being active and it's such a healthy lifestyle). I grew up in a \"we just aren't runners\" kind of home, where my mom used to play sports but we didn't, and there was not always a great deal of body positivity (my sister was overweight from childhood on and is very obese to this day). But I also do have to acknowledge that my food issues aren't generally about food and body, so therest a good chance if I can help my kids manage their mental health in general, this won't be an issue either way.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f7cg1k6": [
                [
                    {
                        "Parent ID": "t1_f7c2xk9",
                        "Comment ID": "f7cg1k6",
                        "Author": "fuckwhywhywhy",
                        "Date Created": "11-12-2019 14:44:32",
                        "Upvotes": 2,
                        "Text": "I’ve put a lot of thought into all of it. My family life was absolutely terrible growing up so I put a lot of thought into how I can be the best parent possible and do the least amount of long term psychological damage to my kids \n\nI feel ya on the food issues not being about food and body. I feel like different aspects of my eat disorder are caused by different things. Some having to do with food and body & some having to do with my mental health. I’ve already hit you with waaaaay too many walls of text but I have a lot of thoughts on insuring my kids get the help they need if they suffer from any type of mental health issues. My parents didn’t give a shit about my mental health and I’ve just bounced from one shitty coping mechanism to another bc of it. Eating disorder seeming to be the current form of control I have",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f7betxj": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f7betxj",
                "Author": "cappuccinomore",
                "Date Created": "11-12-2019 07:54:46",
                "Upvotes": 1,
                "Text": "Since I was 11 or 12 my mom has been pressuring me to lose weight. She used to force me to go on very long walks to lose weight and made comments about my body and talked about weight loss in front of me all the time. I love her but good lord, doing this to a child...",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f7d00xe": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f7d00xe",
                "Author": "coloraturing",
                "Date Created": "11-12-2019 18:15:36",
                "Upvotes": 1,
                "Text": "two of my younger cousins (a 9 yo girl + 5 yo boy) both have said/done things that break my heart. my 9 yo cousin decided to cut out sugar and regularly says she feels fat (she's definitely not, she dances and is a good weight). her little brother has cried before over not having abs. it's horrible.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f7e3oxd": [
        [
            {
                "Parent ID": "t3_duvj6y",
                "Comment ID": "f7e3oxd",
                "Author": "Maitebanana",
                "Date Created": "11-13-2019 05:37:24",
                "Upvotes": 1,
                "Text": "My mum was an anorexic and I became one too... People with eating disorders should be fully recovered before they have kids.\n\nNot saying that this couple had some problem, but I read lots of messages here saying that they are scared to pass this on to their children. Well, first recovery, then children",
                "Edited?": "11-13-2019 06:27:05",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}