{
    "elj0pnu": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elj0pnu",
                "Author": "3cats_in_atrenchcoat",
                "Date Created": "04-22-2019 16:59:47",
                "Upvotes": 101,
                "Text": "For me it's more experiences. \n\nI'm not skinny enough to go \"out\" Ie to fancy restaurants or bars or occasions because I feel like you can put lipstick on this pig but it's still a pig kinda deal. Concerts or clubs or local events? Nope\n\nI almost dread trips or even going camping and hiking where I'm literally almost alone in the woods because I don't deserve fun? I guess \n\nThe awful thing is that I LOVE all those things. I'm not a big partyer at all but I used to enjoy going out with friends a few times a year. I love food and breweries and music and blah blah \n\nBut I think it's just that my disorder for the most part is centred around depression and self harm so. Ya know. Fuck me",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "elj2v07": [
                {
                    "Parent ID": "t1_elj0pnu",
                    "Comment ID": "elj2v07",
                    "Author": "synedchdochee",
                    "Date Created": "04-22-2019 17:25:55",
                    "Upvotes": 13,
                    "Text": "YES! My friends and I are planning a trip this summer and I'm so looking forward to it, but I know if I'm not at a specific goal weight or lower I'm not going to enjoy myself at all, and rather be thinking about how much more fun I'd be having if I were skinnier. How much better the photos we'll all take will look if my fatass doesn't ruin the aesthetic of my two very thin, fit friends. Ughh",
                    "Edited?": "04-22-2019 17:30:48",
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "eljbua7": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "eljbua7",
                "Author": "MymlanOhlin",
                "Date Created": "04-22-2019 19:23:02",
                "Upvotes": 33,
                "Text": "Y E S. \"You wouldn't put makeup on a pig, you wouldn't paint on a dirty canvas\" echoes in my head at all times. It's everything from styling my hair, to hanging out with friends, to brushing my teeth. It is quite a scary mindset.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eljcfj3": [
                {
                    "Parent ID": "t1_eljbua7",
                    "Comment ID": "eljcfj3",
                    "Author": "milkeyedmenders",
                    "Date Created": "04-22-2019 19:31:01",
                    "Upvotes": 12,
                    "Text": "ugh exactly, i’m so sorry you deal w this too:( mentioning brushing your teeth is an interesting addendum bc i realized (and this is so gross lol i hate myself) that there have been so many times i won’t shower if i feel too fat, part of which being the obvious i dont wanna look at or touch my naked body, but also a big piece of it is just like i don’t wanna take care of myself because i’m not worth it....and then i feel even grosser about myself cuz it’s like ew what is my problem lmao",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ]
        }
    ],
    "elj2i8p": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elj2i8p",
                "Author": "synedchdochee",
                "Date Created": "04-22-2019 17:21:25",
                "Upvotes": 21,
                "Text": "For me, and I know how fucked up this is, it's going to the doctor. I have an actual bad phobia of hospitals / doctors offices, to the point where when I went and visted my sister-in-law when my niece was born, I got inside and started immediatly sobbing and had to sit outside crying on the curb with my mom to calm down, because I couldn't stand being inside anymore. \n\nI have some ear issues fairly often but I refuse to go back to the doctor until I substantially weigh less than I did before, because they weigh you with shoes on and if I know my weight is the same or worse, goes up (even if it's just clothes and shoes weight!!) and it gets recorded into permanence, I WILL have a full sobbing breakdown on the scale. I hate that I can recognize this is melodramatic and irrational but!! here we are.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eljcy98": [
                {
                    "Parent ID": "t1_elj2i8p",
                    "Comment ID": "eljcy98",
                    "Author": "milkeyedmenders",
                    "Date Created": "04-22-2019 19:38:04",
                    "Upvotes": 6,
                    "Text": "god i am so sorry you have to deal with that, my heart goes out to you. i’ve done similarly actually, recently i let this infection i knew i had spread (nothing super serious im good) instead of going to my clinic because i was so terrified of seeing my weight and having it be documented as higher... its so embarrassing for some reason even though my doctors never commented on it before",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ]
        }
    ],
    "eljj407": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "eljj407",
                "Author": "hekkin_dino",
                "Date Created": "04-22-2019 20:56:58",
                "Upvotes": 13,
                "Text": "I’m not letting myself buy a certain body lotion until I’m below one of my goal weights, which I’m just realizing is a weird thing to do",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elk2ysw": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elk2ysw",
                "Author": "elhae",
                "Date Created": "04-23-2019 02:32:50",
                "Upvotes": 12,
                "Text": "i do this with almost everything. i feel like my life can’t start till i’m thin.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "elk6lys": [
                {
                    "Parent ID": "t1_elk2ysw",
                    "Comment ID": "elk6lys",
                    "Author": "MyNamelessFace",
                    "Date Created": "04-23-2019 04:19:39",
                    "Upvotes": 5,
                    "Text": "this.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "eljdrqd": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "eljdrqd",
                "Author": "tulipsandmothballs",
                "Date Created": "04-22-2019 19:48:53",
                "Upvotes": 7,
                "Text": "All. The. Time.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eljmi8w": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "eljmi8w",
                "Author": "eatsomethingxo",
                "Date Created": "04-22-2019 21:39:49",
                "Upvotes": 6,
                "Text": "Starting certain hobbies because how could I handle a new hobby if my I can't even get my weight under control .",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elk6l5t": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elk6l5t",
                "Author": "allyouneedisredbull",
                "Date Created": "04-23-2019 04:19:00",
                "Upvotes": 5,
                "Text": "After my last relationship ended I feel like I don’t deserve to be in one until I’m thin enough. I feel like men have treated me the way they have because of my weight and that if I was thinner they wouldn’t do it. I know it’s messed up.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elk7m4l": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elk7m4l",
                "Author": "scarletfawn",
                "Date Created": "04-23-2019 04:49:10",
                "Upvotes": 4,
                "Text": "Half my closet is waiting for better days eh... Also, whereas I love dancing, I'm not as motivated when I don't \"look like a dancer\" (silly I know, ofc there isn't one specific dancer body type)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elk7xg6": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elk7xg6",
                "Author": "KatVanJet",
                "Date Created": "04-23-2019 04:58:04",
                "Upvotes": 4,
                "Text": "YES! Oh God, it's probably my LEAST favorite part about my ED. Like I won't draw or write if i'm feeling fat because I don't look like my own ridiculous romanticized idea of an artist so I don't deserve to do art.\n\nI'm a stupid pos lmao.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elk8z3g": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elk8z3g",
                "Author": "LisichkaYenotik",
                "Date Created": "04-23-2019 05:26:06",
                "Upvotes": 4,
                "Text": "Yeah, I'm not allowed to buy ANY clothes/cosmetics/tech products until I've completed 30 days of Ballet Beautiful and get my 26 inch waist back.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elkjqp0": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elkjqp0",
                "Author": "hanlus",
                "Date Created": "04-23-2019 08:22:43",
                "Upvotes": 4,
                "Text": "Going on trips. I know I'm going half for the photo op, half to eat everything in sight to experience the culture, so I gotta be my absolute thinnest so I'll look good in those photos while eating a hugeass ice cream cone or lamb skewer, ya know? Too bad my gw feels unreachable haha... guess I'll never be taking those trips I wanted.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "elkogm9": [
                {
                    "Parent ID": "t1_elkjqp0",
                    "Comment ID": "elkogm9",
                    "Author": "ilikebigbooks98765",
                    "Date Created": "04-23-2019 09:15:26",
                    "Upvotes": 5,
                    "Text": "Omg same. I really want to go on a tropical vacation or a cruise or something, but I can't until I reach my gw, and even then how will I be able to eat all the amazing food if I bloat so bad whenever I eat anything?? 😫",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "elk8p18": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elk8p18",
                "Author": "[deleted]",
                "Date Created": "04-23-2019 05:18:56",
                "Upvotes": 3,
                "Text": "not related, but are you a joanna newsom fan? i adore her :)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "elkp441": [
                {
                    "Parent ID": "t1_elk8p18",
                    "Comment ID": "elkp441",
                    "Author": "milkeyedmenders",
                    "Date Created": "04-23-2019 09:22:29",
                    "Upvotes": 3,
                    "Text": "yes she’s incredible :’)",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ]
        }
    ],
    "elkafdm": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elkafdm",
                "Author": "daintyyeo",
                "Date Created": "04-23-2019 06:00:42",
                "Upvotes": 3,
                "Text": "basically my main objective \n\"i will get to eat this when i will be thin\"",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elld1h7": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elld1h7",
                "Author": "Teeheeheehohoho",
                "Date Created": "04-23-2019 13:31:13",
                "Upvotes": 3,
                "Text": "For me it’s accepting physical affection from my boyfriend. It hurts so much to think I may be hurting him but when I feel “too big” I cringe away from him when he tries to hug me or touch me and I just say I’m feeling ill again. Last night he asked me “I can’t even hug you?” And he sounded so hurt and confused it broke my heart. Typing this out is actually the first time I’ve articulated it to even myself and I realize how fucked up I really am.  Now I’m crying lol",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ellfi8d": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "ellfi8d",
                "Author": "SpaceWhale88",
                "Date Created": "04-23-2019 13:56:27",
                "Upvotes": 3,
                "Text": "I just want my outsides to look better than my insides. By being fat, all my insecurities, vulnerabilities, and failures are on display. I dont have many status-y things like a husband, home I own (I live in a studio), kids, or a career I can brag about. If I were some high powered business executive I could say my career is a reason why I dont have a family. I love my career but it's not that fancy and i dont make tons of money. \n\nPart of me feels that what's holding me back from a lot is my weight I dont deserve those things anyway while I'm this big. And I worry everyone around me is like \"of course shes unsuccessful, have you seen her?\" \n\nI'm an open and supportive friend. I can be fun to be around. I support myself financially. Yet I dont see the progress I've made in my life bc it's not a status thing. No one sees it. I dont have anything to brag about but I also feel like I don't deserve those things anyway. But if I was thin, I could show myself off. People would assume I'm doing well. When they find out I'm single theyd say \"but you're so pretty!\" And not \"I know you want to date but men are very visual. \" I don't deserve to date some amazing guy when I'm so sub par.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ellrtsp": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "ellrtsp",
                "Author": "LowCalPal",
                "Date Created": "04-23-2019 16:01:46",
                "Upvotes": 3,
                "Text": "Things I have done because I was Too Fat to Deserve The Thing:\n\n* Walked into a job interview waiting room, surveyed the other candidates, turned around and walked out\n\n* Worn ill-fitting and worn-out garments far longer than normal or acceptable rather than purchase new garments\n\n* Spent 45+ minutes doing a full face of makeup to go out, only to stare at my made-up face in the mirror, realize \"who am I kidding?\", and wash it all off\n\n* Gone book-shopping and then re-shelved the most beautiful book without buying it, despite wanting it and having the money",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elm7kdw": [
        [
            {
                "Parent ID": "t3_bg7g4f",
                "Comment ID": "elm7kdw",
                "Author": "BoofDatKratom247",
                "Date Created": "04-23-2019 19:06:52",
                "Upvotes": 2,
                "Text": "I stopped wearing makeup because i felt like it was just sad trying to look pretty. I never wore cute clothes or dresses because of the same reason.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}