{
    "ef8jy63": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef8jy63",
                "Author": "diet-coke-addict",
                "Date Created": "01-28-2019 23:15:33",
                "Upvotes": 65,
                "Text": "Proud of you! Bralettes are so fucking cute and way more comfortable than normal bras. Sometimes it helps so much to just do the thing you were putting off until you reach that elusive goal weight and allow yourself the opportunity to be happy (even about a small thing) 😊 ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef8m9f0": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef8m9f0",
                "Author": "smittenkitt3n",
                "Date Created": "01-28-2019 23:48:14",
                "Upvotes": 31,
                "Text": "that’s great! it’s important to celebrate the small victories :) \n\ni love bralettes so much that i don’t own any underwire bras! they’re soo much more comfortable! ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef8rha8": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef8rha8",
                "Author": "halconpequena",
                "Date Created": "01-29-2019 01:13:20",
                "Upvotes": 37,
                "Text": "I used to only wear sports bras because I felt too fat and like my boobs were way too big. Id cry about it a lot and fantasize about just cutting my boobs away. However, since maybe this October or so, I’ve started wearing my nice bras and actually gone out with a sheer bra and top to party and I felt so fucking free! People complimented me and it really helped me see that maybe I’m not totally hideous. I still struggle with my boobs and my body image A LOT and think about getting my boobs done, but it’s baby steps :) \n  \nSpeaking of which, I ordered some bras and undies from Rihanna’s line and I can’t wait to try them on later! \n\nupdate: I ordered two bras in the same size and one is too big and one is too small 🤔🤷🏻‍♀️ also i read the reviews for underwear and got one in s and one in m because it supposedly ran super tiny and they look the same wtf lol?? But both fit! I hate sizing lmao. Just gonna be calm and exchange my bras but omg ",
                "Edited?": "01-29-2019 06:25:40",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef8qe2b": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef8qe2b",
                "Author": "JuBelen",
                "Date Created": "01-29-2019 00:54:49",
                "Upvotes": 11,
                "Text": "Yeah!! I always thought.bralettes were too cute and femenine for me but one day I said 'fuck it' and wore one someone had given me as a present. I own three now! I only wear them when I know I'm getting laid (I don't wear bras normally) and they make me feel beautiful!! ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef9c7rj": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef9c7rj",
                "Author": "thenewbroken",
                "Date Created": "01-29-2019 07:30:05",
                "Upvotes": 7,
                "Text": "lmao i still wear sports bras from when i was 8 ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef9gtwz": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef9gtwz",
                "Author": "YouSmellOfButterfly",
                "Date Created": "01-29-2019 08:24:22",
                "Upvotes": 6,
                "Text": "Wow I'm glad someone else has this goal. Bralettes are awesome and so fuckin cute, I like the ones from Aerie.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef97lpi": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef97lpi",
                "Author": "jayrambling",
                "Date Created": "01-29-2019 06:31:15",
                "Upvotes": 3,
                "Text": "That's a great thing to be proud of! I switched to wearing only bralettes a few years ago and I'll never go back to underwire. They're so much more comfortable",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef9n59r": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef9n59r",
                "Author": "[deleted]",
                "Date Created": "01-29-2019 09:29:28",
                "Upvotes": 3,
                "Text": "yay!! i’m not small by any means but i love bralettes. i feel so much more comfy in them",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef9v2vo": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef9v2vo",
                "Author": "MissNietzsche",
                "Date Created": "01-29-2019 10:44:57",
                "Upvotes": 3,
                "Text": "Gahhh, one of my goals is to start wearing bralettes. My boobs, unfortunately, are too big to fit into them. I'm at a normal weight now, and though my boobs have definitely gotten smaller, they're still way too fxcking big for bralettes. BUT, I'm getting a breast reduction this summer, and after that, I'm going to be able to wear all the bralettes I missed out on when they were popular when I was a teen.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef9kign": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef9kign",
                "Author": "mewme-mow",
                "Date Created": "01-29-2019 09:03:26",
                "Upvotes": 2,
                "Text": "i fucking love them, i barely wear anything else now because bras just feel hellish in comparison ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "efa57c0": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "efa57c0",
                "Author": "dstsknnd",
                "Date Created": "01-29-2019 12:13:40",
                "Upvotes": 2,
                "Text": "Wow, I did almost the exact same thing. I bought a bunch of cute bralettes and thought that once I was skinny enough, I'd be able to pull them off. Now I just wear them all the time anyway. They're so much more comfortable than bras honestly",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "efa676w": [
                {
                    "Parent ID": "t1_efa57c0",
                    "Comment ID": "efa676w",
                    "Author": "reynita1",
                    "Date Created": "01-29-2019 12:22:04",
                    "Upvotes": 2,
                    "Text": "i’m learning more and more that i’d much rather be comfortable, in every sense of the word. comfortable with what i’m wearing, comfortable with how i look, and comfortable in my own skin. it’s a process. but i feel like saying fuck it and getting myself the clothes i think are cute and wearing them now rather than waiting for a goal that i know realistically might not happen is a good step in the right direction",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ]
        }
    ],
    "efapmhf": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "efapmhf",
                "Author": "aerienne",
                "Date Created": "01-29-2019 15:15:16",
                "Upvotes": 2,
                "Text": "Way to go!\n\nI've always just worn sports bras, even before my ED. I finally got a few bralettes for summer and they are marvelous! They really do have the power to make you feel a bit better. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ef974vl": [
        [
            {
                "Parent ID": "t3_akwelc",
                "Comment ID": "ef974vl",
                "Author": "kittenbun",
                "Date Created": "01-29-2019 06:23:58",
                "Upvotes": 2,
                "Text": "omg congrats! this is a total goal of mine. i think bralettes are so adorable and i strive to one day only own them. rn i have a total of 4 bras (all underwired) and i can't wait til i'm so flat chested i just don't require them anymore lol",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}