{
    "f9o38sb": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9o38sb",
                "Author": "munna_musharna",
                "Date Created": "12-04-2019 15:39:50",
                "Upvotes": 245,
                "Text": "For anyone who freaked out reading two oreos = 150 calories, I am here to reassure you that one oreo is still 53 kcal like you thought",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9oaa16": [
                {
                    "Parent ID": "t1_f9o38sb",
                    "Comment ID": "f9oaa16",
                    "Author": "bunnywithbpd",
                    "Date Created": "12-04-2019 16:51:01",
                    "Upvotes": 121,
                    "Text": "I was thinking of double stuffed 😂 sorry for the panic attack",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f9si7bl": [
                        {
                            "Parent ID": "t1_f9oaa16",
                            "Comment ID": "f9si7bl",
                            "Author": "loversalibi",
                            "Date Created": "12-05-2019 18:41:58",
                            "Upvotes": 4,
                            "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f9o8mid": [
                {
                    "Parent ID": "t1_f9o38sb",
                    "Comment ID": "f9o8mid",
                    "Author": "crossdressingcarp",
                    "Date Created": "12-04-2019 16:33:28",
                    "Upvotes": 63,
                    "Text": "the real hero of this thread",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f9o8ugq": [
                        {
                            "Parent ID": "t1_f9o8mid",
                            "Comment ID": "f9o8ugq",
                            "Author": "munna_musharna",
                            "Date Created": "12-04-2019 16:35:49",
                            "Upvotes": 23,
                            "Text": "happy to be of service 😇",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f9owavv": [
                {
                    "Parent ID": "t1_f9o38sb",
                    "Comment ID": "f9owavv",
                    "Author": "calliely",
                    "Date Created": "12-04-2019 21:06:52",
                    "Upvotes": 12,
                    "Text": "That was an emotional roller coaster ngl",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9o1vi8": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9o1vi8",
                "Author": "Aleph0-4",
                "Date Created": "12-04-2019 15:26:46",
                "Upvotes": 108,
                "Text": "Yeah as much as we hate to admit it there are people who effortly have bodies we kill ourselves to obtain. We also dont know more about nutrition just because we can add some calories together. We're here because we're unfortunate. Theres no way to be \"good ar your ED\" bc no-one in the real world gives a shit.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9oq7gw": [
                {
                    "Parent ID": "t1_f9o1vi8",
                    "Comment ID": "f9oq7gw",
                    "Author": "ceruleanohara",
                    "Date Created": "12-04-2019 19:52:45",
                    "Upvotes": 22,
                    "Text": "I understand what you mean, but we all know it’s CI-CO. So “effortlessly” is really not true. There has to be so much behind the scenes for someone to just maintain skinny with the image of no effort. It’s not easy- especially with all the food thrown in our faces via advertising all.day.long.  I was doing great maintaining while working with a personal trainer 3x a week, running lightly, counting macros, weighing food... it’s not effortless. It just physically cannot be.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f9os8az": [
                        {
                            "Parent ID": "t1_f9oq7gw",
                            "Comment ID": "f9os8az",
                            "Author": "Aleph0-4",
                            "Date Created": "12-04-2019 20:15:43",
                            "Upvotes": 28,
                            "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9qfma0": [
                        {
                            "Parent ID": "t1_f9oq7gw",
                            "Comment ID": "f9qfma0",
                            "Author": "martpogboi",
                            "Date Created": "12-05-2019 09:38:51",
                            "Upvotes": 9,
                            "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9oszf7": [
                [
                    {
                        "Parent ID": "t1_f9os8az",
                        "Comment ID": "f9oszf7",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:24:25",
                        "Upvotes": 9,
                        "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9sk13h": [
                        {
                            "Parent ID": "t1_f9oszf7",
                            "Comment ID": "f9sk13h",
                            "Author": "loversalibi",
                            "Date Created": "12-05-2019 18:59:04",
                            "Upvotes": 3,
                            "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9omofs": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9omofs",
                "Author": "ci-fre",
                "Date Created": "12-04-2019 19:12:44",
                "Upvotes": 22,
                "Text": "yeah a LARGE part of my ED originated from \"skinny people don't eat a lot\" :/\n\nI lost weight till I was underweight, and then I realized \"hey, this is not very hard to maintain :D I can eat normal food!\" but then the idea that \"wait, but then I would just be a NORMAL HEALTHY person and I'm not supposed to do that\" took over which just lead me to eat less, not even in the pursuit of losing more weight but just because I didn't think I deserved to eat normally\n\ni've been >!5' and less than 80 lbs!< for a long time and it's not like i eat \"three baby carrots a day\" or something",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9o6fl7": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9o6fl7",
                "Author": "Europaische",
                "Date Created": "12-04-2019 16:11:12",
                "Upvotes": 21,
                "Text": "I agree on the TDEE part, I’ve been slowly recovering and eating my TDEE is hard and makes me feel like shit and I’m a very underweight young adult male.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9ogizs": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9ogizs",
                "Author": "why-am-i-like-this_",
                "Date Created": "12-04-2019 18:00:18",
                "Upvotes": 34,
                "Text": "To people who know me in real life I'm one of those skinny people who can eat whatever. I don't want them to know about my disordered eating habits so I just politely agree when they say that about me. They don't know about all the times where I eat next to nothing to compensate for the things like fast food and cake that I eat around them.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9ob6nh": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9ob6nh",
                "Author": "fatpigeon_",
                "Date Created": "12-04-2019 17:00:38",
                "Upvotes": 28,
                "Text": "I have had a friend for years who has always been “naturally” thin. She grew up in a health conscious family, meaning focused on nutrition and lifestyle not calorie counting. I’ve watched her grow up with a good sense of what her body needs and getting a moderate amount of exercise. I always think of her when I mentally question people’s explanations of their dietary habits, or see similar posts on here. \n\nGrowing up or spending time around people with no idea about what they eat, or eating poorly, hopping into crash diets, etc. can really screw your perception of what normal eating is. Mass consumption of and easy access to processed foods makes this so much worse. Once you’re used to seeing how most people eat, a skinny person who just eats a totally normal and healthy diet feels like a scam haha.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9o8tdm": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9o8tdm",
                "Author": "littlelivethings",
                "Date Created": "12-04-2019 16:35:30",
                "Upvotes": 23,
                "Text": "We’re all mentally ill and jealous but yeah it’s toxic and unfair. Certain medications (adhd drugs, Wellbutrin) cause weight loss and affect appetite. There are also illnesses like Crohn’s disease and hyperthyroidism that make it difficult for people to keep a healthy weight because their bodies can’t metabolize food efficiently. It’s all well and good to envy them until you consider they have to worry about things like shutting themselves during yoga class. \n\n(Yes, many of us do things to ourselves that can cause these same effects. But it’s not the same as having a chronic autoimmune disorder)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9o3460": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9o3460",
                "Author": "sugarysweet24",
                "Date Created": "12-04-2019 15:38:37",
                "Upvotes": 71,
                "Text": "Your rant is valid but I feel like these ppl are venting about disordered thoughts. the thoughts that EDs make us have tend to be not rooted in reality and even when they are, the emotions are wayyy overblown by our disorders. The ppl making these posts are likely thin themselves and can’t see it bc of their ED (and even if they’re not it’s nbd 🤷🏻‍♀️) so self moderation and help w managing disordered thoughts patterns is more helpful than assuming that these people are just bitter/toxic and not struggling themselves with body image.\n\nOn a side note I’m thin (have also been overweight) and I’d rather NOT have people going to bat for me when there is a lot more toxicity and hatred towards overweight people, especially people who binge, both in ED spaces and real life. (Like I almost never see BED mentioned on here or any consideration towards ppl who are genuinely overweight or obese.) People will always defend me when I’m thin af and starving myself but I never had that when I was overweight or binging during a previous recovery attempt. Hopefully this doesn’t come across as rude but saying “don’t hate skinny people/don’t skinny shame” is a bit tone deaf for an ED sub, considering what a lot of us do and why we’re here.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9o45iy": [
                {
                    "Parent ID": "t1_f9o3460",
                    "Comment ID": "f9o45iy",
                    "Author": "fragilmountain",
                    "Date Created": "12-04-2019 15:48:45",
                    "Upvotes": 16,
                    "Text": "I get your second part but there’s also plenty of people who DO appreciate people going to bat for them. Also as someone who used to be morbidly obese I’ll say that I never experienced any toxicity towards me but I did see skinny shaming among my peers. However that’s just my personal experience.",
                    "Edited?": "12-04-2019 16:37:41",
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f9o9hci": [
                        {
                            "Parent ID": "t1_f9o45iy",
                            "Comment ID": "f9o9hci",
                            "Author": "SongRiverFlow",
                            "Date Created": "12-04-2019 16:42:33",
                            "Upvotes": 34,
                            "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9obekz": [
                [
                    {
                        "Parent ID": "t1_f9o9hci",
                        "Comment ID": "f9obekz",
                        "Author": "fragilmountain",
                        "Date Created": "12-04-2019 17:03:02",
                        "Upvotes": 18,
                        "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9otp81": [
                        {
                            "Parent ID": "t1_f9obekz",
                            "Comment ID": "f9otp81",
                            "Author": "bright-horses",
                            "Date Created": "12-04-2019 20:35:12",
                            "Upvotes": 9,
                            "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9px7jz": [
                [
                    {
                        "Parent ID": "t1_f9o9hci",
                        "Comment ID": "f9px7jz",
                        "Author": "Pootties",
                        "Date Created": "12-05-2019 07:01:42",
                        "Upvotes": 4,
                        "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9p3esa": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9p3esa",
                "Author": "Edith-Anne-Newton",
                "Date Created": "12-04-2019 22:35:43",
                "Upvotes": 7,
                "Text": "Not to spout some fake-deep shit but i realized maybe over the past year or so that we can't chalk up *everything* in someone's life to choice. Like not everyone chooses to be skinny. \n\nI used to have a \"friend\" who had a body that I envied so much. Quotes bc she was an asshole to me. Sooooomehow what I didnt know was that she had Crohn's disease. Turns out Crohn's disease can make you lose your appetite and cause problems with malabsoprtion. *Sweet.* So I was jealous of a girl who could have been in a lot of pain. And I didn't find out until later that she often was. Weeeeeeee. :(",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9o8e6n": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9o8e6n",
                "Author": "mud_octopus",
                "Date Created": "12-04-2019 16:31:03",
                "Upvotes": 12,
                "Text": "I agree. I have had many heart felt conversations with friends who wish they could gain weight, and I truly feel for them. I understand it has shit all to do with my body or disorder.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9o4g7t": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9o4g7t",
                "Author": "[deleted]",
                "Date Created": "12-04-2019 15:51:37",
                "Upvotes": 18,
                "Text": "THANK YOU I hate it when people perpetuate that eating your TDEE is impossible if you're skinny.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9owlpu": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9owlpu",
                "Author": "taffynaffit",
                "Date Created": "12-04-2019 21:10:23",
                "Upvotes": 4,
                "Text": "thank you sm",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9odelj": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9odelj",
                "Author": "olivethedoge",
                "Date Created": "12-04-2019 17:25:07",
                "Upvotes": 26,
                "Text": "The reason people don't like it is because it's a lie. There may be a reason you don't gain weight but it isn't because you can't, it's because you don't eat enough to gain weight. Eat 4500 cal a day, you'll gain weight I promise.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9oehze": [
                {
                    "Parent ID": "t1_f9odelj",
                    "Comment ID": "f9oehze",
                    "Author": "bunnywithbpd",
                    "Date Created": "12-04-2019 17:37:24",
                    "Upvotes": 17,
                    "Text": "Some people have poor appetite signals to where they feel full after eating small amounts, some people suffer from depression, anxiety or EDs which they dont want to tell strangers. Some people can't afford to eat that much. So they literally, can't.\n \nFor some people, it's hard to gain weight. Not saying its impossible but their feelings are valid. And honestly let's face it, we aren't that mad because they're lying. We're mostly mad because we're *jealous*.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f9or10e": [
                        {
                            "Parent ID": "t1_f9oehze",
                            "Comment ID": "f9or10e",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:01:58",
                            "Upvotes": 8,
                            "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "falce5l": [
                        {
                            "Parent ID": "t1_f9oehze",
                            "Comment ID": "falce5l",
                            "Author": "olivethedoge",
                            "Date Created": "12-12-2019 14:20:26",
                            "Upvotes": 1,
                            "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f9r0lqy": [
                {
                    "Parent ID": "t1_f9odelj",
                    "Comment ID": "f9r0lqy",
                    "Author": "lotuslungs",
                    "Date Created": "12-05-2019 12:12:57",
                    "Upvotes": 3,
                    "Text": "People with cystic fibrosis have a lot of trouble gaining and maintaining weight because our bodies don’t absorb nutrients like they are supposed to and we are constantly fighting lung infections. We are usually skinny but eat a ton, it just doesn’t stick. \n\nI used to have a g-tube and even with taking my digestive enzymes and having 24/7 feeds I could barely maintain because my body was using everything and I was constantly coughing which burns a lot of calories. I’ve had a lung transplant now so I’m not fighting lung infections, but I still have trouble gaining weight even when I’m trying really hard and fighting my eating disorder thoughts. I’ve had nurses comment on my weight and say they “wish they could eat anything and not gain weight”- as I was recovering from the very painful g-tube surgery that I had to be awake for since my lungs were too sick for anesthesia. \n\nJust putting this out there to show that not all skinny people are “lying” about not being able to gain weight.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "falc416": [
                        {
                            "Parent ID": "t1_f9r0lqy",
                            "Comment ID": "falc416",
                            "Author": "olivethedoge",
                            "Date Created": "12-12-2019 14:18:12",
                            "Upvotes": 1,
                            "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9ofi3d": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9ofi3d",
                "Author": "fuschiaoctopus",
                "Date Created": "12-04-2019 17:48:39",
                "Upvotes": 18,
                "Text": "Agree. I've also been hating the popular trend in the last few months of projecting our EDs onto everyone and anyone around us. It's so common to see posts here insisting fasting is disordered, everyone on 1200/1500/dieting subs etc must have an ED, mocking posts on their subs or complaining they're triggering when imo it's disrespectful of us to invade their safe spaces and complain our EDs make their threads upsetting when there are whole communities devoted to fasting/IF/veganism/etc nutrition related stuff that explicitly say they can't accommodate EDs and the forums aren't meant for us. Fasting is not inherently unhealthy, it can be religious, spiritual, lots of evidence to suggest it can even contribute positively to health. And many people on places like 1200isplenty are extremely unhealthy, have a lot of weight to lose, and are literally dying and suffering mentally from the opposite of a restrictive eating disorder. I hate seeing people here drag their whole forum claiming they're all disordered or that their community is unhealthy/unsupportive because their posts can be taken out of context and applied to a restrictive ED in a toxic manner.\n\nIdk if I'm explaining myself well but I'm scared to post stuff like this on here bc it seems to get mass downvoted nowadays if you don't go along w the fasting = disordered, dieting = thinly veiled anorexia, 1200isplenty = edanonymemes in disguise hivemind. Hate to say it but context does matter. Sure, you can take an overeating meme from a 1200 sub and post it on anonymemes and get upvotes/relatability from both communities but it's just not the same. An obese person who desperately needs to lose weight medically and is struggling to do so posting for support and \"tips\" from their weight loss community is simply not the same as the exact same post on this forum coming from an underweight person with AN. I think it's projecting to the max to say keto, IF, fasting, or any lifestyle with any thought to eating habits whatsoever *must* be eating disordered just because those of us with literal eating disorders may use those lifestyles or eating habits as part of our disorders. Not all humans are the same.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9otmn1": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9otmn1",
                "Author": "ddmar",
                "Date Created": "12-04-2019 20:33:54",
                "Upvotes": 10,
                "Text": "I'm not underweight, but I'm definitely not overweight either. I'm relatively slim with an athletic build, at a BMI just under 19, and people have commented about how I can seemingly eat a fuckton without gaining weight. This is because I binge/overeat massive amounts in front of other people, then don't eat again for 3-4 days while working out intensely for about 16 hours during that fast. It's not healthy, and I'm not \"lucky\" or have a \"fast metabolism\" and I can't \"eat whatever I want without gaining weight.\"\n\nTHAT BEING SAID. I completely understand why people complain about it or feel bitterness towards me for what they see as my behavior vs. my physique. I want to be skinnier of course, but to people who are at a higher weight or body fat than me, all they see is the skinny girl who eats ten thousand calories at once without gaining weight. They see someone with a magic metabolism eating whatever I want and maintaining it effortlessly. They see someone with a more ideal body that society deems attractive, compared to them, if they're overweight. Yes, it sucks that they don't see how much I'm actually struggling. But let's not pretend like we'd rather be overweight with the same amount of mental struggles. I'd rather be struggling this much at my current weight than at the weight that the people I'm thinking about are currently at. Anyone would. And it's disingenuous to pretend otherwise. \n\nThin privilege absolutely exists. It's partially why we strive for thinness, if we're being absolutely honest with ourselves. So I don't get upset over people who feel bitter about my weight compared to theirs. Because in their eyes, and even my own comparatively, at least my struggle gets me a more desired result than their struggle.\n\nAnd let's be completely honest. You would ten million times rather be shamed for being skinny than for being fat. Sure, there may be some people who don't want to be super underweight. But NO ONE wants to be obese. There's far more stigma to being overweight than being underweight. It's honestly super annoying, and I really hate when people on subs like fatlogic pretend like being shamed for being skinny is the same as being shamed for being fat. There are far different societal ramifications for one than the other, and we ALL know it.",
                "Edited?": "12-04-2019 20:37:32",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9oveli": [
                {
                    "Parent ID": "t1_f9otmn1",
                    "Comment ID": "f9oveli",
                    "Author": "bunnywithbpd",
                    "Date Created": "12-04-2019 20:56:12",
                    "Upvotes": 3,
                    "Text": "Playing the \"who suffers more\" game is never helpful at all. It's a complex issue that we should just acknowledge both sides are hurt. \n\nIf someone complained about being skinny shamed it's just as validating as someone being fat shamed. Please stop trying to make it a competition of who has it worse.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f9ovw7k": [
                        {
                            "Parent ID": "t1_f9oveli",
                            "Comment ID": "f9ovw7k",
                            "Author": "ddmar",
                            "Date Created": "12-04-2019 21:01:58",
                            "Upvotes": 11,
                            "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9oxndd": [
                [
                    {
                        "Parent ID": "t1_f9ovw7k",
                        "Comment ID": "f9oxndd",
                        "Author": "bunnywithbpd",
                        "Date Created": "12-04-2019 21:22:48",
                        "Upvotes": 5,
                        "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "f9p0dkl": [
                        {
                            "Parent ID": "t1_f9oxndd",
                            "Comment ID": "f9p0dkl",
                            "Author": "ddmar",
                            "Date Created": "12-04-2019 21:56:07",
                            "Upvotes": 9,
                            "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9q99qm": [
                [
                    {
                        "Parent ID": "t1_f9p0dkl",
                        "Comment ID": "f9q99qm",
                        "Author": "bunnywithbpd",
                        "Date Created": "12-05-2019 08:49:17",
                        "Upvotes": 4,
                        "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qee53": [
                        {
                            "Parent ID": "t1_f9q99qm",
                            "Comment ID": "f9qee53",
                            "Author": "ddmar",
                            "Date Created": "12-05-2019 09:29:23",
                            "Upvotes": 1,
                            "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qewh5": [
                [
                    {
                        "Parent ID": "t1_f9qee53",
                        "Comment ID": "f9qewh5",
                        "Author": "bunnywithbpd",
                        "Date Created": "12-05-2019 09:33:18",
                        "Upvotes": 4,
                        "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qf7q1": [
                        {
                            "Parent ID": "t1_f9qewh5",
                            "Comment ID": "f9qf7q1",
                            "Author": "ddmar",
                            "Date Created": "12-05-2019 09:35:45",
                            "Upvotes": 1,
                            "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f9oh331": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9oh331",
                "Author": "dietthrowaway55",
                "Date Created": "12-04-2019 18:06:55",
                "Upvotes": 8,
                "Text": "I’m not mad at them I just find them annoying because it’s so hard to relate to. But honestly I find it just as annoying when people complain they can’t lose weight because usually they’re just not willing to put in the effort to count calories. I mean o feel bad for anyone who struggles with their weight, I just feel like they probably aren’t trying very hard if they’re complaining? I can’t compare myself to them but I feel like they didn’t bother to google the question “how do I lose/ gain weight” because it’s pretty simple in reality. It’s kind of like people are often willfully ignorant about that and many other things concerning their health.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9oqcad": [
                {
                    "Parent ID": "t1_f9oh331",
                    "Comment ID": "f9oqcad",
                    "Author": "TheShortGerman",
                    "Date Created": "12-04-2019 19:54:13",
                    "Upvotes": 3,
                    "Text": "This is how I feel too",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9ogliq": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9ogliq",
                "Author": "[deleted]",
                "Date Created": "12-04-2019 18:01:07",
                "Upvotes": 4,
                "Text": "Love this post so much! Thank you! 💕 You put a lot of people’s thoughts into the perfect words.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9p1taq": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9p1taq",
                "Author": "Spectrachic311311",
                "Date Created": "12-04-2019 22:14:24",
                "Upvotes": 2,
                "Text": "My sister was always effortlessly slim when she was on Dexedrine for ADD. Once she went off it she got her appetite back and gained about 20 lbs. Not a lot but at least now she enjoys her food.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9vd1f6": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9vd1f6",
                "Author": "DinosaursAndStarStuf",
                "Date Created": "12-06-2019 15:28:10",
                "Upvotes": 2,
                "Text": "I love how mixed our community is here, but I sometimes feel it would be so helpful to also have separate spaces for discussing life with different disorders. It's tough, because to those on the outside it starts to look like \"pro-ana\" or \"pro-mia\" pretty quick, even if it isn't.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9p6tx7": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9p6tx7",
                "Author": "AmbiguousCat",
                "Date Created": "12-04-2019 23:25:54",
                "Upvotes": 3,
                "Text": "For the most part I agree. \n\nBut there’s no such thing as “slow metabolism.”\n\nThe closest thing would be if someone had a hormonal or genetic disorder that affects how their body absorbs or retains energy.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9q83n3": [
                {
                    "Parent ID": "t1_f9p6tx7",
                    "Comment ID": "f9q83n3",
                    "Author": "bunnywithbpd",
                    "Date Created": "12-05-2019 08:40:07",
                    "Upvotes": 3,
                    "Text": "I never mentioned slow metabolism?",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f9q9bs9": [
                        {
                            "Parent ID": "t1_f9q83n3",
                            "Comment ID": "f9q9bs9",
                            "Author": "AmbiguousCat",
                            "Date Created": "12-05-2019 08:49:43",
                            "Upvotes": 0,
                            "Text": "Yes but you said fast metabolism, Same exact idea.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qaba6": [
                [
                    {
                        "Parent ID": "t1_f9q9bs9",
                        "Comment ID": "f9qaba6",
                        "Author": "bunnywithbpd",
                        "Date Created": "12-05-2019 08:57:29",
                        "Upvotes": 3,
                        "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qetz9": [
                        {
                            "Parent ID": "t1_f9qaba6",
                            "Comment ID": "f9qetz9",
                            "Author": "AmbiguousCat",
                            "Date Created": "12-05-2019 09:32:46",
                            "Upvotes": -1,
                            "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9p8wpq": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9p8wpq",
                "Author": "hostility_kitty",
                "Date Created": "12-04-2019 23:59:30",
                "Upvotes": 1,
                "Text": "I weigh 101 lbs, but that’s only because I eat like 600 calories a day, sometimes even less. I don’t binge, purge, or have a fast metabolism and people think I’m naturally skinny. But they don’t know how little I eat. Some days I don’t even eat anything except seaweed.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9rws2q": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9rws2q",
                "Author": "[deleted]",
                "Date Created": "12-05-2019 15:46:33",
                "Upvotes": 1,
                "Text": "I wish people would stop pretending they are effortlessly thin (when in reality they're doing extreme things to achieve it) to an extreme where it's not normal\n\nThey are inflicting complexes on other people that set them up for developing eating disorders or furthering existing eating disorders. It's license to be infinitely critical of others and bully them\n\nCelebrity culture did this to the public for years, and celebrity culture is dead because the public have done the same thing. They are uneducated about the risks\n\n\"Naturally thin\" gets abused- out of self-defence- there's nothing natural about being.. when it gets into weight loss territory that is seriously abnormal and disordered from a health perspective\n\nI worry about people who were like me before society's obsession with being thin screwed them up and the messages they're getting- who were just normal, athletic\n\nWith some insecurities that were accelerated and influenced through people defending themselves against thin shaming- it probably had nothing to do with them but they get dragged into it\n\nCarrying on and on past underweight and past emaciated with a lot of illusions around it- thanks the right wing conservatives. Their denial of being thin and inability to accept it is so deranged. They're like Jehovah's Witness. They've got really dry personalities and they want to be like Nicole Richie and they judge people for looking at magazines\n\nThey make decisions about people who are supported financially for having mental illnesses, and they're influencing perceptions of the unemployed and people with eating disorders\n\nTheir idiocy is invalidating towards people with eating disorders who can't get help- they think because they can do it, everyone else should, and they're very judgemental- if you died from your ED, they'd say it was natural causes and cover it up\n\nThey think anorexia is a myth, no one is anorexic, and if you think you had it years ago you were just obsessed with mental illness documentaries and you needed to get a life/get a job- they're in Parliament deciding who gets money/support, etc\n\nIt has some role in maintaining the status quo, the extreme denial of it. I don't think you should have to make a public statement about why you are whatever you are, or justify it, or pretend you're doing something you're not\n\nI think there are social pressures to justify it and explain yourself and take a side, and you don't have to do that- to cover up or whatever\n\nI think people freak out and think something is going to happen if they don't. I think it plays a minimal role in why people get together and stay together, when any types of relationships are committed",
                "Edited?": "12-05-2019 16:03:24",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9oaiig": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9oaiig",
                "Author": "Sydney142",
                "Date Created": "12-04-2019 16:53:30",
                "Upvotes": -6,
                "Text": "Honestly I think this goes both ways. I want to be skinny people but a lot of the time I’m actually more jealous of fat people and I haaaate fat people when I’m in a restaurant. I know it’s not good but my voice in my head is “wow look at that... god I’m so hungry.... fat bitch shoveling shit in her... god I’m so hungry... fucking pie hole” “you want a bite?” “Do I look like I eat, bitch?” And I honestly feel this way for regular looking people eating regular amounts of food but I can’t help that thought.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9p30x0": [
                {
                    "Parent ID": "t1_f9oaiig",
                    "Comment ID": "f9p30x0",
                    "Author": "ddmar",
                    "Date Created": "12-04-2019 22:30:29",
                    "Upvotes": 5,
                    "Text": "Yeah, you're the reason why people think it's ok to be bitter and toxic towards skinny people",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9paw26": [
        [
            {
                "Parent ID": "t3_e65d8t",
                "Comment ID": "f9paw26",
                "Author": "wetblanketdreams",
                "Date Created": "12-05-2019 00:35:09",
                "Upvotes": -6,
                "Text": "I just don't think it's ever going to be remotely on the same level. Fat people get shamed every day, and being thin/lean (especially as a woman) is highly admirable and coveted. I don't think we should go out of our way to be toxic towards thin people but they certainly don't need us protecting or speaking out for them. Almost everybody is just jealous of lean/thin people. No one is jealous of someone who is overweight. The shame of being a bigger person is probably the leading cause of having shtity self-esteem. I'm not wasting my energy and time on protecting people who don't need it and thereby distracting from the real shaming occuring towards overweight individuals. This just feels like an \"*ALL lives matter*\" complaint on your end.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9q8fgw": [
                {
                    "Parent ID": "t1_f9paw26",
                    "Comment ID": "f9q8fgw",
                    "Author": "bunnywithbpd",
                    "Date Created": "12-05-2019 08:42:45",
                    "Upvotes": 7,
                    "Text": "You're in an ED sub, where skinny is glorified. Not everyone thinks the way we think. Just because someone else is suffering in a different way doesnt mean they dont deserve help. Thin people struggle with self esteem issues too...jesus christ.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f9si7bl": [
                [
                    {
                        "Parent ID": "t1_f9oaa16",
                        "Comment ID": "f9si7bl",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:41:58",
                        "Upvotes": 4,
                        "Text": "bruh same i was like “what??? but they literally are 150 for two????” and i just realized whenever i buy oreos i don’t even bother with the single stuf 😭",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o8ugq": [
                [
                    {
                        "Parent ID": "t1_f9o8mid",
                        "Comment ID": "f9o8ugq",
                        "Author": "munna_musharna",
                        "Date Created": "12-04-2019 16:35:49",
                        "Upvotes": 23,
                        "Text": "happy to be of service 😇",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9os8az": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9os8az",
                        "Author": "Aleph0-4",
                        "Date Created": "12-04-2019 20:15:43",
                        "Upvotes": 28,
                        "Text": "Youre right most skinny people maintain it through exercise and controlling their diet to some extent. But theres also people who have small appetites or are picky eaters. It also depends on where you live too. In the US, its probably hard with big portions and fast food. Where i come from, the portions are typically half of western portions and sharing food is norm so i see quite a few naturally thin people",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oszf7": [
                        {
                            "Parent ID": "t1_f9os8az",
                            "Comment ID": "f9oszf7",
                            "Author": "ceruleanohara",
                            "Date Created": "12-04-2019 20:24:25",
                            "Upvotes": 9,
                            "Text": "That’s true. When I lived in a Mediterranean country I did see a lot more thin people who ate pasta literally every day- and lives revolved around eating. Like really good food :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qfma0": [
                [
                    {
                        "Parent ID": "t1_f9oq7gw",
                        "Comment ID": "f9qfma0",
                        "Author": "martpogboi",
                        "Date Created": "12-05-2019 09:38:51",
                        "Upvotes": 9,
                        "Text": "Until I developed my eating disorder I was able to eat whatever I wanted and maintained around 125-130 at 5’7 \nI literally didn’t put any thought into what I ate and had a massive sweet tooth, rarely did I go a day without cookies or ice cream or some type of sweets and exercise was basically a foreign concept to me\nMany of my friends were genuinely the same way\nCICO might be true but it doesn’t mean everyone is putting in boat loads of effort \nJust because you personally put in effort doesn’t make it a universal case",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9o9hci": [
                [
                    {
                        "Parent ID": "t1_f9o45iy",
                        "Comment ID": "f9o9hci",
                        "Author": "SongRiverFlow",
                        "Date Created": "12-04-2019 16:42:33",
                        "Upvotes": 34,
                        "Text": "As someone who has been back and forth on both ends, there was a TON more toxicity when I was obese/overweight than I was skinny. And it was a lot more vitriolic. Not saying that skinny shaming doesn't exist, but I feel like people on this site like to make it seem like skinny shaming is way worse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9obekz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9obekz",
                            "Author": "fragilmountain",
                            "Date Created": "12-04-2019 17:03:02",
                            "Upvotes": 18,
                            "Text": "I don’t think they’re saying skinny shaming is way worse. But it’s just as hurtful. I have this one friend that was constantly getting told to “eat a burger” or that she was like a twig and a lot of other stuff like that. Constantly. Those are just two examples but trust me it was worse. And you could see how much it mentally drained her. \n\nI personally never faced any toxicity even when I was obese. I’m very thankful for that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9px7jz": [
                        {
                            "Parent ID": "t1_f9o9hci",
                            "Comment ID": "f9px7jz",
                            "Author": "Pootties",
                            "Date Created": "12-05-2019 07:01:42",
                            "Upvotes": 4,
                            "Text": "Yeah I just roll my fucking eyes when people make skinny shaming sound like it's even close to fat shaming. The only thing that is similar is that it has to do with weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9or10e": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "f9or10e",
                        "Author": "ceruleanohara",
                        "Date Created": "12-04-2019 20:01:58",
                        "Upvotes": 8,
                        "Text": "True. But it is easy to gain weight. That’s what freaks us all out. A little over pour of oil, little too much salad dressing, and we’re over calories. What would it be like to just eat? And not care?? My god it would be so...easy. No weighing thoughts, no guilt, no cares. Just easy to eat whenever you felt a hunger pain. Whenever you craved something. With nothing holding you back. Gah. So easy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falce5l": [
                [
                    {
                        "Parent ID": "t1_f9oehze",
                        "Comment ID": "falce5l",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:20:26",
                        "Upvotes": 1,
                        "Text": "Yes, people who don't eat much don't gain weight. That's the point. They aren't people who 'eat all day and never gain an ounce, guess I just have a fast metabolism, don't hate me'.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "falc416": [
                [
                    {
                        "Parent ID": "t1_f9r0lqy",
                        "Comment ID": "falc416",
                        "Author": "olivethedoge",
                        "Date Created": "12-12-2019 14:18:12",
                        "Upvotes": 1,
                        "Text": "Just an infitestimally small percentage of them.How many calories a day did you injest?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9ovw7k": [
                [
                    {
                        "Parent ID": "t1_f9oveli",
                        "Comment ID": "f9ovw7k",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:01:58",
                        "Upvotes": 11,
                        "Text": "I'm not saying one is suffering more or less than another. I'm saying it's disingenuous to pretend like skinny shaming is just as bad as fat shaming. If someone were upset over being shamed for being skinny, I obviously wouldn't tell them \"Oh well the fat person being shamed has it worse.\" But acknowledging that there are different levels of privilege in a more neutral environment isn't the same thing as invalidating someone else's experience.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9oxndd": [
                        {
                            "Parent ID": "t1_f9ovw7k",
                            "Comment ID": "f9oxndd",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-04-2019 21:22:48",
                            "Upvotes": 5,
                            "Text": "You literally just contradicted yourself the first two sentences. You cant just make blanket statements on complex issues. That is never helpful",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9q9bs9": [
                [
                    {
                        "Parent ID": "t1_f9q83n3",
                        "Comment ID": "f9q9bs9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 08:49:43",
                        "Upvotes": 0,
                        "Text": "Yes but you said fast metabolism, Same exact idea.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qaba6": [
                        {
                            "Parent ID": "t1_f9q9bs9",
                            "Comment ID": "f9qaba6",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:57:29",
                            "Upvotes": 3,
                            "Text": "You said there are genetic disorders which affect how fast or slow you consume energy. That's metabolism. Marfanoid–progeroid–lipodystrophy syndrome is an example. \nYou cant have a slow metabolism because you have to somehow produce energy to maintain your body weight while apparently eating too little to maintain it. Claiming to only eat 600 calories a day for a year and staying at 300 pounds is impossible. That breaks the laws of thermodynamics. \nYou can have fast because you can be bad at absorbing energy and just simply dispose too much. Its RARE but it can apply to some people which I dont want to exclude",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9sk13h": [
                [
                    {
                        "Parent ID": "t1_f9oszf7",
                        "Comment ID": "f9sk13h",
                        "Author": "loversalibi",
                        "Date Created": "12-05-2019 18:59:04",
                        "Upvotes": 3,
                        "Text": "plus europe or basically any country besides the US is infinitely more walkable, but most of our major cities and even smaller towns were designed around automobiles. boston is hella walkable because it’s one of our oldest cities, and its planning predates cars, but most of us can’t walk to get around so that makes a big impact because most europeans do waaaaay more walking than us stateside",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9otp81": [
                [
                    {
                        "Parent ID": "t1_f9obekz",
                        "Comment ID": "f9otp81",
                        "Author": "bright-horses",
                        "Date Created": "12-04-2019 20:35:12",
                        "Upvotes": 9,
                        "Text": "Agreed. When I was obese I felt invisible. Now that I'm underweight, I feel exposed. Yesterday, walking past a pub, a bunch of men were talking about me - I heard, \"That one needs a burger up her - I can tell you what else she needs up her.\" At an art gallery on the weekend, the woman greeting everyone at the door said to me (loudly), \"Have you ever eaten anything in your life?\" At a BBQ a couple weeks ago, an acquaintance said to my boyfriend, \"Does she ever eat?\"\n\nNot saying skinny-shaming is worse - my experience is also simply that people feel much freer about commenting on my body to my face now.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9p0dkl": [
                [
                    {
                        "Parent ID": "t1_f9oxndd",
                        "Comment ID": "f9p0dkl",
                        "Author": "ddmar",
                        "Date Created": "12-04-2019 21:56:07",
                        "Upvotes": 9,
                        "Text": "Look, two people of different sizes can be suffering, and it's equally debilitating. But the reality is that society treats skinny people way better than they treat fat people. That doesn't mean one is suffering more than the other by any means. But it does mean that there's a higher likelihood that one gets looked at more kindly by more of society than the other. Being skinny doesn't mean your life is easy by any means or even that it's easier than someone who's overweight. But it does mean that you're less likely to be as negatively viewed by other people purely for your weight than someone who's overweight. I'm not saying this is going to happen automatically for every skinny person. But if I, as a person with a lower body fat percentage, were to complain about constantly being hungry, I'd probably be taken more seriously than someone who was overweight complaining about the same thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9q99qm": [
                        {
                            "Parent ID": "t1_f9p0dkl",
                            "Comment ID": "f9q99qm",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 08:49:17",
                            "Upvotes": 4,
                            "Text": "My post was about to stop being toxic towards thin people. And you had to go out and make a blanket statement on how skinny people dont have it bad as fatter people. Like..what are you implying? That we shouldn't be nice to them? That literally helps nothing. The point was to stop projecting and indirectly being jealous. Your first two sentences contradicted each other AGAIN. You are literally not getting the point to be more empathetic. I'm done talking about this because I repeated myself several times which isnt going through your head.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qetz9": [
                [
                    {
                        "Parent ID": "t1_f9qaba6",
                        "Comment ID": "f9qetz9",
                        "Author": "AmbiguousCat",
                        "Date Created": "12-05-2019 09:32:46",
                        "Upvotes": -1,
                        "Text": "Thats not what I said, I said the absorbtion of food which is different than the actual conversion to energy.\n\nAlso genetic disorders or organ failure can cause metabolic issues that make you lose weight, true. But, it doesn’t ‘increase’ your metabolic rate. Rather, your body simply fails to metabolize anything at all. (Or much less frequently)\n\nMy point is the speed of actual metabolism doesn’t change, the frequency can though.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9qee53": [
                [
                    {
                        "Parent ID": "t1_f9q99qm",
                        "Comment ID": "f9qee53",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:29:23",
                        "Upvotes": 1,
                        "Text": "I didn't say that at all. Did you read what I wrote? It's shitty to shame and be toxic to anyone for their body. But fat people are far more likely to face abuse or subtle societal damage for being fat than skinny people are for their bodies, and acknowledging that doesn't take away from their suffering",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9qewh5": [
                        {
                            "Parent ID": "t1_f9qee53",
                            "Comment ID": "f9qewh5",
                            "Author": "bunnywithbpd",
                            "Date Created": "12-05-2019 09:33:18",
                            "Upvotes": 4,
                            "Text": "You missed the point of the post. All I said was to be more understanding towards skinny people and all you had to say is  \"bUt FaT pEoPle HaVe It WoRsE\" you are proving my point here. Girl bye.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9qf7q1": [
                [
                    {
                        "Parent ID": "t1_f9qewh5",
                        "Comment ID": "f9qf7q1",
                        "Author": "ddmar",
                        "Date Created": "12-05-2019 09:35:45",
                        "Upvotes": 1,
                        "Text": "🤦‍♀️My comments literally said it's shitty and not ok to be toxic for anyone for their bodies. But the vast majority of people on this sub would much rather be skinny and suffering than fat and equally suffering.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ]
}