{
    "egl8f6w": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egl8f6w",
                "Author": "heartemoji",
                "Date Created": "02-16-2019 03:27:29",
                "Upvotes": 81,
                "Text": "I do and I can't let them go ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egl8p0f": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egl8p0f",
                "Author": "[deleted]",
                "Date Created": "02-16-2019 03:36:06",
                "Upvotes": 73,
                "Text": "Yep and I think there’s no way these people realize I still play back what they said to me over ten years ago but here we are. I remember being called out for the rolls on my stomach and being called big bird making me never want to wear yellow again, getting a treadmill on my thirteenth birthday.\n\nBut yeah no idea where my body issues come from",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eglf0v6": [
                {
                    "Parent ID": "t1_egl8p0f",
                    "Comment ID": "eglf0v6",
                    "Author": "wrappedinlust",
                    "Date Created": "02-16-2019 06:50:00",
                    "Upvotes": 32,
                    "Text": "Omg, i have a problem with yellow for a reason similar to this.\n\nWhen i was a kid my school organized a play and we all needed rockabilly style dresses, the colors were pick randomly. I got yellow. And a kid told me i'll look like an egg because i was so round and white and the dress was going to resemble a yolk. I was about 8, still cant let go.\n\nand i FUCKING LOVE YELLOW, to this day i cant wear a something yellow without going back to that moment.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "egljaa6": [
                [
                    {
                        "Parent ID": "t1_eglj5zu",
                        "Comment ID": "egljaa6",
                        "Author": "lesbihonestquackle",
                        "Date Created": "02-16-2019 08:20:06",
                        "Upvotes": 32,
                        "Text": "I am I'm a healthy weight now and never been happier 😊",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "eglgi86": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglgi86",
                "Author": "lesbihonestquackle",
                "Date Created": "02-16-2019 07:24:16",
                "Upvotes": 47,
                "Text": "My dad used to call me fat fuck whenever he got drunk. I had a bmi of 15. I remember every single time ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eglj5zu": [
                {
                    "Parent ID": "t1_eglgi86",
                    "Comment ID": "eglj5zu",
                    "Author": "nomeatonmybones",
                    "Date Created": "02-16-2019 08:17:53",
                    "Upvotes": 24,
                    "Text": "That’s terrible :( I hope you’re doing better now",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "egljaa6": [
                        {
                            "Parent ID": "t1_eglj5zu",
                            "Comment ID": "egljaa6",
                            "Author": "lesbihonestquackle",
                            "Date Created": "02-16-2019 08:20:06",
                            "Upvotes": 32,
                            "Text": "I am I'm a healthy weight now and never been happier 😊",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "egle9lk": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egle9lk",
                "Author": "elite-alien",
                "Date Created": "02-16-2019 06:30:01",
                "Upvotes": 37,
                "Text": "\"you know buying skinny jeans won't make you skinny\" ouch. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglc7wy": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglc7wy",
                "Author": "sioclip",
                "Date Created": "02-16-2019 05:30:15",
                "Upvotes": 24,
                "Text": "I still do and I don't know why.\n\nAnd I hate it because I'd remind myself about the times I've been called fat as a young child just to trigger myself. heck I even managed to trick myself that I still look the same way ):\n\nPeople are just so cruel honestly, why would you ever say those stuff to a young child?!\nThe same people are now praising me for being \"so slim\" now. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglclii": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglclii",
                "Author": "toolate4agoodname",
                "Date Created": "02-16-2019 05:42:09",
                "Upvotes": 17,
                "Text": "I do. I also remember my dad getting mad at when i was 16 and telling my mom “this fat cow doesn’t want to do anything” guess when my relationship with my dad worsened. 🙃",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglkcq9": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglkcq9",
                "Author": "lawsoflife",
                "Date Created": "02-16-2019 08:39:17",
                "Upvotes": 17,
                "Text": "I remember my dad sitting me down when I was like 9 and being like “do you really want to be the fattest kid in your grade for the rest of your life?” like what in the hellllll",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglr0kf": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglr0kf",
                "Author": "blueopalsong",
                "Date Created": "02-16-2019 10:23:42",
                "Upvotes": 16,
                "Text": "too many to count, to list, to recall verbatim. but they are burned into my brain anyway.\n\n\n- “maybe slow down on the chocolate coins *wink*” from my uncle over winter holidays, pointedly staring at my ass\n- “you’re so squishy!” - exbf\n- “she’s like you, but skinnier” about my then best friend of several years\n- when i said “i’ve only had a single twizzler and half a pretzel stick today” at 7pm and my friend said “good!”\n- “we should diet together” - my ex who triggered a lot of my ED\n- getting diet soda at a restaurant and a friend giving me the Look(TM)\n- “you’re blossoming into a young woman now” - my mom when i was trying on jeans, kept pointing out that i was curvier\n- staring. so much open staring. just.....no words needed. it was obvious\n- “woah, you eat that much?” from a classmate when i was ~bmi 15. a normal-sized lunch\n- “so like, you’re normal now?” - my brother when i was discharged from IP, at a healthy weight\n- my mom saying ‘she looks more anorexic than you did’ while i was in recovery...about my grandmother\n- parents commenting on my thighs and staring when i was wearing just a nightshirt, “she needs to exercise more,” they thought i couldn’t hear.\n- anyone telling me i looked ‘healthier’\n- former friend calling me fat over and over again, as a ‘joke’ despite knowing my discomfort - ftr my highest bmi ever was maybe 21\n- my parents consistently telling me i should be exercising, while recovering. of course i was, but in secret, because i was relapsing\n- “how much do you weigh?....damn you don’t look that small”\n- ”you look good, keep it up” from my dad, when i was losing weight rapidly from constant purging\n- a friend laughing at me when he saw myfitnesspal on my computer\n- a different friend calling me “short and stout”\n- my mother yelling at me for buying a poptart, healthfreak that she is, and telling me i was disgusting\n- people joking about how i grew ‘outward’ rather than ‘upward’ - i’m short. i was always short, but also thin as a kid. and then i...wasn’t\n- not specific words necessarily, but my father always...feeling me, my body, my bones. commenting on that.\n\nand so, so many more. sorry this is long i just needed to get it out ://",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglkcdl": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglkcdl",
                "Author": "frostfromfire",
                "Date Created": "02-16-2019 08:39:07",
                "Upvotes": 12,
                "Text": "I didn’t start putting on weight until about 5 or 6 years ago, as an adult, and the comments my family made to me are in my head everyday.  My dad was senile on his death bed and saw me walk in the hospital room and said something to the effect of “you put on a lot of weight, don’t start looking like your mother.”  Then when my dad died my uncle visited to give my mom emotional support so a couple days after the funeral he saw me and exclaimed how much weight I had put on and how I wasn’t tiny anymore.  He was buzzed or drunk saying it.  Those comments hit me the hardest because it was a really bad time in my life anyway.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglhk1s": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglhk1s",
                "Author": "world-of-emptiness",
                "Date Created": "02-16-2019 07:46:16",
                "Upvotes": 11,
                "Text": "I do, I remember every single time.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglpxmx": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglpxmx",
                "Author": "Obscene_Goku",
                "Date Created": "02-16-2019 10:07:57",
                "Upvotes": 9,
                "Text": "Yep. 28 years old and I can still remember all the way back to the first time someone called me fat. Way back in 3rd grade by a random girl who I never even spoke to. And I remember pretty much every time since then. \n\nBeing fat as a guy, it’s not just someone outright calling me “fat” that I remember though. I’m sure women also experience some form of this with different language, but for a big guy like me, fat isn’t the most common one. Instead it’s Boss, Big guy, etc. Someone even told me I was built like a bear once, and it definitely wasn’t meant in any form of compliment. \n\nI haven’t had any success in forgetting or letting go of all the memories. These days, I actually think of them on purpose to fuel me while I’m working out. Especially on days where I really don’t feel like exercising, I go into my mental cookie jar and pull out a few key moments that never fail to fire me up.\n\nBut I do wonder if I will spend the rest of my life always remembering every occasion. And I’m not sure what to think of that ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglq44a": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglq44a",
                "Author": "catpotatotots",
                "Date Created": "02-16-2019 10:10:33",
                "Upvotes": 8,
                "Text": "Yes so much. I’ll never forget the first time someone said something about my weight.\n\nWhen I was 9 my uncle was visiting from our native country for Easter, and when we broke our fast the night of I went to grab a piece of bread and my uncle said to my dad “why do you guys let her eat so much? Look at her. There’s no way she’s gonna find herself a nice boy if she keeps on eating and growing like that.” He then proceeded to blame the fact that my mom is an American as to why I’m so fat and ugly thus ruining our family’s “pure” genes and I’ll be fat my whole life simply because I’m half American 🙃",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglj3j8": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglj3j8",
                "Author": "fieryanxiety",
                "Date Created": "02-16-2019 08:16:39",
                "Upvotes": 12,
                "Text": "Not directly. I was a scrawny child but when I was about 10-13 I had a little chub. When I hit puberty I grew into it and was back to being thinner. But it was Christmas when I was about 11 and I was laying down by the tree on my side. My shirt came up a bit and my mom pointed at my stomach and said \"You really need to do some sit ups or something.\" I never had any awareness about my body until that moment. I felt so humiliated. I'll never forget it. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglno7z": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglno7z",
                "Author": "Soggy_Ramen",
                "Date Created": "02-16-2019 09:34:09",
                "Upvotes": 6,
                "Text": "Your story makes me furious on your behalf, I'm so sorry. \n\nEveryone talked about how skinny I was until we got to like 6th or 7th grade and then suddenly we all gained a bit of weight over the summer but for some reason my weight gain was the big deal to everyone. Maybe I was just THAT skinny before? But every single day someone had to comment on it, for years. \n\nAnd now here we are.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglv4dv": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglv4dv",
                "Author": "daffodilhill",
                "Date Created": "02-16-2019 11:20:33",
                "Upvotes": 5,
                "Text": "I didn't have a boyfriend in high school or college and my dad said, \"You could probably get a boyfriend if you lost weight.\" I was just below an overweight BMI then and cried for days.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egmokq3": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egmokq3",
                "Author": "irlnyc2018",
                "Date Created": "02-16-2019 18:06:38",
                "Upvotes": 4,
                "Text": "Yup, in kindergarten kids told me I looked like I had a baby in my tummy.\n\nMy brother constantly bullied me for my weight, as a kid he would always call me fatty in front of his friends to try and humiliate me. He’s 4 years older. As we got older he would call me a fat bitch whenever we were arguing. When I was 10 he found my diet log and diary where I described how much I hated my body and how fat I was and he blackmailed me with it threatening to tell our mom. \n\nLast year he told me there was no point using dating apps unless I started hitting the gym and I got really upset and ran upstairs. He said to my mom ‘well someone has to say it to her’\n\nAs a kid my mom was really strict on me food wise and especially with sweets. She told me every time I ate chocolate it would add another lump to my tummy. Once she looked me up and down when I was ten and turned to my aunt and said ‘I’m putting her on a diet’. She used to constantly make remarks about my weight and my ‘belly’ and would make me feel bad when we went clothes shopping about how it was so hard to find clothes that fit me cos of my belly and cos I was too big. As an adult she would have no difficulty telling me ‘god you have an awful belly in that outfit’ or ‘your ass looks huge in that’. \n\nI remember aged 11 a neighbour asked if I had been dieting and that I had lost weight. Also at 11 a friend’s mom told me that I had lost weight and to keep up the good work. At 16 when I was bulimic, my best friend’s dad creepily looked me up and down and told me ‘you are looking very well’.\n\nAt 14 I had a friend admit he told other friends I would look so much better if I lost weight and he said ‘sorry but it’s true’. He used to make comments if he thought I was eating too much. I remember once saying ‘oh I’m so obsessed with kinder eggs lately’ and he said ‘don’t you think you could choose to be obsessed with something a bit healthier?’ In front of all our friends. Same friend who three years told me he was there for me and I didn’t need to lose any weight at all when he found out I was bulimic. \n\nI got in a fight with a friend of a friend once, at around 13/14. He had his friend go and post ‘fat’ and ‘you’re fat’ on my bebo wall about fifty times over. \n\nA few years ago I overheard my parents discussing how much weight I had put on, that I must be eating chocolate and that I would never get a boyfriend at my size. \n\nThe list goes on and on. \n",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglwh3z": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglwh3z",
                "Author": "AfternoonHellcat",
                "Date Created": "02-16-2019 11:38:52",
                "Upvotes": 3,
                "Text": "The examples you mentioned about your family resonated with me so much. Family comments about my body/size are one of my biggest triggers :( tbh I wish everybody just kept comments about bodies to themselves even if they have a ‘positive’ connotation like “you look thin.” One of the things that helped me cope with these things is when my therapist told me that people who often comment on other’s bodies often have internal issues dealing with that sort of stuff. It’s just a reflection of them, my body is NOT👏THEIR👏PROBLEM👏",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egm3anh": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egm3anh",
                "Author": "_Stormi",
                "Date Created": "02-16-2019 13:10:21",
                "Upvotes": 3,
                "Text": "I feel like the “you don’t look like you weigh that much” is both good and bad. True, it can be interpreted as them saying that you weigh a lot, but most likely, it’s them saying that you look skinny and you carry your weight well",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egm4528": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egm4528",
                "Author": "marshallcat",
                "Date Created": "02-16-2019 13:21:47",
                "Upvotes": 3,
                "Text": "Not every single one because they would be too many. I do remember the worst ones, like a classmate calling me \"grease barrel with tits\" when we were nine (yikes), and the ones that happened so often they were pretty much routine.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egmnwyu": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egmnwyu",
                "Author": "trickasfuck",
                "Date Created": "02-16-2019 17:56:48",
                "Upvotes": 3,
                "Text": "they replay every time i eat",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglsmpd": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglsmpd",
                "Author": "Vedofox",
                "Date Created": "02-16-2019 10:46:16",
                "Upvotes": 2,
                "Text": "one time that vividly sticks out is seeing my aunt at a wedding, she insisted I move my flowers so she could see my body and looked up me and down and said \"you look... healthy..\" in the most contemptuous voice. Ugh :( it's been years and I can't let it go.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eglw5u4": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "eglw5u4",
                "Author": "relapseandrecovery",
                "Date Created": "02-16-2019 11:34:40",
                "Upvotes": 2,
                "Text": "Never been called fat as I've always been bmi 20 or less since childhood. BUT the one comment I ever got that has always stuck with me is a boy in high school saying I looked normal an athletic when my friend was like isn't she so skinny? I was crushed like excuse you \"normal\"??? ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egmj1um": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egmj1um",
                "Author": "bunnyalert",
                "Date Created": "02-16-2019 16:45:58",
                "Upvotes": 2,
                "Text": "Yes. I also remember every particularly bad instance of feeling fat, even when no one said anything. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egmk5ap": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egmk5ap",
                "Author": "ri-ri",
                "Date Created": "02-16-2019 17:01:30",
                "Upvotes": 2,
                "Text": "Absolutely. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egmrane": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egmrane",
                "Author": "CatsAreKids",
                "Date Created": "02-16-2019 18:47:54",
                "Upvotes": 2,
                "Text": "Yes.\nI remember all of the comments, criticisms, and “jokes” about my body.\nEven if it’s from a decade ago, I can remember it perfectly. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egmspyo": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egmspyo",
                "Author": "nofreepizza",
                "Date Created": "02-16-2019 19:09:12",
                "Upvotes": 2,
                "Text": "Oh god don't even get me started. After puberty I put on a ton of weight and became overweight (It's slowly coming off now thank god) but I remember how my fitness fanatic mom would *constantly* try to pressure me into going to the gym with her or go on a run or a bike ride with her and if we went to a restaurant and I ordered something that was high in calories she'd ask \"Do you *really* wanna eat that?\" Every. Single. Day. I was 18 when I finally called her out on her bullshit and told her how fucked up that made me and how many issues it gave me and her response was \"I jUsT WaNTeD tO spEnD tIMe wItH yOu\" no the fuck you didn't you just hated having a fat daughter. Fuck off with that bullshit.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egmt3c1": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egmt3c1",
                "Author": "hotmessaesthetic",
                "Date Created": "02-16-2019 19:14:40",
                "Upvotes": 2,
                "Text": "My grandma said I looked fat at Christmas when I was 13. I’m 27 and I still remember it every time I walk into her house. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egm2ucr": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egm2ucr",
                "Author": "thestoriesofaly",
                "Date Created": "02-16-2019 13:04:18",
                "Upvotes": 1,
                "Text": "when I was in 1st grade a boy called me fat and ugly. I was 52 inches, 65 lbs, and he was probably just teasing me but I still remember it like it was yesterday.  \n\n\nBut I remember this one time a few months ago where I asked my grandmother to guess how much I weighed and she said 80 lbs. At the time I was like 35 lbs over that lol and that made me happy :)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egn46x5": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "egn46x5",
                "Author": "ThatChicBitch",
                "Date Created": "02-16-2019 22:00:01",
                "Upvotes": 1,
                "Text": "I remember the time my brother called me a fatty when I was 7. In his defense, I was a pretty mean, emotionally unstable child with anger issues as a kid so I'm pretty sure I said something extremely hurtful enough to him for his insult to have been warranted. \n\nStill hurt, though lol. I can remember almost anytime that anyone has ever called me the F word. Fat. Man, there's really something about that word for me. I've been called a bitch, you can call me a cunt, a whore, whatever the hell you want within reasonable range but call me fat? Yeah, that's a little too low of a low blow for me. That one word can literally make me bawl my eyes out in a second and that means something coming from me because I am a stone cold bitch most of the time and most know it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehn3x62": [
        [
            {
                "Parent ID": "t3_ar72a6",
                "Comment ID": "ehn3x62",
                "Author": "[deleted]",
                "Date Created": "03-02-2019 12:00:00",
                "Upvotes": 1,
                "Text": "Oh gosh. When I was 16, I went to make an instant noodle soup cup. My dad was in the kitchen, as was my mom. My mom said something along the lines of “do you need this?” to which my dad replied “she’s still growing.”\n\n“Not up” was her response. Oof.\n\nTo be fair, I was gaining a lot of weight.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}