{
    "ev836y3": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev836y3",
                "Author": "sleepybear7",
                "Date Created": "07-27-2019 17:59:18",
                "Upvotes": 153,
                "Text": "PREACH.\n\nAnother one I see: “This person can’t have BED because they plan their binges.” \n\nFirst of all, If you’re going to play armchair psychologist, at least read the DSM - it literally says that binges can be planned (if you’ve stopped trying to control your eating, it counts toward the lack of control criteria). \n\nSecond of all, fuck you for being the ED police so that you can justify your fat shaming.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ev86fq7": [
                {
                    "Parent ID": "t1_ev836y3",
                    "Comment ID": "ev86fq7",
                    "Author": "PM_me_cyborgs",
                    "Date Created": "07-27-2019 18:36:01",
                    "Upvotes": 110,
                    "Text": "Anyone who says people with BED don't plan their binges has no idea what they are talking about.\n\nThat's like saying an alcoholic can't go and consciously purchase alcohol.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ev86mw1": [
                [
                    {
                        "Parent ID": "t1_ev8650f",
                        "Comment ID": "ev86mw1",
                        "Author": "sleepybear7",
                        "Date Created": "07-27-2019 18:38:40",
                        "Upvotes": 14,
                        "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev86yti": [
                        {
                            "Parent ID": "t1_ev86mw1",
                            "Comment ID": "ev86yti",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 18:43:06",
                            "Upvotes": 24,
                            "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8cx28": [
                [
                    {
                        "Parent ID": "t1_ev893s4",
                        "Comment ID": "ev8cx28",
                        "Author": "AngeloLacrime",
                        "Date Created": "07-27-2019 20:04:11",
                        "Upvotes": 39,
                        "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8m9v8": [
                [
                    {
                        "Parent ID": "t1_ev8ccrj",
                        "Comment ID": "ev8m9v8",
                        "Author": "symptomatic_basic",
                        "Date Created": "07-27-2019 22:18:42",
                        "Upvotes": 8,
                        "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8qtic": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev8qtic",
                            "Author": "NoaahFoster",
                            "Date Created": "07-27-2019 23:30:02",
                            "Upvotes": 3,
                            "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev93tif": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev93tif",
                            "Author": "TotallyNotARadar",
                            "Date Created": "07-28-2019 04:02:53",
                            "Upvotes": 3,
                            "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev96crc": [
                [
                    {
                        "Parent ID": "t1_ev9434r",
                        "Comment ID": "ev96crc",
                        "Author": "oddsick",
                        "Date Created": "07-28-2019 05:08:38",
                        "Upvotes": 1,
                        "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev88e44": [
                [
                    {
                        "Parent ID": "t1_ev86yti",
                        "Comment ID": "ev88e44",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 19:02:19",
                        "Upvotes": 13,
                        "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8a0ev": [
                        {
                            "Parent ID": "t1_ev88e44",
                            "Comment ID": "ev8a0ev",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 19:24:12",
                            "Upvotes": 14,
                            "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev94eq4": [
                [
                    {
                        "Parent ID": "t1_ev8qtic",
                        "Comment ID": "ev94eq4",
                        "Author": "Lilith-Rising",
                        "Date Created": "07-28-2019 04:18:21",
                        "Upvotes": 2,
                        "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "evar1sf": [
                        {
                            "Parent ID": "t1_ev94eq4",
                            "Comment ID": "evar1sf",
                            "Author": "NoaahFoster",
                            "Date Created": "07-28-2019 18:01:27",
                            "Upvotes": 1,
                            "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9rebd": [
                [
                    {
                        "Parent ID": "t1_ev93tif",
                        "Comment ID": "ev9rebd",
                        "Author": "LowCalPal",
                        "Date Created": "07-28-2019 10:55:39",
                        "Upvotes": 1,
                        "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8yt0c": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8yt0c",
                        "Author": "bizzarepeanut",
                        "Date Created": "07-28-2019 02:02:32",
                        "Upvotes": 9,
                        "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                        "Edited?": "07-28-2019 02:07:52",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9yofj": [
                        {
                            "Parent ID": "t1_ev8yt0c",
                            "Comment ID": "ev9yofj",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-28-2019 12:22:03",
                            "Upvotes": 2,
                            "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8duel": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8duel",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 20:17:20",
                        "Upvotes": 6,
                        "Text": "ohhhh, i misread it! thank you!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8fuef": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8fuef",
                        "Author": "chillinthetrees",
                        "Date Created": "07-27-2019 20:45:24",
                        "Upvotes": 10,
                        "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8s184": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8s184",
                        "Author": "lintuski",
                        "Date Created": "07-27-2019 23:50:17",
                        "Upvotes": 3,
                        "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "evaeois": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "evaeois",
                        "Author": "hungryhippo53",
                        "Date Created": "07-28-2019 15:30:51",
                        "Upvotes": 2,
                        "Text": "Ugh I had a hell of a time on mirtazapine",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "ev8650f": [
                {
                    "Parent ID": "t1_ev836y3",
                    "Comment ID": "ev8650f",
                    "Author": "Cheap_Bat",
                    "Date Created": "07-27-2019 18:32:04",
                    "Upvotes": 45,
                    "Text": "I had a psychiatrist take me off BED medication because for a small percentage of the time I've been struggling with binge eating I was also on a medication that causes binge eating. I had been binge eating off and on for 10 years and been on the medication for maybe 2.5 years. So hey it's definitely ALL due to that medication, you definitely don't have BED, and here let me just take away the only meds that have ever shown immediate therapeutic benefit to you. Also apparently nobody with BED has a BMI below 40",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ev86mw1": [
                        {
                            "Parent ID": "t1_ev8650f",
                            "Comment ID": "ev86mw1",
                            "Author": "sleepybear7",
                            "Date Created": "07-27-2019 18:38:40",
                            "Upvotes": 14,
                            "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8cx28": [
                [
                    {
                        "Parent ID": "t1_ev893s4",
                        "Comment ID": "ev8cx28",
                        "Author": "AngeloLacrime",
                        "Date Created": "07-27-2019 20:04:11",
                        "Upvotes": 39,
                        "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8m9v8": [
                [
                    {
                        "Parent ID": "t1_ev8ccrj",
                        "Comment ID": "ev8m9v8",
                        "Author": "symptomatic_basic",
                        "Date Created": "07-27-2019 22:18:42",
                        "Upvotes": 8,
                        "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8qtic": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev8qtic",
                            "Author": "NoaahFoster",
                            "Date Created": "07-27-2019 23:30:02",
                            "Upvotes": 3,
                            "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev93tif": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev93tif",
                            "Author": "TotallyNotARadar",
                            "Date Created": "07-28-2019 04:02:53",
                            "Upvotes": 3,
                            "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev96crc": [
                [
                    {
                        "Parent ID": "t1_ev9434r",
                        "Comment ID": "ev96crc",
                        "Author": "oddsick",
                        "Date Created": "07-28-2019 05:08:38",
                        "Upvotes": 1,
                        "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev86yti": [
                [
                    {
                        "Parent ID": "t1_ev86mw1",
                        "Comment ID": "ev86yti",
                        "Author": "Cheap_Bat",
                        "Date Created": "07-27-2019 18:43:06",
                        "Upvotes": 24,
                        "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev88e44": [
                        {
                            "Parent ID": "t1_ev86yti",
                            "Comment ID": "ev88e44",
                            "Author": "szerim",
                            "Date Created": "07-27-2019 19:02:19",
                            "Upvotes": 13,
                            "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev94eq4": [
                [
                    {
                        "Parent ID": "t1_ev8qtic",
                        "Comment ID": "ev94eq4",
                        "Author": "Lilith-Rising",
                        "Date Created": "07-28-2019 04:18:21",
                        "Upvotes": 2,
                        "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "evar1sf": [
                        {
                            "Parent ID": "t1_ev94eq4",
                            "Comment ID": "evar1sf",
                            "Author": "NoaahFoster",
                            "Date Created": "07-28-2019 18:01:27",
                            "Upvotes": 1,
                            "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9rebd": [
                [
                    {
                        "Parent ID": "t1_ev93tif",
                        "Comment ID": "ev9rebd",
                        "Author": "LowCalPal",
                        "Date Created": "07-28-2019 10:55:39",
                        "Upvotes": 1,
                        "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8a0ev": [
                [
                    {
                        "Parent ID": "t1_ev88e44",
                        "Comment ID": "ev8a0ev",
                        "Author": "Cheap_Bat",
                        "Date Created": "07-27-2019 19:24:12",
                        "Upvotes": 14,
                        "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8yt0c": [
                        {
                            "Parent ID": "t1_ev8a0ev",
                            "Comment ID": "ev8yt0c",
                            "Author": "bizzarepeanut",
                            "Date Created": "07-28-2019 02:02:32",
                            "Upvotes": 9,
                            "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                            "Edited?": "07-28-2019 02:07:52",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev8duel": [
                        {
                            "Parent ID": "t1_ev8a0ev",
                            "Comment ID": "ev8duel",
                            "Author": "szerim",
                            "Date Created": "07-27-2019 20:17:20",
                            "Upvotes": 6,
                            "Text": "ohhhh, i misread it! thank you!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev8fuef": [
                        {
                            "Parent ID": "t1_ev8a0ev",
                            "Comment ID": "ev8fuef",
                            "Author": "chillinthetrees",
                            "Date Created": "07-27-2019 20:45:24",
                            "Upvotes": 10,
                            "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev8s184": [
                        {
                            "Parent ID": "t1_ev8a0ev",
                            "Comment ID": "ev8s184",
                            "Author": "lintuski",
                            "Date Created": "07-27-2019 23:50:17",
                            "Upvotes": 3,
                            "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "evaeois": [
                        {
                            "Parent ID": "t1_ev8a0ev",
                            "Comment ID": "evaeois",
                            "Author": "hungryhippo53",
                            "Date Created": "07-28-2019 15:30:51",
                            "Upvotes": 2,
                            "Text": "Ugh I had a hell of a time on mirtazapine",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9yofj": [
                [
                    {
                        "Parent ID": "t1_ev8yt0c",
                        "Comment ID": "ev9yofj",
                        "Author": "Cheap_Bat",
                        "Date Created": "07-28-2019 12:22:03",
                        "Upvotes": 2,
                        "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ev7fwsg": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev7fwsg",
                "Author": "[deleted]",
                "Date Created": "07-27-2019 15:27:04",
                "Upvotes": 145,
                "Text": "[deleted]",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ev8rni1": [
                {
                    "Parent ID": "t1_ev7fwsg",
                    "Comment ID": "ev8rni1",
                    "Author": "ChristieFox",
                    "Date Created": "07-27-2019 23:43:51",
                    "Upvotes": 20,
                    "Text": "Yeah, ED diagnosis are a mess in my opinion. It's good you kept the same when your struggles were the same.\n\nI never thought I fell into one of the specific categories, but I always knew my self hatred which made me think way too much about eating and made me restrict and binge wasn't... well... healthy. You're not magically healthy just because you never saw a doctor while having a history of hating yourself, hating yourself for eating, hating yourself for not being perfect enough, etc. And yes, the hatred isn't away just because now I'm overweight -.-",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ev86mw1": [
                [
                    {
                        "Parent ID": "t1_ev8650f",
                        "Comment ID": "ev86mw1",
                        "Author": "sleepybear7",
                        "Date Created": "07-27-2019 18:38:40",
                        "Upvotes": 14,
                        "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev86yti": [
                        {
                            "Parent ID": "t1_ev86mw1",
                            "Comment ID": "ev86yti",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 18:43:06",
                            "Upvotes": 24,
                            "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8cx28": [
                [
                    {
                        "Parent ID": "t1_ev893s4",
                        "Comment ID": "ev8cx28",
                        "Author": "AngeloLacrime",
                        "Date Created": "07-27-2019 20:04:11",
                        "Upvotes": 39,
                        "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8m9v8": [
                [
                    {
                        "Parent ID": "t1_ev8ccrj",
                        "Comment ID": "ev8m9v8",
                        "Author": "symptomatic_basic",
                        "Date Created": "07-27-2019 22:18:42",
                        "Upvotes": 8,
                        "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8qtic": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev8qtic",
                            "Author": "NoaahFoster",
                            "Date Created": "07-27-2019 23:30:02",
                            "Upvotes": 3,
                            "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev93tif": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev93tif",
                            "Author": "TotallyNotARadar",
                            "Date Created": "07-28-2019 04:02:53",
                            "Upvotes": 3,
                            "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev96crc": [
                [
                    {
                        "Parent ID": "t1_ev9434r",
                        "Comment ID": "ev96crc",
                        "Author": "oddsick",
                        "Date Created": "07-28-2019 05:08:38",
                        "Upvotes": 1,
                        "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev88e44": [
                [
                    {
                        "Parent ID": "t1_ev86yti",
                        "Comment ID": "ev88e44",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 19:02:19",
                        "Upvotes": 13,
                        "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8a0ev": [
                        {
                            "Parent ID": "t1_ev88e44",
                            "Comment ID": "ev8a0ev",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 19:24:12",
                            "Upvotes": 14,
                            "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev94eq4": [
                [
                    {
                        "Parent ID": "t1_ev8qtic",
                        "Comment ID": "ev94eq4",
                        "Author": "Lilith-Rising",
                        "Date Created": "07-28-2019 04:18:21",
                        "Upvotes": 2,
                        "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "evar1sf": [
                        {
                            "Parent ID": "t1_ev94eq4",
                            "Comment ID": "evar1sf",
                            "Author": "NoaahFoster",
                            "Date Created": "07-28-2019 18:01:27",
                            "Upvotes": 1,
                            "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9rebd": [
                [
                    {
                        "Parent ID": "t1_ev93tif",
                        "Comment ID": "ev9rebd",
                        "Author": "LowCalPal",
                        "Date Created": "07-28-2019 10:55:39",
                        "Upvotes": 1,
                        "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8yt0c": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8yt0c",
                        "Author": "bizzarepeanut",
                        "Date Created": "07-28-2019 02:02:32",
                        "Upvotes": 9,
                        "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                        "Edited?": "07-28-2019 02:07:52",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9yofj": [
                        {
                            "Parent ID": "t1_ev8yt0c",
                            "Comment ID": "ev9yofj",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-28-2019 12:22:03",
                            "Upvotes": 2,
                            "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8duel": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8duel",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 20:17:20",
                        "Upvotes": 6,
                        "Text": "ohhhh, i misread it! thank you!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8fuef": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8fuef",
                        "Author": "chillinthetrees",
                        "Date Created": "07-27-2019 20:45:24",
                        "Upvotes": 10,
                        "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8s184": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8s184",
                        "Author": "lintuski",
                        "Date Created": "07-27-2019 23:50:17",
                        "Upvotes": 3,
                        "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "evaeois": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "evaeois",
                        "Author": "hungryhippo53",
                        "Date Created": "07-28-2019 15:30:51",
                        "Upvotes": 2,
                        "Text": "Ugh I had a hell of a time on mirtazapine",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "ev8u1ai": [
                {
                    "Parent ID": "t1_ev7fwsg",
                    "Comment ID": "ev8u1ai",
                    "Author": "bizzarepeanut",
                    "Date Created": "07-28-2019 00:25:31",
                    "Upvotes": 6,
                    "Text": "I had a similar experience. Most of my life, even before my ED I had been just above the cusp of underweight so when my ED got really bad I was very underweight. Even still, I was no where near how bad I was mentally when I got to a healthy weight. \n\nI gained probably 30 lbs in a short period of time after I got clean from heroin and even though I was still well within my “healthy weight range” and nowhere near over weight my ED thoughts were so bad that I thought I was basically a monster to those around me. And as I lost the weight, those thoughts got quieter again, though obviously they never were muted. \n\nWhen you’ve had an ED ruled by weight loss for so long and then you gain weight I think there is something to be said about how even more skewed than “normal” your perception can become. I think it can sometimes be even more detrimental to your mental health than your ED originally was because you have lost all semblance of self when you identify with your ED and lose that “identity.” \n\nI’m in recovery now and it’s been several years so my ED thoughts are much much quieter now. I still have a ways to go and sometimes old habits die hard, especially in times of stress, but it’s no longer a conscious decision and I try to correct the behavior. Which is why I no longer even own a scale, because the numbers consume me. But something I think about sometimes is if I would still be doing as well now if I wasn’t still quite thin. And sadly, I think the answer would most likely be no, I wouldn’t. Like I said, I still have a ways to go before I think I can get there, if I ever can.",
                    "Edited?": "07-28-2019 00:29:21",
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ev86mw1": [
                [
                    {
                        "Parent ID": "t1_ev8650f",
                        "Comment ID": "ev86mw1",
                        "Author": "sleepybear7",
                        "Date Created": "07-27-2019 18:38:40",
                        "Upvotes": 14,
                        "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev86yti": [
                        {
                            "Parent ID": "t1_ev86mw1",
                            "Comment ID": "ev86yti",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 18:43:06",
                            "Upvotes": 24,
                            "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8cx28": [
                [
                    {
                        "Parent ID": "t1_ev893s4",
                        "Comment ID": "ev8cx28",
                        "Author": "AngeloLacrime",
                        "Date Created": "07-27-2019 20:04:11",
                        "Upvotes": 39,
                        "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8m9v8": [
                [
                    {
                        "Parent ID": "t1_ev8ccrj",
                        "Comment ID": "ev8m9v8",
                        "Author": "symptomatic_basic",
                        "Date Created": "07-27-2019 22:18:42",
                        "Upvotes": 8,
                        "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8qtic": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev8qtic",
                            "Author": "NoaahFoster",
                            "Date Created": "07-27-2019 23:30:02",
                            "Upvotes": 3,
                            "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev93tif": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev93tif",
                            "Author": "TotallyNotARadar",
                            "Date Created": "07-28-2019 04:02:53",
                            "Upvotes": 3,
                            "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev96crc": [
                [
                    {
                        "Parent ID": "t1_ev9434r",
                        "Comment ID": "ev96crc",
                        "Author": "oddsick",
                        "Date Created": "07-28-2019 05:08:38",
                        "Upvotes": 1,
                        "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev88e44": [
                [
                    {
                        "Parent ID": "t1_ev86yti",
                        "Comment ID": "ev88e44",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 19:02:19",
                        "Upvotes": 13,
                        "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8a0ev": [
                        {
                            "Parent ID": "t1_ev88e44",
                            "Comment ID": "ev8a0ev",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 19:24:12",
                            "Upvotes": 14,
                            "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev94eq4": [
                [
                    {
                        "Parent ID": "t1_ev8qtic",
                        "Comment ID": "ev94eq4",
                        "Author": "Lilith-Rising",
                        "Date Created": "07-28-2019 04:18:21",
                        "Upvotes": 2,
                        "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "evar1sf": [
                        {
                            "Parent ID": "t1_ev94eq4",
                            "Comment ID": "evar1sf",
                            "Author": "NoaahFoster",
                            "Date Created": "07-28-2019 18:01:27",
                            "Upvotes": 1,
                            "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9rebd": [
                [
                    {
                        "Parent ID": "t1_ev93tif",
                        "Comment ID": "ev9rebd",
                        "Author": "LowCalPal",
                        "Date Created": "07-28-2019 10:55:39",
                        "Upvotes": 1,
                        "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8yt0c": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8yt0c",
                        "Author": "bizzarepeanut",
                        "Date Created": "07-28-2019 02:02:32",
                        "Upvotes": 9,
                        "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                        "Edited?": "07-28-2019 02:07:52",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9yofj": [
                        {
                            "Parent ID": "t1_ev8yt0c",
                            "Comment ID": "ev9yofj",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-28-2019 12:22:03",
                            "Upvotes": 2,
                            "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8duel": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8duel",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 20:17:20",
                        "Upvotes": 6,
                        "Text": "ohhhh, i misread it! thank you!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8fuef": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8fuef",
                        "Author": "chillinthetrees",
                        "Date Created": "07-27-2019 20:45:24",
                        "Upvotes": 10,
                        "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8s184": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8s184",
                        "Author": "lintuski",
                        "Date Created": "07-27-2019 23:50:17",
                        "Upvotes": 3,
                        "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "evaeois": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "evaeois",
                        "Author": "hungryhippo53",
                        "Date Created": "07-28-2019 15:30:51",
                        "Upvotes": 2,
                        "Text": "Ugh I had a hell of a time on mirtazapine",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ev8alzw": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev8alzw",
                "Author": "paperklipp",
                "Date Created": "07-27-2019 19:32:29",
                "Upvotes": 48,
                "Text": "These idiots think if you don’t look like Eugenia at her worst, you ain’t shit. Extreme thinness is too normalised - you see a lot of girls posting here about their boyfriends not believing that hot girls can be underweight. Other side of the same coin.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ev7qfkr": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev7qfkr",
                "Author": "ddmar",
                "Date Created": "07-27-2019 16:29:54",
                "Upvotes": 136,
                "Text": "oh my fucking god, fatlogic is so notorious for this. The one anorexic person will always be like \"How dare this fat person appropriate my actual eating disorder??!?!???!!11!?\" and everyone else will flock to them asking if they're ok, telling them to get better and make fun of an overweight person who is also struggling with an eating disorder, as if that's not exactly the kind of stigma non underweight people are afraid of when trying to get help with an ED",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ev893s4": [
                {
                    "Parent ID": "t1_ev7qfkr",
                    "Comment ID": "ev893s4",
                    "Author": "happybumblebree",
                    "Date Created": "07-27-2019 19:11:54",
                    "Upvotes": 48,
                    "Text": "wtf for real. when i was hospitalized for depression my roommate was in for anorexia. she was obese, easily, and admittedly my first reaction (that i kept to myself, those damned ED thoughts) was, \"you're so not anorexic.\"\n\nbut like i was so impressed by her husband for taking her problem seriously and checking her in when he did. i didn't know her full story. even obese people get the harmful effects of not eating, skinny people aren't automatically the only sufferers.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ev8cx28": [
                        {
                            "Parent ID": "t1_ev893s4",
                            "Comment ID": "ev8cx28",
                            "Author": "AngeloLacrime",
                            "Date Created": "07-27-2019 20:04:11",
                            "Upvotes": 39,
                            "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev86mw1": [
                [
                    {
                        "Parent ID": "t1_ev8650f",
                        "Comment ID": "ev86mw1",
                        "Author": "sleepybear7",
                        "Date Created": "07-27-2019 18:38:40",
                        "Upvotes": 14,
                        "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev86yti": [
                        {
                            "Parent ID": "t1_ev86mw1",
                            "Comment ID": "ev86yti",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 18:43:06",
                            "Upvotes": 24,
                            "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8m9v8": [
                [
                    {
                        "Parent ID": "t1_ev8ccrj",
                        "Comment ID": "ev8m9v8",
                        "Author": "symptomatic_basic",
                        "Date Created": "07-27-2019 22:18:42",
                        "Upvotes": 8,
                        "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8qtic": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev8qtic",
                            "Author": "NoaahFoster",
                            "Date Created": "07-27-2019 23:30:02",
                            "Upvotes": 3,
                            "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev93tif": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev93tif",
                            "Author": "TotallyNotARadar",
                            "Date Created": "07-28-2019 04:02:53",
                            "Upvotes": 3,
                            "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev96crc": [
                [
                    {
                        "Parent ID": "t1_ev9434r",
                        "Comment ID": "ev96crc",
                        "Author": "oddsick",
                        "Date Created": "07-28-2019 05:08:38",
                        "Upvotes": 1,
                        "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev88e44": [
                [
                    {
                        "Parent ID": "t1_ev86yti",
                        "Comment ID": "ev88e44",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 19:02:19",
                        "Upvotes": 13,
                        "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8a0ev": [
                        {
                            "Parent ID": "t1_ev88e44",
                            "Comment ID": "ev8a0ev",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 19:24:12",
                            "Upvotes": 14,
                            "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev94eq4": [
                [
                    {
                        "Parent ID": "t1_ev8qtic",
                        "Comment ID": "ev94eq4",
                        "Author": "Lilith-Rising",
                        "Date Created": "07-28-2019 04:18:21",
                        "Upvotes": 2,
                        "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "evar1sf": [
                        {
                            "Parent ID": "t1_ev94eq4",
                            "Comment ID": "evar1sf",
                            "Author": "NoaahFoster",
                            "Date Created": "07-28-2019 18:01:27",
                            "Upvotes": 1,
                            "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9rebd": [
                [
                    {
                        "Parent ID": "t1_ev93tif",
                        "Comment ID": "ev9rebd",
                        "Author": "LowCalPal",
                        "Date Created": "07-28-2019 10:55:39",
                        "Upvotes": 1,
                        "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8yt0c": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8yt0c",
                        "Author": "bizzarepeanut",
                        "Date Created": "07-28-2019 02:02:32",
                        "Upvotes": 9,
                        "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                        "Edited?": "07-28-2019 02:07:52",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9yofj": [
                        {
                            "Parent ID": "t1_ev8yt0c",
                            "Comment ID": "ev9yofj",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-28-2019 12:22:03",
                            "Upvotes": 2,
                            "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8duel": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8duel",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 20:17:20",
                        "Upvotes": 6,
                        "Text": "ohhhh, i misread it! thank you!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8fuef": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8fuef",
                        "Author": "chillinthetrees",
                        "Date Created": "07-27-2019 20:45:24",
                        "Upvotes": 10,
                        "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8s184": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8s184",
                        "Author": "lintuski",
                        "Date Created": "07-27-2019 23:50:17",
                        "Upvotes": 3,
                        "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "evaeois": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "evaeois",
                        "Author": "hungryhippo53",
                        "Date Created": "07-28-2019 15:30:51",
                        "Upvotes": 2,
                        "Text": "Ugh I had a hell of a time on mirtazapine",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ev89fft": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev89fft",
                "Author": "barbieprivilege",
                "Date Created": "07-27-2019 19:16:19",
                "Upvotes": 32,
                "Text": "I have a new dr and I know I’m slipping, so I asked for help with my ED. He said “oh, just go over to the wellness center and see a nutritionist!”\n\n\n\nYeah bud, never seen one of *those* before 🙄\n\n\n\nIt’s so hard to get help until you’re actively dying and then it’s all “we had no idea 🙃”",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ev8ccrj": [
                {
                    "Parent ID": "t1_ev89fft",
                    "Comment ID": "ev8ccrj",
                    "Author": "NoaahFoster",
                    "Date Created": "07-27-2019 19:56:18",
                    "Upvotes": 21,
                    "Text": "yikes, \"nutritionists\" are not qualified to treat disorders; they’re usually more like life coaches for the specific purpose of helping people change their lifestyle choices, people who don’t know how to feed themselves properly/healthily. if anything, assuming you haven’t seen one before, you need a dietician, an *actual* health practitioner specialising in eating and food. don’t ever waste your time/money on some quack.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ev8m9v8": [
                        {
                            "Parent ID": "t1_ev8ccrj",
                            "Comment ID": "ev8m9v8",
                            "Author": "symptomatic_basic",
                            "Date Created": "07-27-2019 22:18:42",
                            "Upvotes": 8,
                            "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev86mw1": [
                [
                    {
                        "Parent ID": "t1_ev8650f",
                        "Comment ID": "ev86mw1",
                        "Author": "sleepybear7",
                        "Date Created": "07-27-2019 18:38:40",
                        "Upvotes": 14,
                        "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev86yti": [
                        {
                            "Parent ID": "t1_ev86mw1",
                            "Comment ID": "ev86yti",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 18:43:06",
                            "Upvotes": 24,
                            "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8cx28": [
                [
                    {
                        "Parent ID": "t1_ev893s4",
                        "Comment ID": "ev8cx28",
                        "Author": "AngeloLacrime",
                        "Date Created": "07-27-2019 20:04:11",
                        "Upvotes": 39,
                        "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev96crc": [
                [
                    {
                        "Parent ID": "t1_ev9434r",
                        "Comment ID": "ev96crc",
                        "Author": "oddsick",
                        "Date Created": "07-28-2019 05:08:38",
                        "Upvotes": 1,
                        "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8qtic": [
                [
                    {
                        "Parent ID": "t1_ev8m9v8",
                        "Comment ID": "ev8qtic",
                        "Author": "NoaahFoster",
                        "Date Created": "07-27-2019 23:30:02",
                        "Upvotes": 3,
                        "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev94eq4": [
                        {
                            "Parent ID": "t1_ev8qtic",
                            "Comment ID": "ev94eq4",
                            "Author": "Lilith-Rising",
                            "Date Created": "07-28-2019 04:18:21",
                            "Upvotes": 2,
                            "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev93tif": [
                [
                    {
                        "Parent ID": "t1_ev8m9v8",
                        "Comment ID": "ev93tif",
                        "Author": "TotallyNotARadar",
                        "Date Created": "07-28-2019 04:02:53",
                        "Upvotes": 3,
                        "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9rebd": [
                        {
                            "Parent ID": "t1_ev93tif",
                            "Comment ID": "ev9rebd",
                            "Author": "LowCalPal",
                            "Date Created": "07-28-2019 10:55:39",
                            "Upvotes": 1,
                            "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev88e44": [
                [
                    {
                        "Parent ID": "t1_ev86yti",
                        "Comment ID": "ev88e44",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 19:02:19",
                        "Upvotes": 13,
                        "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8a0ev": [
                        {
                            "Parent ID": "t1_ev88e44",
                            "Comment ID": "ev8a0ev",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 19:24:12",
                            "Upvotes": 14,
                            "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "evar1sf": [
                [
                    {
                        "Parent ID": "t1_ev94eq4",
                        "Comment ID": "evar1sf",
                        "Author": "NoaahFoster",
                        "Date Created": "07-28-2019 18:01:27",
                        "Upvotes": 1,
                        "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8yt0c": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8yt0c",
                        "Author": "bizzarepeanut",
                        "Date Created": "07-28-2019 02:02:32",
                        "Upvotes": 9,
                        "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                        "Edited?": "07-28-2019 02:07:52",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9yofj": [
                        {
                            "Parent ID": "t1_ev8yt0c",
                            "Comment ID": "ev9yofj",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-28-2019 12:22:03",
                            "Upvotes": 2,
                            "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8duel": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8duel",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 20:17:20",
                        "Upvotes": 6,
                        "Text": "ohhhh, i misread it! thank you!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8fuef": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8fuef",
                        "Author": "chillinthetrees",
                        "Date Created": "07-27-2019 20:45:24",
                        "Upvotes": 10,
                        "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8s184": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8s184",
                        "Author": "lintuski",
                        "Date Created": "07-27-2019 23:50:17",
                        "Upvotes": 3,
                        "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "evaeois": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "evaeois",
                        "Author": "hungryhippo53",
                        "Date Created": "07-28-2019 15:30:51",
                        "Upvotes": 2,
                        "Text": "Ugh I had a hell of a time on mirtazapine",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ev87ijb": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev87ijb",
                "Author": "whonoses",
                "Date Created": "07-27-2019 18:50:28",
                "Upvotes": 25,
                "Text": "I love this as a person who became severely underweight and then recovered (healthy low bmi) and relapsed! And instead of recognizing my relapse and looking to get better before it got too bad again, I literally would not accept recovery again until I could be deemed a true anorexic!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ev82gc9": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev82gc9",
                "Author": "isthised",
                "Date Created": "07-27-2019 17:53:26",
                "Upvotes": 20,
                "Text": "Thank you for this. It feels like treatment is too easy to get when I don’t think I’m that sick or that bad and my weight is normal/over and I’m STILL being sent to Residential. I feel like I’m taking someone’s spot who needs it more or that my team is over prescribing treatment. It’s helpful to read this post.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ev88r9h": [
                {
                    "Parent ID": "t1_ev82gc9",
                    "Comment ID": "ev88r9h",
                    "Author": "lowlifelowcal",
                    "Date Created": "07-27-2019 19:07:10",
                    "Upvotes": 9,
                    "Text": "Sending you all the love and recovery vibes! You do deserve to get help. Our situations might all be different but one thing we share is the pain that comes with an ED. I would never wish it on anyone and the less people can suffer, the better. I wish you all the best!",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "ev86mw1": [
                [
                    {
                        "Parent ID": "t1_ev8650f",
                        "Comment ID": "ev86mw1",
                        "Author": "sleepybear7",
                        "Date Created": "07-27-2019 18:38:40",
                        "Upvotes": 14,
                        "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev86yti": [
                        {
                            "Parent ID": "t1_ev86mw1",
                            "Comment ID": "ev86yti",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 18:43:06",
                            "Upvotes": 24,
                            "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8cx28": [
                [
                    {
                        "Parent ID": "t1_ev893s4",
                        "Comment ID": "ev8cx28",
                        "Author": "AngeloLacrime",
                        "Date Created": "07-27-2019 20:04:11",
                        "Upvotes": 39,
                        "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8m9v8": [
                [
                    {
                        "Parent ID": "t1_ev8ccrj",
                        "Comment ID": "ev8m9v8",
                        "Author": "symptomatic_basic",
                        "Date Created": "07-27-2019 22:18:42",
                        "Upvotes": 8,
                        "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8qtic": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev8qtic",
                            "Author": "NoaahFoster",
                            "Date Created": "07-27-2019 23:30:02",
                            "Upvotes": 3,
                            "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev93tif": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev93tif",
                            "Author": "TotallyNotARadar",
                            "Date Created": "07-28-2019 04:02:53",
                            "Upvotes": 3,
                            "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev96crc": [
                [
                    {
                        "Parent ID": "t1_ev9434r",
                        "Comment ID": "ev96crc",
                        "Author": "oddsick",
                        "Date Created": "07-28-2019 05:08:38",
                        "Upvotes": 1,
                        "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev88e44": [
                [
                    {
                        "Parent ID": "t1_ev86yti",
                        "Comment ID": "ev88e44",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 19:02:19",
                        "Upvotes": 13,
                        "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8a0ev": [
                        {
                            "Parent ID": "t1_ev88e44",
                            "Comment ID": "ev8a0ev",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 19:24:12",
                            "Upvotes": 14,
                            "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev94eq4": [
                [
                    {
                        "Parent ID": "t1_ev8qtic",
                        "Comment ID": "ev94eq4",
                        "Author": "Lilith-Rising",
                        "Date Created": "07-28-2019 04:18:21",
                        "Upvotes": 2,
                        "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "evar1sf": [
                        {
                            "Parent ID": "t1_ev94eq4",
                            "Comment ID": "evar1sf",
                            "Author": "NoaahFoster",
                            "Date Created": "07-28-2019 18:01:27",
                            "Upvotes": 1,
                            "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9rebd": [
                [
                    {
                        "Parent ID": "t1_ev93tif",
                        "Comment ID": "ev9rebd",
                        "Author": "LowCalPal",
                        "Date Created": "07-28-2019 10:55:39",
                        "Upvotes": 1,
                        "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8yt0c": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8yt0c",
                        "Author": "bizzarepeanut",
                        "Date Created": "07-28-2019 02:02:32",
                        "Upvotes": 9,
                        "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                        "Edited?": "07-28-2019 02:07:52",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9yofj": [
                        {
                            "Parent ID": "t1_ev8yt0c",
                            "Comment ID": "ev9yofj",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-28-2019 12:22:03",
                            "Upvotes": 2,
                            "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8duel": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8duel",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 20:17:20",
                        "Upvotes": 6,
                        "Text": "ohhhh, i misread it! thank you!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8fuef": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8fuef",
                        "Author": "chillinthetrees",
                        "Date Created": "07-27-2019 20:45:24",
                        "Upvotes": 10,
                        "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8s184": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8s184",
                        "Author": "lintuski",
                        "Date Created": "07-27-2019 23:50:17",
                        "Upvotes": 3,
                        "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "evaeois": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "evaeois",
                        "Author": "hungryhippo53",
                        "Date Created": "07-28-2019 15:30:51",
                        "Upvotes": 2,
                        "Text": "Ugh I had a hell of a time on mirtazapine",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ev80ip9": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev80ip9",
                "Author": "mal31_",
                "Date Created": "07-27-2019 17:38:08",
                "Upvotes": 43,
                "Text": "I really felt that when u said “i won’t be able to say I’m sick anymore” I literally used to take shitty online ed quizzes and look at my incredibly unhealthy score as if it were some kind of validation that I was really sick.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ev8j47d": [
                {
                    "Parent ID": "t1_ev80ip9",
                    "Comment ID": "ev8j47d",
                    "Author": "probablyfuckedurdad",
                    "Date Created": "07-27-2019 21:32:18",
                    "Upvotes": 17,
                    "Text": "this sentence gave me ptsd",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ev86mw1": [
                [
                    {
                        "Parent ID": "t1_ev8650f",
                        "Comment ID": "ev86mw1",
                        "Author": "sleepybear7",
                        "Date Created": "07-27-2019 18:38:40",
                        "Upvotes": 14,
                        "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev86yti": [
                        {
                            "Parent ID": "t1_ev86mw1",
                            "Comment ID": "ev86yti",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 18:43:06",
                            "Upvotes": 24,
                            "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8cx28": [
                [
                    {
                        "Parent ID": "t1_ev893s4",
                        "Comment ID": "ev8cx28",
                        "Author": "AngeloLacrime",
                        "Date Created": "07-27-2019 20:04:11",
                        "Upvotes": 39,
                        "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8m9v8": [
                [
                    {
                        "Parent ID": "t1_ev8ccrj",
                        "Comment ID": "ev8m9v8",
                        "Author": "symptomatic_basic",
                        "Date Created": "07-27-2019 22:18:42",
                        "Upvotes": 8,
                        "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8qtic": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev8qtic",
                            "Author": "NoaahFoster",
                            "Date Created": "07-27-2019 23:30:02",
                            "Upvotes": 3,
                            "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev93tif": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev93tif",
                            "Author": "TotallyNotARadar",
                            "Date Created": "07-28-2019 04:02:53",
                            "Upvotes": 3,
                            "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev96crc": [
                [
                    {
                        "Parent ID": "t1_ev9434r",
                        "Comment ID": "ev96crc",
                        "Author": "oddsick",
                        "Date Created": "07-28-2019 05:08:38",
                        "Upvotes": 1,
                        "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev88e44": [
                [
                    {
                        "Parent ID": "t1_ev86yti",
                        "Comment ID": "ev88e44",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 19:02:19",
                        "Upvotes": 13,
                        "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8a0ev": [
                        {
                            "Parent ID": "t1_ev88e44",
                            "Comment ID": "ev8a0ev",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 19:24:12",
                            "Upvotes": 14,
                            "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev94eq4": [
                [
                    {
                        "Parent ID": "t1_ev8qtic",
                        "Comment ID": "ev94eq4",
                        "Author": "Lilith-Rising",
                        "Date Created": "07-28-2019 04:18:21",
                        "Upvotes": 2,
                        "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "evar1sf": [
                        {
                            "Parent ID": "t1_ev94eq4",
                            "Comment ID": "evar1sf",
                            "Author": "NoaahFoster",
                            "Date Created": "07-28-2019 18:01:27",
                            "Upvotes": 1,
                            "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9rebd": [
                [
                    {
                        "Parent ID": "t1_ev93tif",
                        "Comment ID": "ev9rebd",
                        "Author": "LowCalPal",
                        "Date Created": "07-28-2019 10:55:39",
                        "Upvotes": 1,
                        "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8yt0c": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8yt0c",
                        "Author": "bizzarepeanut",
                        "Date Created": "07-28-2019 02:02:32",
                        "Upvotes": 9,
                        "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                        "Edited?": "07-28-2019 02:07:52",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9yofj": [
                        {
                            "Parent ID": "t1_ev8yt0c",
                            "Comment ID": "ev9yofj",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-28-2019 12:22:03",
                            "Upvotes": 2,
                            "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8duel": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8duel",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 20:17:20",
                        "Upvotes": 6,
                        "Text": "ohhhh, i misread it! thank you!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8fuef": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8fuef",
                        "Author": "chillinthetrees",
                        "Date Created": "07-27-2019 20:45:24",
                        "Upvotes": 10,
                        "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8s184": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8s184",
                        "Author": "lintuski",
                        "Date Created": "07-27-2019 23:50:17",
                        "Upvotes": 3,
                        "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "evaeois": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "evaeois",
                        "Author": "hungryhippo53",
                        "Date Created": "07-28-2019 15:30:51",
                        "Upvotes": 2,
                        "Text": "Ugh I had a hell of a time on mirtazapine",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ev87rav": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev87rav",
                "Author": "broketreebranch",
                "Date Created": "07-27-2019 18:53:42",
                "Upvotes": 44,
                "Text": "Also what is this bullshit about body positivity only being for fat people??",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ev8kcij": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev8kcij",
                "Author": "beetrah",
                "Date Created": "07-27-2019 21:50:02",
                "Upvotes": 16,
                "Text": "Thank you! My weight loss has been celebrated even though I don’t eat at all somedays, and the days I do eat I either restrict to about 500 calories, or I binge an amount I don’t care to admit.\n\nIt’s damn near impossible to get help until you’re underweight. I’ve lost 40 lbs in such a dangerous way and people are cheering me on.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ev97wmy": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev97wmy",
                "Author": "[deleted]",
                "Date Created": "07-28-2019 05:48:23",
                "Upvotes": 10,
                "Text": "normies are not allowed to have an opinion about people with eds at all and especially decide who's the \"real anorexic\" and who's \"fake\" **fight me**",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ev8uzp5": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev8uzp5",
                "Author": "edgaranalhoe",
                "Date Created": "07-28-2019 00:43:28",
                "Upvotes": 6,
                "Text": "there's the same thing happening with the two staple favourites of reddit (aka \"crippling depression and severe social anxiety™\"), and it drives me up the wall. people seem to call bs on everybody for saying this or that if it doesn't align with their made up agenda, and think they are the only ones who feel shit. just because you can't see me suffering when we are literally strangers who talked twice, doesn't mean that i am not hurting??",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ev9el8f": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev9el8f",
                "Author": "Ummah_Strong",
                "Date Created": "07-28-2019 08:05:07",
                "Upvotes": 3,
                "Text": "it's also hypocritical. I think the gatekeeping happens so that when they see a post demonstrating ED, and recognize their selves in the post if they deny the poster has ED they can deny that they themselves should re examine how healthy their behaviour and attitudes to food are.  \n\npersonally I never tell anyonethey donor dont have something because of they suspect they do they can still benefit from treatment",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ev8xcd1": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev8xcd1",
                "Author": "[deleted]",
                "Date Created": "07-28-2019 01:30:56",
                "Upvotes": 5,
                "Text": "[deleted]",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ev9434r": [
                {
                    "Parent ID": "t1_ev8xcd1",
                    "Comment ID": "ev9434r",
                    "Author": "Lilith-Rising",
                    "Date Created": "07-28-2019 04:09:52",
                    "Upvotes": 1,
                    "Text": "Would you only feel validated if you were diagnosed with an ED? I validate you no matter what, diagnoses or no. Your struggle is valid and a label doesn’t determine that validity.  (But it does determine access to care and that’s a fucking novel) I hope you have kind professionals that will validate you and help you in your journey, because if they don’t believe you then you deserve someone who does!",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ev96crc": [
                        {
                            "Parent ID": "t1_ev9434r",
                            "Comment ID": "ev96crc",
                            "Author": "oddsick",
                            "Date Created": "07-28-2019 05:08:38",
                            "Upvotes": 1,
                            "Text": "my therapist is thankfully lovely and did diagnose me as a teenager, and i'm really grateful to have that because i know a lot of people don't.  it's mostly just everywhere else - i tried to get in an inpatient program and they denied me because \"others needed the spot more\".  it's frustrating.  but thank you so much for your kind words, and i hope you're doing well ♡",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev86mw1": [
                [
                    {
                        "Parent ID": "t1_ev8650f",
                        "Comment ID": "ev86mw1",
                        "Author": "sleepybear7",
                        "Date Created": "07-27-2019 18:38:40",
                        "Upvotes": 14,
                        "Text": "Ugh that is infuriating. I hope you were able to get back on it or found something else that works.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev86yti": [
                        {
                            "Parent ID": "t1_ev86mw1",
                            "Comment ID": "ev86yti",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 18:43:06",
                            "Upvotes": 24,
                            "Text": "It's also an ADHD med and I ended up getting neuropsych testing for ADHD and getting prescribed it so thankfully it all did work out in the end. But yeah I totally got gatekept out of BED by a psychiatrist. I'm glad it worked out for me but I hate to think about people in similar situations that didn't just happen to also have another issue that they could get the same prescription for.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8cx28": [
                [
                    {
                        "Parent ID": "t1_ev893s4",
                        "Comment ID": "ev8cx28",
                        "Author": "AngeloLacrime",
                        "Date Created": "07-27-2019 20:04:11",
                        "Upvotes": 39,
                        "Text": "\"Skinny people aren't automatically the only sufferers.\" ... This ... It took me YEARS to be able to get myself to admit that I have an ED because I don't look like the image people have in their heads when they think \"anorexic.\" I thought .. I don't look sick enough. I can't possibly have an ED. It's something I've been struggling with on and off since middle school. That was like 13 years ago... I only just came to terms with it this year. Only 3 people in my life know about it. None of my family. I feel like I wouldn't be taken seriously because I couldn't even accept it myself..",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8m9v8": [
                [
                    {
                        "Parent ID": "t1_ev8ccrj",
                        "Comment ID": "ev8m9v8",
                        "Author": "symptomatic_basic",
                        "Date Created": "07-27-2019 22:18:42",
                        "Upvotes": 8,
                        "Text": "Yes this! Dietitians are licensed medical practitioners; nutritionists are not. Anyone can complete a certificate online to become a nutritionist. It scares me how often I see people assume nutritionists are the same. I’m surprised the doctor said nutritionist, there’s a lack of respect for dietitians and it’s sad. My mom is a dietitian and I’ve heard all about the crap she’s had to fight to be taken seriously, despite 2 years of schooling, licensing exams, a practicum, and years of experience. Sounds legit to me. Rant over sorryyyyy!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8qtic": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev8qtic",
                            "Author": "NoaahFoster",
                            "Date Created": "07-27-2019 23:30:02",
                            "Upvotes": 3,
                            "Text": "it must really piss your mom off when nutritionists who didn’t go through the challenge of becoming a licensed medical practitioner equate themselves to dieticians, sounds infuriating and it’s sad to hear that these nutritionists have made it harder for dieticians to be taken seriously :/ nutritionists are damn near the same as people who do their own medical \"research\" online instead of listening to/going to a real doctor (example: anti-vaxxers)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ev93tif": [
                        {
                            "Parent ID": "t1_ev8m9v8",
                            "Comment ID": "ev93tif",
                            "Author": "TotallyNotARadar",
                            "Date Created": "07-28-2019 04:02:53",
                            "Upvotes": 3,
                            "Text": "> Anyone can complete a certificate online to become a nutritionist\n\nBrb going to figure out how to get certified",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev88e44": [
                [
                    {
                        "Parent ID": "t1_ev86yti",
                        "Comment ID": "ev88e44",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 19:02:19",
                        "Upvotes": 13,
                        "Text": "if you don't mind me asking, what medication was it? i've just been diagnosed with adhd and i'm going to get medication soon but i haven't heard of any that cause binge eating.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev8a0ev": [
                        {
                            "Parent ID": "t1_ev88e44",
                            "Comment ID": "ev8a0ev",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-27-2019 19:24:12",
                            "Upvotes": 14,
                            "Text": "It wasn't an ADHD med that caused the binge eating. It was for depression/anxiety. It's mirtazapine. I was on it long before I was diagnosed with ADHD. The med I'm on that treats both BED and ADHD is vyvanse.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev94eq4": [
                [
                    {
                        "Parent ID": "t1_ev8qtic",
                        "Comment ID": "ev94eq4",
                        "Author": "Lilith-Rising",
                        "Date Created": "07-28-2019 04:18:21",
                        "Upvotes": 2,
                        "Text": "Idk the recovery center I went to had dietitians spouting blatant misinformation which ultimately led to me mistrusting them and leaving the center. That might be another reason people don’t take them seriously. There are good ones but when there are bad ones in recovery centers it’s like...I have nowhere else to turn and any faith or trust left has been burnt for a lifetime.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "evar1sf": [
                        {
                            "Parent ID": "t1_ev94eq4",
                            "Comment ID": "evar1sf",
                            "Author": "NoaahFoster",
                            "Date Created": "07-28-2019 18:01:27",
                            "Upvotes": 1,
                            "Text": "it’s like anything else, there are bad ones and good ones. i have plenty of both good and bad experiences with various healthcare practitioners of all kinds under my belt. your mistrust after being treated like that is understandable, though, and i’m sorry it happened. i’m definitely wary of anyone at first. unfortunately there are too many people working in healthcare that probably really shouldn’t be. there’s also a chance those \"dieticians\" were illegitimate. doesn’t make the shitty experience any better though of course.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev9rebd": [
                [
                    {
                        "Parent ID": "t1_ev93tif",
                        "Comment ID": "ev9rebd",
                        "Author": "LowCalPal",
                        "Date Created": "07-28-2019 10:55:39",
                        "Upvotes": 1,
                        "Text": "You can literally just call yourself a nutritionist and that makes you one.  It’s a completely unregulated title.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8yt0c": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8yt0c",
                        "Author": "bizzarepeanut",
                        "Date Created": "07-28-2019 02:02:32",
                        "Upvotes": 9,
                        "Text": "Oh god mirtazapine, I think it’s also called Remeron (sp?) They put me on that in rehab, and it gave me night terrors and awful episodes of sleep paralysis as well as made me perpetually groggy. I found out later that it can cause weight gain which wasn’t helpful as a newly clean heroin addict struggling with an ED simultaneously. \n\nBut then again the whole “Rehab Industry” in Florida is a fucking mess and they prescribed pretty much everyone a cocktail of the same 4-5 drugs that (surprise) don’t work for everyone. (ETA: at least they did this 6 yrs ago when I was there, don’t know what drugs are commonly prescribed now.) Between Remeron, Seroquel, and Gabapentin they were making a killing off recovering addicts’ insurance. I don’t think I met a single person that wasn’t on at least one of them. I stopped taking it as soon as I was out of rehab and had the authority to refuse meds at my halfway house, they didn’t help and had side effects that were way worse than what they supposedly “helped.”",
                        "Edited?": "07-28-2019 02:07:52",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ev9yofj": [
                        {
                            "Parent ID": "t1_ev8yt0c",
                            "Comment ID": "ev9yofj",
                            "Author": "Cheap_Bat",
                            "Date Created": "07-28-2019 12:22:03",
                            "Upvotes": 2,
                            "Text": "Remeron and Seroquel are so heavily prescribed I swear. I was in IOP (intensive outpatient therapy so basically the step before inpatient treatment) and had never been on any psych meds before and they immediately wanted to put me on both of those at the same time. I have no idea why anybody would think it's a good idea to give someone who's never taken any meds before both of those things at once. They both can cause weight gain, they're both extremely sedating. One of them is an antipsychotic. I was in treatment for anxiety/depression/panic attacks like?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ev8duel": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8duel",
                        "Author": "szerim",
                        "Date Created": "07-27-2019 20:17:20",
                        "Upvotes": 6,
                        "Text": "ohhhh, i misread it! thank you!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8fuef": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8fuef",
                        "Author": "chillinthetrees",
                        "Date Created": "07-27-2019 20:45:24",
                        "Upvotes": 10,
                        "Text": "Good for you. Vyvanse are so much healthier and easier on your mental state than adderal. Adderal is evil shit. I was misdiagnosed with add as a young child and was on adderall until i started refusing to take it in middle school (haven't had any symptoms of add since, or really before either) and i am absolutely certain that the level of emotional numbing and apetite suppression i suffered at the hands of adderall is exactly why anorexia comes so naturally to me.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ev8s184": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "ev8s184",
                        "Author": "lintuski",
                        "Date Created": "07-27-2019 23:50:17",
                        "Upvotes": 3,
                        "Text": "Same! I’m on that and it hasn’t made the slightest bit of difference to my eating. Thankfully my Dr was very understanding.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "evaeois": [
                [
                    {
                        "Parent ID": "t1_ev8a0ev",
                        "Comment ID": "evaeois",
                        "Author": "hungryhippo53",
                        "Date Created": "07-28-2019 15:30:51",
                        "Upvotes": 2,
                        "Text": "Ugh I had a hell of a time on mirtazapine",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ev9a215": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev9a215",
                "Author": "kanamia",
                "Date Created": "07-28-2019 06:38:50",
                "Upvotes": 2,
                "Text": "Oh dear gawd! I totally agree! Why care so fukin’ much what someone else says they are going through? Why not just try to be supportive and wish them the best? It takes no extra effort at all!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ev9y8qa": [
        [
            {
                "Parent ID": "t3_cim5c4",
                "Comment ID": "ev9y8qa",
                "Author": "randomspaceprincess",
                "Date Created": "07-28-2019 12:17:01",
                "Upvotes": 2,
                "Text": "I hate it so much. It's the reason why I never got into treatment for an eating disorder. I am formally diagnosed with BED, but my health care provider at the time marked it down as \"not the focus of therapy\" because I wasn't in a dangerous area with my weight. I also lied about struggling with eating because I felt like they wouldn't believe me if I told them I was still going through cycles of binge eating, restricting and bingeing/purging ALL THE TIME.\n\nLast year my restricting/anorexic behaviours came back with full force. I lost a lot of weight in a pretty short period of time and everyone congratulated me because I'm overweight. Then I had a breakdown earlier this year and tried to stop, but now I'm back in the same hellscape. Your brain doesn't stop with this bullshit just because you are no longer underweight. Not eating enough, not getting the nutrients you need, is dangerous, even if you are overweight. What I'm doing to myself is a nightmare and I'm still not ready to get help because I feel like I don't \"deserve\" it and nobody will take me seriously because I'm not emaciated. To be honest, I really want to recover, but my brain keeps spinning that into \"Well, I guess we really need to buckle down and starve ourselves so we can be severely underweight and get the treatment we need\".",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}