{
    "f608e57": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f608e57",
                "Author": "ready2rope",
                "Date Created": "11-01-2019 06:59:20",
                "Upvotes": 132,
                "Text": "Are you describing me? When I eat on my own it’s “skinny legend eating disorder time” - small “meals” and diet sodas or otherwise I feel bad. It’s hard to “treat” myself to a real meal or an “unsafe” snack. Then, when it’s not a “proper” eating together snack/meal time I can’t eat in front of other people - if they’re not eating with me I feel wrong. But if I go out to eat with someone, or I’m sharing some snacks with my boyfriend that I’ve accounted for, it feels less wrong. I always catch myself subconsciously planning for spontaneous food-related occasions, also. “I should high-restrict today because maybe my boyfriend will want to order in tonight!” And then he doesn’t so I get upset, lmao.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f60hdmw": [
                {
                    "Parent ID": "t1_f608e57",
                    "Comment ID": "f60hdmw",
                    "Author": "cervidaes",
                    "Date Created": "11-01-2019 09:08:07",
                    "Upvotes": 60,
                    "Text": "Omg you just literally described me holy shit especially the \"oh I'm gonna fast until dinner so bf and I can order in\" and then when hes like \"let's just cook\" I feel so BETRAYED even though like it's good because now I'll eat fewer calories but like....I was ready to eat like a normal person without feeling guilty about it",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f612vk2": [
                        {
                            "Parent ID": "t1_f60hdmw",
                            "Comment ID": "f612vk2",
                            "Author": "TheShortGerman",
                            "Date Created": "11-01-2019 13:10:32",
                            "Upvotes": 17,
                            "Text": "There’s nothing worse than planning for an extravagance and feeling like you’re beating the ED and then having those plans ruined",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "f6099hu": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f6099hu",
                "Author": "autumnflame4",
                "Date Created": "11-01-2019 07:14:12",
                "Upvotes": 24,
                "Text": "I mean there’s definitely both sides. Honestly eating with people makes way more sense, I think. For basically the reasons you said...let people see you eat so they don’t worry, be unlikely to binge, and actually be around people. But for me the further I got into my disorder the less I could eat around anyone. It’s more a fear thing than a thing that actually makes sense.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f62i11r": [
                {
                    "Parent ID": "t1_f6099hu",
                    "Comment ID": "f62i11r",
                    "Author": "KittyTittyScribbles",
                    "Date Created": "11-01-2019 20:59:47",
                    "Upvotes": 3,
                    "Text": "I think your experience is the more common one, and I know the worse I get the more likely it is I'll struggle in social situations that mean I have less control over my food (restaurants). \n\nI think I have a huge fear of worrying people or insulting them by not eating which fuels me to eat much more normally in public.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f612vk2": [
                [
                    {
                        "Parent ID": "t1_f60hdmw",
                        "Comment ID": "f612vk2",
                        "Author": "TheShortGerman",
                        "Date Created": "11-01-2019 13:10:32",
                        "Upvotes": 17,
                        "Text": "There’s nothing worse than planning for an extravagance and feeling like you’re beating the ED and then having those plans ruined",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f609bgk": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f609bgk",
                "Author": "jayrambling",
                "Date Created": "11-01-2019 07:15:07",
                "Upvotes": 21,
                "Text": "Yup that's me. When I'm alone I'm afraid I'll overeat but when I eat with someone else I just need to watch to see how much they eat and eat less than them. I know it's not entirely healthy but it kind of insures me that I'm not eating too much all while pulling off the impression that I'm eating like I should to friends and family",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60aoq2": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60aoq2",
                "Author": "sfn24",
                "Date Created": "11-01-2019 07:36:58",
                "Upvotes": 34,
                "Text": "I’m the opposite, I’m more comfortable by myself. I don’t feel judged for eating seven cucumber slices for a meal, but if I’m with other people I feel pressured to eat more and then I feel guilty over eating it for days.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60cfg4": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60cfg4",
                "Author": "mourningxdove",
                "Date Created": "11-01-2019 08:02:55",
                "Upvotes": 8,
                "Text": "Yuuuup me 🙋‍♀️ eating in front of people has never been an issue for me. Eating alone is a whole other story, I'm more likely to restrict and bin food or pick.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f608rxb": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f608rxb",
                "Author": "Saturninegirl",
                "Date Created": "11-01-2019 07:05:55",
                "Upvotes": 6,
                "Text": "Are you meee ???",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60ogdu": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60ogdu",
                "Author": "Weeb_Trash_420",
                "Date Created": "11-01-2019 10:30:54",
                "Upvotes": 7,
                "Text": "I'm the opposite I get even more uncomfortable because I have to look at people and look/smell what they're eating, and because people are more than likely gonna shove food I clearly don't want in my face because I'm eating something different from what everyone else is eating (usually chicken or pizza).",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f610zdn": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f610zdn",
                "Author": "Rivka90",
                "Date Created": "11-01-2019 12:49:27",
                "Upvotes": 5,
                "Text": "I like eating with other people because I eat slower and I can't possibly binge. But...I don't really enjoy the food *as much*. I'll straight up lie when I'm fasting. The moment some one hears fasting they get an opinion.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60g2co": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60g2co",
                "Author": "fleurandfauna",
                "Date Created": "11-01-2019 08:51:48",
                "Upvotes": 4,
                "Text": "Yes. Even if we're not all eating together, if they're just around. Like snacking at work.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60gdks": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60gdks",
                "Author": "FideliaDelarosa",
                "Date Created": "11-01-2019 08:55:39",
                "Upvotes": 4,
                "Text": "This is so me! The best days are when im around people at meals, and the worst when on my own! The only problem is when I'm eating with someone who eats very little or slowly, then my ED starts screaming at me ...",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60jwuw": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60jwuw",
                "Author": "Heisenbergslover",
                "Date Created": "11-01-2019 09:38:42",
                "Upvotes": 5,
                "Text": "I'm definitely way less disordered if I'm eating with my boyfriend, my other partner or my parents and my sister. They are the people that make me feel the safest. My boyfriend and my partner are the only ones that know the true extent of my ED and they're both awesome at handling my freak outs around food. I don't think that my parents and my sister suspect about my orthorexia, but they have a very relaxed attitude when it comes to eating, so I never feel pressured to eat more or less than what I want. Also they're just really nice people and we're extremely close. \n\nIf I'm having a meal alone I tend to be extremely restrictive, but it's even worse if I'm eating in front of strangers (like in between lectures in college). In those situations I just can't eat. I have little snacks at most, like an apple, or a handful of almonds, or a few cherry tomatoes, but never anything substantial. Which is insane and super inadequate for my energy expenditure. I feel... Watched? Which makes no sense, because why would people care about what or if I'm eating? But still, I can't help it, even though I should really try and work on this issue as it's destroying my recovery efforts during the semester.\n\nWeirdly enough, I restrict even when I'm with close friends. They don't know about my ortho, and while they know that I am very into fitness, they don't know that I burn over 3000 calories in an average day. So I end up eating what is \"socially expected\" for a woman my size, and not the \"big\" dinner that I'd really need. And which I have no problem eating if I'm at home with my boyfriend.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f610xu0": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f610xu0",
                "Author": "ejayboshart01",
                "Date Created": "11-01-2019 12:48:59",
                "Upvotes": 3,
                "Text": "I usually eat my food by myself because I don't want people to think that I'm eating too much and feel obese if someone mentions it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f610mgn": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f610mgn",
                "Author": "thecalcographer",
                "Date Created": "11-01-2019 12:45:32",
                "Upvotes": 2,
                "Text": "Me! I will pretty much only eat around other people because then it feels like I’m eating to participate in a social gathering and it because I’m fat/weak/whatever.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f62ionj": [
                {
                    "Parent ID": "t1_f610mgn",
                    "Comment ID": "f62ionj",
                    "Author": "KittyTittyScribbles",
                    "Date Created": "11-01-2019 21:05:56",
                    "Upvotes": 1,
                    "Text": "Yes! This so much. I can make eating about the social activity and not about my self worth",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f612vk2": [
                [
                    {
                        "Parent ID": "t1_f60hdmw",
                        "Comment ID": "f612vk2",
                        "Author": "TheShortGerman",
                        "Date Created": "11-01-2019 13:10:32",
                        "Upvotes": 17,
                        "Text": "There’s nothing worse than planning for an extravagance and feeling like you’re beating the ED and then having those plans ruined",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f610qs2": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f610qs2",
                "Author": "howunfortunate_",
                "Date Created": "11-01-2019 12:46:51",
                "Upvotes": 2,
                "Text": "yeah i completely get it. i wish i had people around me to eat with bc it makes me feel a lot safer? its weird. but my family is all working and im currently not in college for this semester bc of health issues. so the EDNOS monster has returned. my boyfriend orders food w me and we eat it on camera for some company though",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f619ud2": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f619ud2",
                "Author": "[deleted]",
                "Date Created": "11-01-2019 14:24:29",
                "Upvotes": 2,
                "Text": "[deleted]",
                "Edited?": "11-28-2019 12:28:58",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f62ik15": [
                {
                    "Parent ID": "t1_f619ud2",
                    "Comment ID": "f62ik15",
                    "Author": "KittyTittyScribbles",
                    "Date Created": "11-01-2019 21:04:45",
                    "Upvotes": 2,
                    "Text": "I probably should have mentioned that I normally eat OMAD, because exactly yeah, it's so hard to track accurately in a social eating situation. I think if I didn't do OMAD I would be much more fearful. \n\nI'm not sure if it's me wanting to eat with people that drives me to eat OMAD or if it's my way of over compensating for the hard to track meals I do eat",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f612vk2": [
                [
                    {
                        "Parent ID": "t1_f60hdmw",
                        "Comment ID": "f612vk2",
                        "Author": "TheShortGerman",
                        "Date Created": "11-01-2019 13:10:32",
                        "Upvotes": 17,
                        "Text": "There’s nothing worse than planning for an extravagance and feeling like you’re beating the ED and then having those plans ruined",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f61a7an": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f61a7an",
                "Author": "[deleted]",
                "Date Created": "11-01-2019 14:27:59",
                "Upvotes": 2,
                "Text": "Noooooo absolutely not. I cannot eat with other people at all, I feel like everyone judges me for what I eat, how I eat, how fast I eat, how much I eat, how ugly I look when eating, how fat I am. So I don't. It's actually really good for restricting because when I'm at uni from 9 to 5 I won't eat anything all day",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f61bbhv": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f61bbhv",
                "Author": "dragoono",
                "Date Created": "11-01-2019 14:38:42",
                "Upvotes": 2,
                "Text": "I usually only eat lately when someone offers me food, or if everyone is snacking on something (like an open bowl of candy or chex-mix). Other than that, I eat small snacks and liquids. When I make the initiative to go out to eat, or cook food for myself, I feel guilty and like I'm doing something wrong. Probably because I grew up poor, and food was a high-value item.\n\nE: Also because I don't live in my own house anymore, and where I'm living now they don't want or expect me to pay rent, I feel guilty indulging here in any way. Like I'm not respecting their home and belongings when I do anything nice for myself here.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f61qfiv": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f61qfiv",
                "Author": "lavenderelf",
                "Date Created": "11-01-2019 16:40:39",
                "Upvotes": 2,
                "Text": "nearly the only times I eat are when food is offered to me. that way I can fit unexpected meals and snacks with others into my daily caloric intake. it's also probably the only time I feel brave enough to eat lately, oops.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f62hgpm": [
                {
                    "Parent ID": "t1_f61qfiv",
                    "Comment ID": "f62hgpm",
                    "Author": "KittyTittyScribbles",
                    "Date Created": "11-01-2019 20:54:33",
                    "Upvotes": 1,
                    "Text": "I feel so much the same way! I have a lot of fear that of I eat anything by myself someone will offer me something later and I won't be able to take it",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f612vk2": [
                [
                    {
                        "Parent ID": "t1_f60hdmw",
                        "Comment ID": "f612vk2",
                        "Author": "TheShortGerman",
                        "Date Created": "11-01-2019 13:10:32",
                        "Upvotes": 17,
                        "Text": "There’s nothing worse than planning for an extravagance and feeling like you’re beating the ED and then having those plans ruined",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f62m570": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f62m570",
                "Author": "just_another_mutant",
                "Date Created": "11-01-2019 21:41:23",
                "Upvotes": 2,
                "Text": "It depends, but I know what you mean, because sometimes eating with others takes my attention away from the calories or whatever, and lets me eat without thinking as much about it!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f62w8gt": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f62w8gt",
                "Author": "DinosaursAndStarStuf",
                "Date Created": "11-01-2019 23:13:37",
                "Upvotes": 2,
                "Text": "Fuckin yeah. Dinner was late tonight and my SO had something scheduled with his WoW guild but failed to tell me that until after I had a massive meltdown over being told to just go eat alone so now he thinks I am a huge baby who overreacts about everything and he hates me. So I'm not gonna eat dinner and I'm gonna go to sleep with only alcohol calories in me. Then I'm gonna start weighing myself again tomorrow morning.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60nr1t": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60nr1t",
                "Author": "whoatherecourt",
                "Date Created": "11-01-2019 10:22:59",
                "Upvotes": 2,
                "Text": "I have mixed feelings about eating with people. On one hand eating with others keeps me from binging even if I have horrendous urges. When I’m alone, I know I can binge and purge and hide everything I ate without anyone seeing me or knowing about it. But also when I’m eating with other people, I feel pressured to eat normally and stray from my safe foods. So idk. Personally, I would rather eat with people only so I don’t binge/purge.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60igck": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60igck",
                "Author": "missmaliciousmeow",
                "Date Created": "11-01-2019 09:21:23",
                "Upvotes": 2,
                "Text": "Yes! People make me nervous and I eat less. So much less. I hate getting too comfortable when eating with anyone.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60t7m5": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60t7m5",
                "Author": "lbvl",
                "Date Created": "11-01-2019 11:24:22",
                "Upvotes": 2,
                "Text": "Opposite in terms of feelings (dis)comfort, but using the ‘eating with people’ as a tool to avoid slipping into a binge.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f60x80h": [
        [
            {
                "Parent ID": "t3_dq34y1",
                "Comment ID": "f60x80h",
                "Author": "catsinsunglassess",
                "Date Created": "11-01-2019 12:08:28",
                "Upvotes": 2,
                "Text": "Nope. I hate eating with other people, because it usually means I’m eating things i should not be eating. :(",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}