{
    "ekrulfe": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "ekrulfe",
                "Author": "unnecessaryletters",
                "Date Created": "04-12-2019 22:23:24",
                "Upvotes": 91,
                "Text": "sometimes when so many other things and stressors are going on, something that seems \"small\" can just be the final straw. i've totally reacted similarly in situations like this, don't worry! i hope things get less stressful for you soon ❤️",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekrxqye": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "ekrxqye",
                "Author": "whatsupbitchezzz",
                "Date Created": "04-12-2019 23:12:49",
                "Upvotes": 44,
                "Text": "This is incredibly relatable. Crunching the numbers to make everything fit together is a bottomless rabbit hole and I would literally spend all day, every day doing it if I could. I can c o m p l e t e l y understand how if you'd budgeted for that one thing and gotten comfortable with the idea with eating that one thing (and keeping it down!!) and then had to get something else you'd freak out. I've found myself getting irrationally angry at people selling me food if they don't have the item I want and nonchalantly ask \"what do you want instead\" because I forget that for non-ED people, there wouldn't have been hours of work that went into making the original decision.\n\nAnyway, I don't really have great advice except to say happy birthday and I hope you feel better as soon as possible. Also, I'm taking a university class on ED right now and we learned in the family based therapy unit that a central part of ED is that it takes over your thoughts and behaviors. You're not irritable and inconsiderate, erratic, or shameful. You have an eating disorder, and those are its traits. Please don't feel bad about yourself, because it isn't your fault.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eks67ay": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "eks67ay",
                "Author": "Bomby57",
                "Date Created": "04-13-2019 01:57:52",
                "Upvotes": 12,
                "Text": "Aw I know the feeling. Last time I wanted to go buy my favourite binge food and thought about it all week (restriction) but when I arrived the store was closed and I cried all the way home :(\n\nEating disorders are so stupid and they make us like babies... Stay strong and good luck for your exams 💖",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekrzppv": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "ekrzppv",
                "Author": "HonestRaspberry",
                "Date Created": "04-12-2019 23:46:16",
                "Upvotes": 9,
                "Text": "Happy birthday, I hope you feel better and I totally understand the urge to binge when I'm upset. Things hopefully will be better soon!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekrtbf1": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "ekrtbf1",
                "Author": "[deleted]",
                "Date Created": "04-12-2019 22:04:13",
                "Upvotes": 17,
                "Text": "I’m so sorry you’re going through this and had a stressful birthday. happy birthday 💞 i hope you can feel more comfortable soon, and maybe the next will be a better one. The fact that you’re easing yourself into different food is really good too, and I’m sure you’ll be making progress with it soon! im sendin love and good bday wishes",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eks5pz0": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "eks5pz0",
                "Author": "yamiryukia330",
                "Date Created": "04-13-2019 01:47:11",
                "Upvotes": 8,
                "Text": "Happy birthday. Stress makes things go nuts so don't worry. Hopefully things get better for you soon.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eksbf4n": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "eksbf4n",
                "Author": "barbie12312",
                "Date Created": "04-13-2019 04:16:50",
                "Upvotes": 5,
                "Text": "This disorder really ruins your life. You really deserved the best for your birthday (Happy birthday by the way). \nIt’s really hard to enjoy anything when all you think of is restricting or binging and purging. I hope you’ve recovered next year💗",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eksifv1": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "eksifv1",
                "Author": "StephPowell1",
                "Date Created": "04-13-2019 07:12:45",
                "Upvotes": 3,
                "Text": "I have nothing but tears of understanding for you. I'm just sorry. X",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eksn3ql": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "eksn3ql",
                "Author": "[deleted]",
                "Date Created": "04-13-2019 08:33:44",
                "Upvotes": 2,
                "Text": "i really understand. \n\none finals week in my undergrad, i had five straight days of 8 am exams. on maybe the second or third exam, afterwards i decided to go to starbucks and get a little treat to continue studying after restricting all semester. i was stressed out and tired. the line was pretty long, and i was staring in the pastry case deciding what i want. the apple fritter looked so good, that was the one i was going to get.\n\nthe woman in front of me was getting pastries for her office. after picking out about a dozen or so different pastries, my apple fritter was still there. finally, she said, \"oh i'll take that last apple fritter too\". i started to cry and immediately turned around and left the store to hide in the bathroom and have my breakdown. \n\ni'm so sorry you've gone through this, this disorder sucks and takes away a lot from us.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekuepq6": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "ekuepq6",
                "Author": "dmmge",
                "Date Created": "04-13-2019 21:30:30",
                "Upvotes": 2,
                "Text": "Very relatable. Whenever I plan to treat myself, if the thing I want isn’t available, I freeze up and don’t know what to do. It feels like a waste to pick something out, but if I don’t eat it today I can’t until next week and what if they don’t have it then. I hate it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eksphyj": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "eksphyj",
                "Author": "swingsurfer",
                "Date Created": "04-13-2019 09:09:10",
                "Upvotes": 1,
                "Text": "You're the first person I've seen who actually said they hate feeling full but are hungry all the time. That used to be my internal mantra.  I fully convinced myself I hated being full. And I did (at that time). And I would sort of congratulate myself for feeling sufficiently hungry. Finally, years later, I'm no longer stuck in that cycle. But every time I want to lose 10lbs (I try to stay mid to low healthy bmi) I have to fight those disordered thoughts and coping mechanisms. Even though they are still there, it's not a constant. I just want to reassure you that healing is possible and hopefully someday you'll get there. It takes time and it took a lot of mental healing in my case. Personally, being bipolar and depressive was a huge catalyst to my ED. Now that I've been able to overcome that, it's been easier to overcome many other things. Best of luck! It will get better. Don't be ashamed. You're only human and we all get overwhelmed.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eku220x": [
        [
            {
                "Parent ID": "t3_bcm1qm",
                "Comment ID": "eku220x",
                "Author": "tigerchik",
                "Date Created": "04-13-2019 18:37:22",
                "Upvotes": 1,
                "Text": "awww, I'm sorry.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}