{
    "feqd5mg": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "feqd5mg",
                "Author": "punchjackal",
                "Date Created": "01-18-2020 03:38:56",
                "Upvotes": 85,
                "Text": "I can't trust my family with shit. My mom knows I've got food issues and still constantly whines about how she \"used to be skinny\" and dumping snacks on me even though she knows that my obsession with avoiding waste turns it into a terrifying binge spiral. Stepdad makes fun of me, \"watching your girlish figure?\" it's sick. I'm sick, and this community is one of the only places that truly gets it. You're all awesome.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ferebo0": [
                {
                    "Parent ID": "t1_feqd5mg",
                    "Comment ID": "ferebo0",
                    "Author": "manicpixiefearfood",
                    "Date Created": "01-18-2020 07:08:20",
                    "Upvotes": 37,
                    "Text": "This is the exact shit that keeps me from even mentioning any of this to my family. They've got such skewed perceptions of how weight loss works (my mom is a medical professional yet somehow doesn't understand CICO), and my parents keep trying to lose weight with fad diets but they don't work fOr sOmE rEaSoN and they won't. stop. asking. how I'm actually losing weight, only to then dismiss me explaining what a calorie is 🙄\n\nI'm 99% sure my sister's got an ED too, cause literally every time this shit gets brought up we do that fuckin \"looking into the camera\" thing from The Office at each other lmao",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        },
        {
            "ferhnob": [
                {
                    "Parent ID": "t1_feqd5mg",
                    "Comment ID": "ferhnob",
                    "Author": "_alaina_",
                    "Date Created": "01-18-2020 07:26:37",
                    "Upvotes": 18,
                    "Text": ">Stepdad makes fun of me, \"watching your girlish figure?\"\n\nSame with my dad. He doesnt have a clue that I had developed an ED and he likes to tease me about \"going on a diet?!?\" It drives me mad.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        },
        {
            "fes2e4r": [
                {
                    "Parent ID": "t1_feqd5mg",
                    "Comment ID": "fes2e4r",
                    "Author": "Althbird",
                    "Date Created": "01-18-2020 09:18:08",
                    "Upvotes": 9,
                    "Text": "My dad knows I have an eating disorder, and even though I have told him numerous time that it’s unhelpful he will still say “are you hungry or bored?” When I get something to eat. Literally nothing can either make me not eat that day or eat everything that day then those words.\n\nSorry your family is also unhelpful",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        },
        {
            "fesbo0v": [
                {
                    "Parent ID": "t1_feqd5mg",
                    "Comment ID": "fesbo0v",
                    "Author": "hotterthanwasabii",
                    "Date Created": "01-18-2020 10:06:17",
                    "Upvotes": 6,
                    "Text": "Drives me absolutely mad when ppl say ‘oh wow I used to look like you’ or ‘I miss being that skinny’ 😤 like no my BMI is not healthy at all but keep telling yourself you want to live this life 🙄",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        },
        {
            "fesccyl": [
                {
                    "Parent ID": "t1_feqd5mg",
                    "Comment ID": "fesccyl",
                    "Author": "skydiver89",
                    "Date Created": "01-18-2020 10:10:06",
                    "Upvotes": 6,
                    "Text": "Ugh. My mom knows about my BED,but not bulimia. She laughs when she sees me with a pizza or food from my favorite place...like would she laugh if it was heroin? No. The stigma for EDs are fucking ridiculous!",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        },
        {
            "fevu65a": [
                {
                    "Parent ID": "t1_feqd5mg",
                    "Comment ID": "fevu65a",
                    "Author": "BoundKitten",
                    "Date Created": "01-18-2020 20:39:06",
                    "Upvotes": 4,
                    "Text": "I will never forget my mom’s comments when I finally told them about my eating disorder. I was seriously underweight (like BMI of 13 and dropping) and could no longer eat solid food. My parents never said anything or tried to make sure I was okay. So I finally was like “hey, I’m pretty sure I’m dying because I can no longer even walk to the kitchen to get water without passing out and haven’t eaten solid food in a month. I made a consultation appointment at the local eating disorder clinic.” \n\nMy mom’s response “maybe they’ll tell you you’re fine and you can just go home!”\n\nGreat mom. That’s super helpful. She didn’t have anything to say when the eating disorder center said they had a 5 month waiting list but made room to get me into treatment the next day because it was an emergency. \n\nShe’s never been capable of being there when I was struggling. I could never tell her anything because it “stresses her out” and then my abusive dad would punish me for upsetting her. If I told her something in confidence, like about my dad being abusive, she would pretty much immediately tell him. I love my mom, but she was pretty fucking terrible at supporting and protecting me.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "fer4oho": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "fer4oho",
                "Author": "dragaynite",
                "Date Created": "01-18-2020 06:15:50",
                "Upvotes": 29,
                "Text": "My family thinks I’m fairly well put together. I’m currently unemployed, dropped out of community college, and spend most of my conscious thought on how much I hate myself. But I go to the gym and eat a vegan diet and am moving out soon so nobody asks questions bc I’m “taking care of myself. Just taking a break from stress to get situated :))”",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ferdjue": [
                {
                    "Parent ID": "t1_fer4oho",
                    "Comment ID": "ferdjue",
                    "Author": "manicpixiefearfood",
                    "Date Created": "01-18-2020 07:04:25",
                    "Upvotes": 16,
                    "Text": "Meeeee. Am I an unemployed stoner college dropout? Yes. But am I vegan, losing weight, and in the process of getting on disability? Yes. Does that mean that people don't give me shit for doing literally nothing all day? No, but it's definitely gotten *wildly* better as I've lost more and more weight",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "fer18wd": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "fer18wd",
                "Author": "EveryStreet",
                "Date Created": "01-18-2020 05:54:55",
                "Upvotes": 15,
                "Text": "Lol my entire account is all the things I can’t tell my family",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fer2m5r": [
                {
                    "Parent ID": "t1_fer18wd",
                    "Comment ID": "fer2m5r",
                    "Author": "MuddyWalruss",
                    "Date Created": "01-18-2020 06:02:17",
                    "Upvotes": 7,
                    "Text": "Yeah same here pretty much",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ]
        }
    ],
    "ferlqxn": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "ferlqxn",
                "Author": "CunningCabbage",
                "Date Created": "01-18-2020 07:52:33",
                "Upvotes": 19,
                "Text": "Tbh, this sub actually gives a shit if I, a random username, live or die. It's quite astonishing. I pay people to give a shit. They don't.\n\nSo yes, I second the notion. My heart with you.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fesi0t1": [
                {
                    "Parent ID": "t1_ferlqxn",
                    "Comment ID": "fesi0t1",
                    "Author": "colazerocultleader",
                    "Date Created": "01-18-2020 10:35:11",
                    "Upvotes": 3,
                    "Text": "we got you 💜",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "feroznx": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "feroznx",
                "Author": "2normal",
                "Date Created": "01-18-2020 08:11:28",
                "Upvotes": 9,
                "Text": "Yeah same to me too\nMy mom basically got me started on all this shit when I was young (can’t really blame her, she had an ed when she was younger and still has disordered eating. Plus she’s a dietitian)\nIf I ever told her about it, she’d flip her shit \nMy dad just doesn’t understand \nHe just comments on my appearance when my weight fluctuates",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ferp58o": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "ferp58o",
                "Author": "1YearWonder",
                "Date Created": "01-18-2020 08:12:28",
                "Upvotes": 9,
                "Text": "Yeah, my family still congratulates me on any weight loss, and encourages me to keep \"being more healthy\". \n\nThey have no idea.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fevuzmb": [
                {
                    "Parent ID": "t1_ferp58o",
                    "Comment ID": "fevuzmb",
                    "Author": "BoundKitten",
                    "Date Created": "01-18-2020 20:44:15",
                    "Upvotes": 2,
                    "Text": "Yeah, my parents are fully aware that anorexia almost killed me but my mom has been actively cheering my weight loss since my relapse. 🙃",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "fesqgwp": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "fesqgwp",
                "Author": "sadsadmegan",
                "Date Created": "01-18-2020 11:19:12",
                "Upvotes": 2,
                "Text": "Big mood - my mum is an even bigger mess than I am so I dont say shit to her and my dad has a chin attitude to my depression so he knows nothing about my ED\n\nMy other half has me make a referral for treatment and is incredibly supportive luckily though",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "feul5q0": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "feul5q0",
                "Author": "the_real_blobfish",
                "Date Created": "01-18-2020 16:46:46",
                "Upvotes": 1,
                "Text": "I haven’t (willingly) told my family anything about my ~feelings~ since I was about 8 🤘🤪\nIt’s not even like there’s a rational reason for me to be scared of telling them anything (actually no I take that back my parents didn’t react that well when they basically forced me to tell them about my anxiety issues last year) I’m just a really private person in real life but on the internet I will tell my life story to anyone who will listen lmao",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "few9gk2": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "few9gk2",
                "Author": "SecretIdentity8594",
                "Date Created": "01-18-2020 22:12:18",
                "Upvotes": 1,
                "Text": "Omg same I can’t tell my family about any of my mental health problems.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "few9ze6": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "few9ze6",
                "Author": "notsoskinny_legend",
                "Date Created": "01-18-2020 22:15:57",
                "Upvotes": 1,
                "Text": "My ED didn't develop until I was already not living at home, but my family can be so cavalier with their comments about food/weight/exercise and it's so frustrating because they ALL know how bad it was — not all EDs result in someone being underweight but mine did at the time so they literally SAW how bad it was. I love them, but I can't imagine living at home with them as a teenager and dealing with that. I'm sorry you're going through this!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ff4cyno": [
        [
            {
                "Parent ID": "t3_eqebg4",
                "Comment ID": "ff4cyno",
                "Author": "PoorLama",
                "Date Created": "01-20-2020 16:51:23",
                "Upvotes": 1,
                "Text": "Yeah, this is me as well.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}