{
    "fhbgx77": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhbgx77",
                "Author": "whewchiletheghettooo",
                "Date Created": "02-11-2020 11:27:44",
                "Upvotes": 53,
                "Text": "It really be like that that🙃",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhc6cmj": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhc6cmj",
                "Author": "MashAndBeans",
                "Date Created": "02-11-2020 15:38:21",
                "Upvotes": 38,
                "Text": "Lmaoooo. Do I like the way I look? Ofc not 🤡",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhc6hrp": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhc6hrp",
                "Author": "sarahjojones",
                "Date Created": "02-11-2020 15:39:43",
                "Upvotes": 31,
                "Text": "I was astonished to discover, the first time I managed to lose 20kg, that I was only capable of losing weight AFTER I was comfortable with my body.\n\nIt's one of the weirdest experiences.",
                "Edited?": "02-11-2020 17:48:19",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fhcoshl": [
                {
                    "Parent ID": "t1_fhc6hrp",
                    "Comment ID": "fhcoshl",
                    "Author": "whisperingtracetatum",
                    "Date Created": "02-11-2020 18:32:08",
                    "Upvotes": 7,
                    "Text": "can you elaborate on this?",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "fhcvkia": [
                        {
                            "Parent ID": "t1_fhcoshl",
                            "Comment ID": "fhcvkia",
                            "Author": "sarahjojones",
                            "Date Created": "02-11-2020 19:42:37",
                            "Upvotes": 28,
                            "Text": "I was fed mostly fat and sugar for my entire life, this made me fat, extremely uncomfortable with my body, developed dysmorphia and a binge eating disorder.\n\nEver since I can remember, I was obsessed with losing weight, being skinny so people wouldn't make fun of me and I could finally be beautiful, hot and desirable.\n\nEventually I developed a pretty unhealthy relationship with food, I would binge and starve for years, I felt so guilty and ashamed by this.\n\nBy the time I was 19, I developed IBS, it hit hard on me, that health would not join me into my ED journey.\n\nI tried to eat healthily a million times, only to find myself binge eating again after a few days or even hours.\n\nI was so depressed, I just gave up, and it was right in that moment where I understood  things weren't going to change unless I did first.\n\nI started to force myself to be comfortable with my body, started taking nude pictures of myself, looked for fat and obese models and erotic actresses, being an artist, I took a lot of time drawing naked obese women from reference, basically getting comfortable around the idea of being fat.\n\nIt was only then, when I was at peace with being fat, that I had enough mental clarity to actually take steps further and re-educate myself about my relationship with food and self image.\n\nIt has a lot to do with anxiety, you feel the need of fixing things ASAP when these things actually take a lot of time to heal.  Anxiety prevents you of giving yourself time, it forces you into feeling guilty which aggravates the ED.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fhdek76": [
                [
                    {
                        "Parent ID": "t1_fhcvkia",
                        "Comment ID": "fhdek76",
                        "Author": "whisperingtracetatum",
                        "Date Created": "02-11-2020 23:06:34",
                        "Upvotes": 5,
                        "Text": "thank you so much for answering. that was fascinating to listen to and I really really appreciated hearing what you had to say. I really hope I can follow your footsteps and I am beyond happy for you. you must be so proud and strong.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fhdnckj": [
                        {
                            "Parent ID": "t1_fhdek76",
                            "Comment ID": "fhdnckj",
                            "Author": "sarahjojones",
                            "Date Created": "02-12-2020 01:29:18",
                            "Upvotes": 3,
                            "Text": "No problem.\n\nMy footsteps were mine to make, I'm sure everybodies journey is diffeerent!\n\nI forgot to mention this is basically interalized fatphobia. The looking at fat ladies part helped because I didn't saw obese women, or just fat like me, as ugly. I realized that I hated my body no matter what weight I was, that the same fat didn't seem to bother me if it was on other people, I even find it sexy!!\n\nThere's never specific steps you can take towards thar click moment, in the end, sometimes it's triggered by the stupidest things. For me a wake up call was seeing a twitter account that was from a girl with dysmorphia. She was so thin and pretty, got complimented all day long, yet she felt the need of bashing herself every day, calling herself fat and using fat as a shaming word.\n\nI found it utterly unhealthy and it seemed like she was struggling a lot. I then realized, I am just like that, minus the twitter account. I felt so embarassed for being like that, I didn't dare fat shame myself again haha",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fhdprk1": [
                [
                    {
                        "Parent ID": "t1_fhdnckj",
                        "Comment ID": "fhdprk1",
                        "Author": "whisperingtracetatum",
                        "Date Created": "02-12-2020 02:19:43",
                        "Upvotes": 2,
                        "Text": "so you began to love yourself? were your problems with eating every borderlining self- harm/sabotage? if you don't mind to answer",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fhds1xx": [
                        {
                            "Parent ID": "t1_fhdprk1",
                            "Comment ID": "fhds1xx",
                            "Author": "sarahjojones",
                            "Date Created": "02-12-2020 03:12:13",
                            "Upvotes": 3,
                            "Text": "I love myself but I don't love my body. I was close once, but things happened in my life (ex was obsessed with other girl) and the compulsive comparing myself with other women and self sabotage began again.\n\nA year has passed and in that process I just went back to binging, which is, essentially sabotage. I gained 10kg back without even realizing it, it was wrecking my mental health and ruining sexual relationships for me. I can't stand being naked in front of sexual partners without great shame.\n\nBut it's a journey, if I was doing well I wouldn't be in this sub, anyways.\nI'm trying to get these feelings out, which is a lot easier on reddit with strangers, than pouring my heart out to my loved ones (again).\n\nI think I will take erotica pictures this time, instead of just nudes. Nude pictures helped me see myself as a person, to give my body visibility, I just gazed at them and realized my body was normal, not deformed. The erotica part will help me sexualize myself again, when I feel bad about my body, I feel unatractive, and it cripples my confidence with everything else in my life. I hope seeing myself as a desirable sex object will improve my self esteem.\n\nAlso started going to therapy and this alone skyrocketted my well being.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fhfyvy5": [
                [
                    {
                        "Parent ID": "t1_fhds1xx",
                        "Comment ID": "fhfyvy5",
                        "Author": "whisperingtracetatum",
                        "Date Created": "02-12-2020 18:43:25",
                        "Upvotes": 1,
                        "Text": "therapy skyrocketed it? or those practices did?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "fhcmwwy": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhcmwwy",
                "Author": "abstractelement",
                "Date Created": "02-11-2020 18:12:07",
                "Upvotes": 7,
                "Text": "😔 feels. So jelous of my lil sister, she eats 6 massive cookies in a day and can demolish a party sized packet of cheetos, half a pint of icecream and a family pack of fries in one sitting (not all together but like those things separtely on any given day) and she's a twig.",
                "Edited?": "02-11-2020 18:17:34",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhc2gs1": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhc2gs1",
                "Author": "kms_jpg",
                "Date Created": "02-11-2020 15:01:05",
                "Upvotes": 5,
                "Text": "Oh mood!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhcd7hb": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhcd7hb",
                "Author": "virgotaurus",
                "Date Created": "02-11-2020 16:42:42",
                "Upvotes": 7,
                "Text": "Same! Thanks, bulimia!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhcd4sd": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhcd4sd",
                "Author": "princesa-okay",
                "Date Created": "02-11-2020 16:42:06",
                "Upvotes": 3,
                "Text": "🤣🤣literally",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhclr25": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhclr25",
                "Author": "helloaveragejoe",
                "Date Created": "02-11-2020 17:59:41",
                "Upvotes": 3,
                "Text": "Welcome to the Nope train, leaving for Nope city 🚂",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhdeehz": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhdeehz",
                "Author": "brisoI",
                "Date Created": "02-11-2020 23:04:30",
                "Upvotes": 3,
                "Text": "im in this post and i don’t like it",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhcq080": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhcq080",
                "Author": "GlitterVega",
                "Date Created": "02-11-2020 18:45:09",
                "Upvotes": 2,
                "Text": "Relatable AF",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhctg84": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhctg84",
                "Author": "ilivetomosh",
                "Date Created": "02-11-2020 19:21:17",
                "Upvotes": 2,
                "Text": "Tbfh",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhcw21e": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhcw21e",
                "Author": "OrphanDevour",
                "Date Created": "02-11-2020 19:47:37",
                "Upvotes": 2,
                "Text": "The real q's",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fhdfxgh": [
        [
            {
                "Parent ID": "t3_f2bkew",
                "Comment ID": "fhdfxgh",
                "Author": "throwawaybtwway",
                "Date Created": "02-11-2020 23:25:12",
                "Upvotes": 2,
                "Text": "I wish I had a good relationship with food. My mother was extremely anorexic and she never allowed me to have any junk food. I was 16 the first time I had Mc Donalds but it didn’t give me a healthy relationship with food. Now I just binge eat whatever is in sight because I’m never sure (psychologically) if I’m going to get junk food again",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}