{
    "ffyzwxx": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffyzwxx",
                "Author": "vanillavomit",
                "Date Created": "01-29-2020 22:46:28",
                "Upvotes": 111,
                "Text": "also please don't purge!! please. if you've never purged it's your reminder to never start. if you do purge (i'm guilty of it too) please try to stop or at least learn some harm reduction tips. i believe in you <3",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ffz0bvi": [
                {
                    "Parent ID": "t1_ffyzwxx",
                    "Comment ID": "ffz0bvi",
                    "Author": "fluentsyntax",
                    "Date Created": "01-29-2020 22:52:10",
                    "Upvotes": 57,
                    "Text": "okay but your username got me to laugh",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ffze80b": [
                        {
                            "Parent ID": "t1_ffz0bvi",
                            "Comment ID": "ffze80b",
                            "Author": "vanillavomit",
                            "Date Created": "01-30-2020 02:56:46",
                            "Upvotes": 36,
                            "Text": "i just realised how fucking ironic it is next to my comment. not sorry though",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffz4fhl": [
                [
                    {
                        "Parent ID": "t1_ffz3pdg",
                        "Comment ID": "ffz4fhl",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-29-2020 23:53:44",
                        "Upvotes": 3,
                        "Text": "If I didn’t have retinol on right now I’d be letting myself cry (water messes it up... and it’s too cold outside my room to wash my face after so I can reapply 😂 😭 ❤️)This is such a kind message, thank you so, so much for your response. I’d been feeling really down and oversensitive and cranky and overthinking everything and I didn’t understand why... I even convinced myself people I love don’t love me as much anymore somehow. I hate that food has this power and I hate that *I* am the one who let myself become like this. Thank you so much for the tips, I’m going to the grocery store tomorrow and I’m going to just buy tons and tons of veggies!! Do you have any recommendations for sauces/dressings or salad toppings? :D I usually have pretty plain salads if I’m being honest. And thank you for including a shower as a nice thing for yourself. I know it sounds like something so simple that a lot of people do every day, but when it gets like this even finding the motivation to take care of myself like that slips away. I can’t thank you enough, and I’m here for you too! (that goes for all of you in this! We can make it through this)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffz6cdt": [
                        {
                            "Parent ID": "t1_ffz4fhl",
                            "Comment ID": "ffz6cdt",
                            "Author": "oceanlover__",
                            "Date Created": "01-30-2020 00:23:00",
                            "Upvotes": 5,
                            "Text": "Ahhhh you're so welcome!! I feel like anyone who struggles with food is a kindred spirit...we all just \"get\" it, you know? It's so isolating and mentally tormenting to constantly be picking apart your body and the way people view you and analyzing what you put in your body versus how much you weigh, etc. My boyfriend of 2 years recently broke up with me so I also relate to not feeling like people love you as much anymore. But you know what? Now is the time you have to love yourself enough to go the extra mile and invest some time in making yourself feel good!! So yes, shower, lotion, face masks, candles, dim lights, Netflix, cozy blankets, movie nights, do all the nice things for yourself! Part of why we binge is because we feel empty inside, so try filling yourself up in other ways. Of course still eat and nourish your body but just be mindful of how you feel before you eat. And for the veggies, do you have access to an oven? I really love roasting up a bunch of cauliflower. I chop it first from the head into smaller chunks and put it on a baking sheet with some salt. If you've ever used nutritional yeast it's a topping they usually have in the spice section and it has a very cheesy flavor but only 20 calories per tablespoon and it's a probiotic with B12, too! I love seasoning with that. I like to dip the cauliflower in ketchup (maybe too weird, idk haha). I also love to steam a bunch of chopped carrots with sea salt on them and eat big bowls of those, but if you don't have a steamer you can either put the chopped carrots in a pan with about 0.5 inches water on the highest stove setting or put the carrots in a microwavable bowl for about 5 min in the microwave with the same amount of water in the bowl. Edamame is also super good if you get the steam able bag kind and it's usually 130 calories for a huge bag of it that you steam in the microwave for 5 min. Lastly I get cauliflower rice from the frozen aisle, microwave it for 5 min in the bag, and season it with nutritional yeast and everything but the bagel seasoning! I usually make an egg white omelet with turkey to put on top of the cauliflower rice (1 egg, 3 egg whites, a slice of turkey, green onion if you want) and a tablespoon of hummus on top. It's incredibly high volume and filling. If you're in the mood for something sweet, chopping an apple and seasoning it with cinnamon and baking it in the oven for 15 min at 425 degrees is EXCELLENT, or you can microwave frozen fruit for a couple minutes to have a pie-like dessert. Sending you so much love!",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzczbk": [
                [
                    {
                        "Parent ID": "t1_ffz7y91",
                        "Comment ID": "ffzczbk",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:27:37",
                        "Upvotes": 2,
                        "Text": "Sending you lots of positivity too 😭 ❤️ Do you see any improvements with the jade roller? I had one before, but I was really clumsy with my routine and was using it poorly so I broke out 😂 I wanted to use it to massage my face and hopefully do something about the.. “youthful plumpness” of my cheeks 🤣 I’ve been so desperate for them to slim down at some point that I’ve even tried using rice paddles to massage them LOL.. Your routine sounds great btw!! I love dry brushing, I’m going to be consistent about it like you have been too.. Thank you for this support!!! We can get through this 🤗 ❤️ (also my weakness is stick cheese mozzarella..like the one for school lunches 😂 its so sponge-like and also stringy I cant get enough of it!)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg00g11": [
                        {
                            "Parent ID": "t1_ffzczbk",
                            "Comment ID": "fg00g11",
                            "Author": "itsapplered",
                            "Date Created": "01-30-2020 09:17:14",
                            "Upvotes": 2,
                            "Text": "I've just started using the roller consistently this week. I wake up early and have super full days, so its a great motivator to get out of bed and get ready, since it FEELS amazing! I keep it in the freezer and clean it with alcohol (just in case?) before using. I moisturize then roll it on. While I have my coffee. Its the little things that keep me pushing, thats why I have so much self care shit.. just trying to stay consistent on a good path. I have so many weaknesses.. lets just try giving in here and there as treats. Have a most wonderful day <3",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzah7c": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzah7c",
                        "Author": "oceanlover__",
                        "Date Created": "01-30-2020 01:33:22",
                        "Upvotes": 4,
                        "Text": "Based on his history his GF has an ED and he's lurking on here. Kinda creepy tbh!",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzmf4z": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzmf4z",
                        "Author": "joshuasfreedom",
                        "Date Created": "01-30-2020 06:04:42",
                        "Upvotes": -3,
                        "Text": "Harm reduction needs to actually recudce harm, not make harming yourself easier. Isn't this the reason proED is gone?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffzx0pz": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "ffzx0pz",
                            "Author": "TealNTurquoise",
                            "Date Created": "01-30-2020 08:38:01",
                            "Upvotes": 3,
                            "Text": "Discussing how to make oneself more comfortable after something goes wrong isn't giving fucking tips, you douchebag.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fg0d7ey": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "fg0d7ey",
                            "Author": "yellowposy2",
                            "Date Created": "01-30-2020 11:28:50",
                            "Upvotes": 1,
                            "Text": "I think you’re misunderstanding this post- it gives advice for what to do AFTER you’ve already harmed yourself, which is exactly what many harm reduction tips aim to do. Many people who binge respond to a binge with eating even more- which is certainly more harmful than following these tips. I don’t think this subreddit is meant for you. I noticed you mentioned your girlfriend’s eating disorder in your post history. Maybe r/EatingDisorderHope would be a better fit for you to seek support. We don’t need anyone bringing us down here; I’m sure you can understand that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fg06j0j": [
                [
                    {
                        "Parent ID": "t1_ffze80b",
                        "Comment ID": "fg06j0j",
                        "Author": "ColesEyebrows",
                        "Date Created": "01-30-2020 10:21:36",
                        "Upvotes": 10,
                        "Text": "I think it works well as a double warning causw purging sweet foods is just boke.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzdczf": [
                [
                    {
                        "Parent ID": "t1_ffz6cdt",
                        "Comment ID": "ffzdczf",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:36:31",
                        "Upvotes": 2,
                        "Text": "I’ve officially added nutritional yeast to my shopping list because of you and I haven’t been this excited for buying yeast like... ever!! 😭 ❤️ I love cauliflower and edamame and carrots so I’m definitely going to try out all of these recipes! Thank you so much for sharing and including the calories too 😢 💜 I really do agree about feeling kinship when you know someone knows what this hell is like. I tried for so long to tell myself that it wasn’t actually happening to me and that I had it all under control. I was just passionate and driven about these goals I couldn’t even admit were unhealthy and unrealistic. But now I can admit it, and it’s hard, but I believe we can all one day break free of this and so I hope you will find a day where you never have to think about it again. Thank you from the bottom of my heart for taking the time to write responses to me about this. It felt really good to talk about it 🤗 And I’m sorry about the break up, but I’m glad that you sound like you’re back on your feet and you’ll have many more happier days ahead! 💜",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ffz3l22": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffz3l22",
                "Author": "MyFaceSlowPace",
                "Date Created": "01-29-2020 23:40:17",
                "Upvotes": 22,
                "Text": "Thank you for making this post. I didn’t realize I had fallen into another binge cycle until I was dead center in the worst of it. It hurts, so, so bad. I’m gonna go on a little rant, but I’m having trouble sleeping because of it. I have low motivation too. I don’t know if it was breaking my fast that made me fall into this huge binge or my period coming soon but I think it was. I feel like when I’m fasting it’s easier to manage my emotions and be happier. Every time I’ve felt depressed like right now, I had been binging. I know this is also bullshit, it’s just the ED talking and saying I’m happier when I have that level of control. I just want to get out of this rut. I’m hoping cleaning the space around me and a new skincare routine will help get me in gear for getting back to where I should and want to be. I ate so much cheese today it should be illegal...",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ffz3pdg": [
                {
                    "Parent ID": "t1_ffz3l22",
                    "Comment ID": "ffz3pdg",
                    "Author": "oceanlover__",
                    "Date Created": "01-29-2020 23:42:06",
                    "Upvotes": 10,
                    "Text": "Hey this is exactly what happened to me. I totally understand fasting to feel happier, too. Honestly what just got me out of my binge cycle was making sure I drank enough water, had enough protein, and allowing myself unlimited veggies to \"binge\" on. It's not easy but try and do nice things for yourself like shower or watch a new TV show to distract yourself. You're not alone!",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "ffz4fhl": [
                        {
                            "Parent ID": "t1_ffz3pdg",
                            "Comment ID": "ffz4fhl",
                            "Author": "MyFaceSlowPace",
                            "Date Created": "01-29-2020 23:53:44",
                            "Upvotes": 3,
                            "Text": "If I didn’t have retinol on right now I’d be letting myself cry (water messes it up... and it’s too cold outside my room to wash my face after so I can reapply 😂 😭 ❤️)This is such a kind message, thank you so, so much for your response. I’d been feeling really down and oversensitive and cranky and overthinking everything and I didn’t understand why... I even convinced myself people I love don’t love me as much anymore somehow. I hate that food has this power and I hate that *I* am the one who let myself become like this. Thank you so much for the tips, I’m going to the grocery store tomorrow and I’m going to just buy tons and tons of veggies!! Do you have any recommendations for sauces/dressings or salad toppings? :D I usually have pretty plain salads if I’m being honest. And thank you for including a shower as a nice thing for yourself. I know it sounds like something so simple that a lot of people do every day, but when it gets like this even finding the motivation to take care of myself like that slips away. I can’t thank you enough, and I’m here for you too! (that goes for all of you in this! We can make it through this)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffze80b": [
                [
                    {
                        "Parent ID": "t1_ffz0bvi",
                        "Comment ID": "ffze80b",
                        "Author": "vanillavomit",
                        "Date Created": "01-30-2020 02:56:46",
                        "Upvotes": 36,
                        "Text": "i just realised how fucking ironic it is next to my comment. not sorry though",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg06j0j": [
                        {
                            "Parent ID": "t1_ffze80b",
                            "Comment ID": "fg06j0j",
                            "Author": "ColesEyebrows",
                            "Date Created": "01-30-2020 10:21:36",
                            "Upvotes": 10,
                            "Text": "I think it works well as a double warning causw purging sweet foods is just boke.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzczbk": [
                [
                    {
                        "Parent ID": "t1_ffz7y91",
                        "Comment ID": "ffzczbk",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:27:37",
                        "Upvotes": 2,
                        "Text": "Sending you lots of positivity too 😭 ❤️ Do you see any improvements with the jade roller? I had one before, but I was really clumsy with my routine and was using it poorly so I broke out 😂 I wanted to use it to massage my face and hopefully do something about the.. “youthful plumpness” of my cheeks 🤣 I’ve been so desperate for them to slim down at some point that I’ve even tried using rice paddles to massage them LOL.. Your routine sounds great btw!! I love dry brushing, I’m going to be consistent about it like you have been too.. Thank you for this support!!! We can get through this 🤗 ❤️ (also my weakness is stick cheese mozzarella..like the one for school lunches 😂 its so sponge-like and also stringy I cant get enough of it!)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg00g11": [
                        {
                            "Parent ID": "t1_ffzczbk",
                            "Comment ID": "fg00g11",
                            "Author": "itsapplered",
                            "Date Created": "01-30-2020 09:17:14",
                            "Upvotes": 2,
                            "Text": "I've just started using the roller consistently this week. I wake up early and have super full days, so its a great motivator to get out of bed and get ready, since it FEELS amazing! I keep it in the freezer and clean it with alcohol (just in case?) before using. I moisturize then roll it on. While I have my coffee. Its the little things that keep me pushing, thats why I have so much self care shit.. just trying to stay consistent on a good path. I have so many weaknesses.. lets just try giving in here and there as treats. Have a most wonderful day <3",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzah7c": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzah7c",
                        "Author": "oceanlover__",
                        "Date Created": "01-30-2020 01:33:22",
                        "Upvotes": 4,
                        "Text": "Based on his history his GF has an ED and he's lurking on here. Kinda creepy tbh!",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzmf4z": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzmf4z",
                        "Author": "joshuasfreedom",
                        "Date Created": "01-30-2020 06:04:42",
                        "Upvotes": -3,
                        "Text": "Harm reduction needs to actually recudce harm, not make harming yourself easier. Isn't this the reason proED is gone?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffzx0pz": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "ffzx0pz",
                            "Author": "TealNTurquoise",
                            "Date Created": "01-30-2020 08:38:01",
                            "Upvotes": 3,
                            "Text": "Discussing how to make oneself more comfortable after something goes wrong isn't giving fucking tips, you douchebag.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fg0d7ey": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "fg0d7ey",
                            "Author": "yellowposy2",
                            "Date Created": "01-30-2020 11:28:50",
                            "Upvotes": 1,
                            "Text": "I think you’re misunderstanding this post- it gives advice for what to do AFTER you’ve already harmed yourself, which is exactly what many harm reduction tips aim to do. Many people who binge respond to a binge with eating even more- which is certainly more harmful than following these tips. I don’t think this subreddit is meant for you. I noticed you mentioned your girlfriend’s eating disorder in your post history. Maybe r/EatingDisorderHope would be a better fit for you to seek support. We don’t need anyone bringing us down here; I’m sure you can understand that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffz6cdt": [
                [
                    {
                        "Parent ID": "t1_ffz4fhl",
                        "Comment ID": "ffz6cdt",
                        "Author": "oceanlover__",
                        "Date Created": "01-30-2020 00:23:00",
                        "Upvotes": 5,
                        "Text": "Ahhhh you're so welcome!! I feel like anyone who struggles with food is a kindred spirit...we all just \"get\" it, you know? It's so isolating and mentally tormenting to constantly be picking apart your body and the way people view you and analyzing what you put in your body versus how much you weigh, etc. My boyfriend of 2 years recently broke up with me so I also relate to not feeling like people love you as much anymore. But you know what? Now is the time you have to love yourself enough to go the extra mile and invest some time in making yourself feel good!! So yes, shower, lotion, face masks, candles, dim lights, Netflix, cozy blankets, movie nights, do all the nice things for yourself! Part of why we binge is because we feel empty inside, so try filling yourself up in other ways. Of course still eat and nourish your body but just be mindful of how you feel before you eat. And for the veggies, do you have access to an oven? I really love roasting up a bunch of cauliflower. I chop it first from the head into smaller chunks and put it on a baking sheet with some salt. If you've ever used nutritional yeast it's a topping they usually have in the spice section and it has a very cheesy flavor but only 20 calories per tablespoon and it's a probiotic with B12, too! I love seasoning with that. I like to dip the cauliflower in ketchup (maybe too weird, idk haha). I also love to steam a bunch of chopped carrots with sea salt on them and eat big bowls of those, but if you don't have a steamer you can either put the chopped carrots in a pan with about 0.5 inches water on the highest stove setting or put the carrots in a microwavable bowl for about 5 min in the microwave with the same amount of water in the bowl. Edamame is also super good if you get the steam able bag kind and it's usually 130 calories for a huge bag of it that you steam in the microwave for 5 min. Lastly I get cauliflower rice from the frozen aisle, microwave it for 5 min in the bag, and season it with nutritional yeast and everything but the bagel seasoning! I usually make an egg white omelet with turkey to put on top of the cauliflower rice (1 egg, 3 egg whites, a slice of turkey, green onion if you want) and a tablespoon of hummus on top. It's incredibly high volume and filling. If you're in the mood for something sweet, chopping an apple and seasoning it with cinnamon and baking it in the oven for 15 min at 425 degrees is EXCELLENT, or you can microwave frozen fruit for a couple minutes to have a pie-like dessert. Sending you so much love!",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "ffzdczf": [
                        {
                            "Parent ID": "t1_ffz6cdt",
                            "Comment ID": "ffzdczf",
                            "Author": "MyFaceSlowPace",
                            "Date Created": "01-30-2020 02:36:31",
                            "Upvotes": 2,
                            "Text": "I’ve officially added nutritional yeast to my shopping list because of you and I haven’t been this excited for buying yeast like... ever!! 😭 ❤️ I love cauliflower and edamame and carrots so I’m definitely going to try out all of these recipes! Thank you so much for sharing and including the calories too 😢 💜 I really do agree about feeling kinship when you know someone knows what this hell is like. I tried for so long to tell myself that it wasn’t actually happening to me and that I had it all under control. I was just passionate and driven about these goals I couldn’t even admit were unhealthy and unrealistic. But now I can admit it, and it’s hard, but I believe we can all one day break free of this and so I hope you will find a day where you never have to think about it again. Thank you from the bottom of my heart for taking the time to write responses to me about this. It felt really good to talk about it 🤗 And I’m sorry about the break up, but I’m glad that you sound like you’re back on your feet and you’ll have many more happier days ahead! 💜",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ffz7y91": [
                {
                    "Parent ID": "t1_ffz3l22",
                    "Comment ID": "ffz7y91",
                    "Author": "itsapplered",
                    "Date Created": "01-30-2020 00:46:32",
                    "Upvotes": 2,
                    "Text": "Focusing on hydrating and my self care routine is helping me get out of my cycle. jade face roller in the morning, new eye cream, maintain the skincare routine, dry brushing pre-shower, face mask every other day.. I do believe I can get past this cycle and that its worth it, and same to you!! sending positive vibes! at the same time, would kill to have a hunk of quality white cheddar.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ffzczbk": [
                        {
                            "Parent ID": "t1_ffz7y91",
                            "Comment ID": "ffzczbk",
                            "Author": "MyFaceSlowPace",
                            "Date Created": "01-30-2020 02:27:37",
                            "Upvotes": 2,
                            "Text": "Sending you lots of positivity too 😭 ❤️ Do you see any improvements with the jade roller? I had one before, but I was really clumsy with my routine and was using it poorly so I broke out 😂 I wanted to use it to massage my face and hopefully do something about the.. “youthful plumpness” of my cheeks 🤣 I’ve been so desperate for them to slim down at some point that I’ve even tried using rice paddles to massage them LOL.. Your routine sounds great btw!! I love dry brushing, I’m going to be consistent about it like you have been too.. Thank you for this support!!! We can get through this 🤗 ❤️ (also my weakness is stick cheese mozzarella..like the one for school lunches 😂 its so sponge-like and also stringy I cant get enough of it!)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffze80b": [
                [
                    {
                        "Parent ID": "t1_ffz0bvi",
                        "Comment ID": "ffze80b",
                        "Author": "vanillavomit",
                        "Date Created": "01-30-2020 02:56:46",
                        "Upvotes": 36,
                        "Text": "i just realised how fucking ironic it is next to my comment. not sorry though",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg06j0j": [
                        {
                            "Parent ID": "t1_ffze80b",
                            "Comment ID": "fg06j0j",
                            "Author": "ColesEyebrows",
                            "Date Created": "01-30-2020 10:21:36",
                            "Upvotes": 10,
                            "Text": "I think it works well as a double warning causw purging sweet foods is just boke.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffz4fhl": [
                [
                    {
                        "Parent ID": "t1_ffz3pdg",
                        "Comment ID": "ffz4fhl",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-29-2020 23:53:44",
                        "Upvotes": 3,
                        "Text": "If I didn’t have retinol on right now I’d be letting myself cry (water messes it up... and it’s too cold outside my room to wash my face after so I can reapply 😂 😭 ❤️)This is such a kind message, thank you so, so much for your response. I’d been feeling really down and oversensitive and cranky and overthinking everything and I didn’t understand why... I even convinced myself people I love don’t love me as much anymore somehow. I hate that food has this power and I hate that *I* am the one who let myself become like this. Thank you so much for the tips, I’m going to the grocery store tomorrow and I’m going to just buy tons and tons of veggies!! Do you have any recommendations for sauces/dressings or salad toppings? :D I usually have pretty plain salads if I’m being honest. And thank you for including a shower as a nice thing for yourself. I know it sounds like something so simple that a lot of people do every day, but when it gets like this even finding the motivation to take care of myself like that slips away. I can’t thank you enough, and I’m here for you too! (that goes for all of you in this! We can make it through this)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffz6cdt": [
                        {
                            "Parent ID": "t1_ffz4fhl",
                            "Comment ID": "ffz6cdt",
                            "Author": "oceanlover__",
                            "Date Created": "01-30-2020 00:23:00",
                            "Upvotes": 5,
                            "Text": "Ahhhh you're so welcome!! I feel like anyone who struggles with food is a kindred spirit...we all just \"get\" it, you know? It's so isolating and mentally tormenting to constantly be picking apart your body and the way people view you and analyzing what you put in your body versus how much you weigh, etc. My boyfriend of 2 years recently broke up with me so I also relate to not feeling like people love you as much anymore. But you know what? Now is the time you have to love yourself enough to go the extra mile and invest some time in making yourself feel good!! So yes, shower, lotion, face masks, candles, dim lights, Netflix, cozy blankets, movie nights, do all the nice things for yourself! Part of why we binge is because we feel empty inside, so try filling yourself up in other ways. Of course still eat and nourish your body but just be mindful of how you feel before you eat. And for the veggies, do you have access to an oven? I really love roasting up a bunch of cauliflower. I chop it first from the head into smaller chunks and put it on a baking sheet with some salt. If you've ever used nutritional yeast it's a topping they usually have in the spice section and it has a very cheesy flavor but only 20 calories per tablespoon and it's a probiotic with B12, too! I love seasoning with that. I like to dip the cauliflower in ketchup (maybe too weird, idk haha). I also love to steam a bunch of chopped carrots with sea salt on them and eat big bowls of those, but if you don't have a steamer you can either put the chopped carrots in a pan with about 0.5 inches water on the highest stove setting or put the carrots in a microwavable bowl for about 5 min in the microwave with the same amount of water in the bowl. Edamame is also super good if you get the steam able bag kind and it's usually 130 calories for a huge bag of it that you steam in the microwave for 5 min. Lastly I get cauliflower rice from the frozen aisle, microwave it for 5 min in the bag, and season it with nutritional yeast and everything but the bagel seasoning! I usually make an egg white omelet with turkey to put on top of the cauliflower rice (1 egg, 3 egg whites, a slice of turkey, green onion if you want) and a tablespoon of hummus on top. It's incredibly high volume and filling. If you're in the mood for something sweet, chopping an apple and seasoning it with cinnamon and baking it in the oven for 15 min at 425 degrees is EXCELLENT, or you can microwave frozen fruit for a couple minutes to have a pie-like dessert. Sending you so much love!",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzah7c": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzah7c",
                        "Author": "oceanlover__",
                        "Date Created": "01-30-2020 01:33:22",
                        "Upvotes": 4,
                        "Text": "Based on his history his GF has an ED and he's lurking on here. Kinda creepy tbh!",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzmf4z": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzmf4z",
                        "Author": "joshuasfreedom",
                        "Date Created": "01-30-2020 06:04:42",
                        "Upvotes": -3,
                        "Text": "Harm reduction needs to actually recudce harm, not make harming yourself easier. Isn't this the reason proED is gone?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffzx0pz": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "ffzx0pz",
                            "Author": "TealNTurquoise",
                            "Date Created": "01-30-2020 08:38:01",
                            "Upvotes": 3,
                            "Text": "Discussing how to make oneself more comfortable after something goes wrong isn't giving fucking tips, you douchebag.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fg0d7ey": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "fg0d7ey",
                            "Author": "yellowposy2",
                            "Date Created": "01-30-2020 11:28:50",
                            "Upvotes": 1,
                            "Text": "I think you’re misunderstanding this post- it gives advice for what to do AFTER you’ve already harmed yourself, which is exactly what many harm reduction tips aim to do. Many people who binge respond to a binge with eating even more- which is certainly more harmful than following these tips. I don’t think this subreddit is meant for you. I noticed you mentioned your girlfriend’s eating disorder in your post history. Maybe r/EatingDisorderHope would be a better fit for you to seek support. We don’t need anyone bringing us down here; I’m sure you can understand that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fg00g11": [
                [
                    {
                        "Parent ID": "t1_ffzczbk",
                        "Comment ID": "fg00g11",
                        "Author": "itsapplered",
                        "Date Created": "01-30-2020 09:17:14",
                        "Upvotes": 2,
                        "Text": "I've just started using the roller consistently this week. I wake up early and have super full days, so its a great motivator to get out of bed and get ready, since it FEELS amazing! I keep it in the freezer and clean it with alcohol (just in case?) before using. I moisturize then roll it on. While I have my coffee. Its the little things that keep me pushing, thats why I have so much self care shit.. just trying to stay consistent on a good path. I have so many weaknesses.. lets just try giving in here and there as treats. Have a most wonderful day <3",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzdczf": [
                [
                    {
                        "Parent ID": "t1_ffz6cdt",
                        "Comment ID": "ffzdczf",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:36:31",
                        "Upvotes": 2,
                        "Text": "I’ve officially added nutritional yeast to my shopping list because of you and I haven’t been this excited for buying yeast like... ever!! 😭 ❤️ I love cauliflower and edamame and carrots so I’m definitely going to try out all of these recipes! Thank you so much for sharing and including the calories too 😢 💜 I really do agree about feeling kinship when you know someone knows what this hell is like. I tried for so long to tell myself that it wasn’t actually happening to me and that I had it all under control. I was just passionate and driven about these goals I couldn’t even admit were unhealthy and unrealistic. But now I can admit it, and it’s hard, but I believe we can all one day break free of this and so I hope you will find a day where you never have to think about it again. Thank you from the bottom of my heart for taking the time to write responses to me about this. It felt really good to talk about it 🤗 And I’m sorry about the break up, but I’m glad that you sound like you’re back on your feet and you’ll have many more happier days ahead! 💜",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ffz6ksv": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffz6ksv",
                "Author": "Entemma",
                "Date Created": "01-30-2020 00:26:17",
                "Upvotes": 15,
                "Text": "Nice. This is the type of harm reduction we really need on this sub!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffysyfa": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffysyfa",
                "Author": "almondmilkluvr",
                "Date Created": "01-29-2020 21:19:21",
                "Upvotes": 9,
                "Text": "thank you <3 of course i “know” all of these but it’s so easy to get into a totally irrational headspace. it’s nice to be reminded that it’s not as bad as it seems",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffywpc4": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffywpc4",
                "Author": "sidrose1",
                "Date Created": "01-29-2020 22:04:06",
                "Upvotes": 9,
                "Text": "good timing. thank u <3",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffz2orm": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffz2orm",
                "Author": "sadness_throwaway_",
                "Date Created": "01-29-2020 23:26:42",
                "Upvotes": 7,
                "Text": "Thank you <3 I started binging again a few days ago and I feel like crap, I needed to hear this",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffyvm2o": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffyvm2o",
                "Author": "thowaway764478",
                "Date Created": "01-29-2020 21:51:01",
                "Upvotes": 6,
                "Text": "Needed this.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffz4z0u": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffz4z0u",
                "Author": "princessily",
                "Date Created": "01-30-2020 00:02:33",
                "Upvotes": 8,
                "Text": "Thank you kind soul, i’m gonna do everything in my power to not purge today. I’m feeling confident, maybe I can go 2 days? I’ll try",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ffz5gk3": [
                {
                    "Parent ID": "t1_ffz4z0u",
                    "Comment ID": "ffz5gk3",
                    "Author": "oceanlover__",
                    "Date Created": "01-30-2020 00:10:42",
                    "Upvotes": 3,
                    "Text": "You can do it!! Come back to this post and comment or message me if you need support in the next few days <3 I spend a lot of time on here so I'll respond within a few hours!",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "ffze80b": [
                [
                    {
                        "Parent ID": "t1_ffz0bvi",
                        "Comment ID": "ffze80b",
                        "Author": "vanillavomit",
                        "Date Created": "01-30-2020 02:56:46",
                        "Upvotes": 36,
                        "Text": "i just realised how fucking ironic it is next to my comment. not sorry though",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg06j0j": [
                        {
                            "Parent ID": "t1_ffze80b",
                            "Comment ID": "fg06j0j",
                            "Author": "ColesEyebrows",
                            "Date Created": "01-30-2020 10:21:36",
                            "Upvotes": 10,
                            "Text": "I think it works well as a double warning causw purging sweet foods is just boke.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffz4fhl": [
                [
                    {
                        "Parent ID": "t1_ffz3pdg",
                        "Comment ID": "ffz4fhl",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-29-2020 23:53:44",
                        "Upvotes": 3,
                        "Text": "If I didn’t have retinol on right now I’d be letting myself cry (water messes it up... and it’s too cold outside my room to wash my face after so I can reapply 😂 😭 ❤️)This is such a kind message, thank you so, so much for your response. I’d been feeling really down and oversensitive and cranky and overthinking everything and I didn’t understand why... I even convinced myself people I love don’t love me as much anymore somehow. I hate that food has this power and I hate that *I* am the one who let myself become like this. Thank you so much for the tips, I’m going to the grocery store tomorrow and I’m going to just buy tons and tons of veggies!! Do you have any recommendations for sauces/dressings or salad toppings? :D I usually have pretty plain salads if I’m being honest. And thank you for including a shower as a nice thing for yourself. I know it sounds like something so simple that a lot of people do every day, but when it gets like this even finding the motivation to take care of myself like that slips away. I can’t thank you enough, and I’m here for you too! (that goes for all of you in this! We can make it through this)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffz6cdt": [
                        {
                            "Parent ID": "t1_ffz4fhl",
                            "Comment ID": "ffz6cdt",
                            "Author": "oceanlover__",
                            "Date Created": "01-30-2020 00:23:00",
                            "Upvotes": 5,
                            "Text": "Ahhhh you're so welcome!! I feel like anyone who struggles with food is a kindred spirit...we all just \"get\" it, you know? It's so isolating and mentally tormenting to constantly be picking apart your body and the way people view you and analyzing what you put in your body versus how much you weigh, etc. My boyfriend of 2 years recently broke up with me so I also relate to not feeling like people love you as much anymore. But you know what? Now is the time you have to love yourself enough to go the extra mile and invest some time in making yourself feel good!! So yes, shower, lotion, face masks, candles, dim lights, Netflix, cozy blankets, movie nights, do all the nice things for yourself! Part of why we binge is because we feel empty inside, so try filling yourself up in other ways. Of course still eat and nourish your body but just be mindful of how you feel before you eat. And for the veggies, do you have access to an oven? I really love roasting up a bunch of cauliflower. I chop it first from the head into smaller chunks and put it on a baking sheet with some salt. If you've ever used nutritional yeast it's a topping they usually have in the spice section and it has a very cheesy flavor but only 20 calories per tablespoon and it's a probiotic with B12, too! I love seasoning with that. I like to dip the cauliflower in ketchup (maybe too weird, idk haha). I also love to steam a bunch of chopped carrots with sea salt on them and eat big bowls of those, but if you don't have a steamer you can either put the chopped carrots in a pan with about 0.5 inches water on the highest stove setting or put the carrots in a microwavable bowl for about 5 min in the microwave with the same amount of water in the bowl. Edamame is also super good if you get the steam able bag kind and it's usually 130 calories for a huge bag of it that you steam in the microwave for 5 min. Lastly I get cauliflower rice from the frozen aisle, microwave it for 5 min in the bag, and season it with nutritional yeast and everything but the bagel seasoning! I usually make an egg white omelet with turkey to put on top of the cauliflower rice (1 egg, 3 egg whites, a slice of turkey, green onion if you want) and a tablespoon of hummus on top. It's incredibly high volume and filling. If you're in the mood for something sweet, chopping an apple and seasoning it with cinnamon and baking it in the oven for 15 min at 425 degrees is EXCELLENT, or you can microwave frozen fruit for a couple minutes to have a pie-like dessert. Sending you so much love!",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzczbk": [
                [
                    {
                        "Parent ID": "t1_ffz7y91",
                        "Comment ID": "ffzczbk",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:27:37",
                        "Upvotes": 2,
                        "Text": "Sending you lots of positivity too 😭 ❤️ Do you see any improvements with the jade roller? I had one before, but I was really clumsy with my routine and was using it poorly so I broke out 😂 I wanted to use it to massage my face and hopefully do something about the.. “youthful plumpness” of my cheeks 🤣 I’ve been so desperate for them to slim down at some point that I’ve even tried using rice paddles to massage them LOL.. Your routine sounds great btw!! I love dry brushing, I’m going to be consistent about it like you have been too.. Thank you for this support!!! We can get through this 🤗 ❤️ (also my weakness is stick cheese mozzarella..like the one for school lunches 😂 its so sponge-like and also stringy I cant get enough of it!)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg00g11": [
                        {
                            "Parent ID": "t1_ffzczbk",
                            "Comment ID": "fg00g11",
                            "Author": "itsapplered",
                            "Date Created": "01-30-2020 09:17:14",
                            "Upvotes": 2,
                            "Text": "I've just started using the roller consistently this week. I wake up early and have super full days, so its a great motivator to get out of bed and get ready, since it FEELS amazing! I keep it in the freezer and clean it with alcohol (just in case?) before using. I moisturize then roll it on. While I have my coffee. Its the little things that keep me pushing, thats why I have so much self care shit.. just trying to stay consistent on a good path. I have so many weaknesses.. lets just try giving in here and there as treats. Have a most wonderful day <3",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzah7c": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzah7c",
                        "Author": "oceanlover__",
                        "Date Created": "01-30-2020 01:33:22",
                        "Upvotes": 4,
                        "Text": "Based on his history his GF has an ED and he's lurking on here. Kinda creepy tbh!",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzmf4z": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzmf4z",
                        "Author": "joshuasfreedom",
                        "Date Created": "01-30-2020 06:04:42",
                        "Upvotes": -3,
                        "Text": "Harm reduction needs to actually recudce harm, not make harming yourself easier. Isn't this the reason proED is gone?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffzx0pz": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "ffzx0pz",
                            "Author": "TealNTurquoise",
                            "Date Created": "01-30-2020 08:38:01",
                            "Upvotes": 3,
                            "Text": "Discussing how to make oneself more comfortable after something goes wrong isn't giving fucking tips, you douchebag.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fg0d7ey": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "fg0d7ey",
                            "Author": "yellowposy2",
                            "Date Created": "01-30-2020 11:28:50",
                            "Upvotes": 1,
                            "Text": "I think you’re misunderstanding this post- it gives advice for what to do AFTER you’ve already harmed yourself, which is exactly what many harm reduction tips aim to do. Many people who binge respond to a binge with eating even more- which is certainly more harmful than following these tips. I don’t think this subreddit is meant for you. I noticed you mentioned your girlfriend’s eating disorder in your post history. Maybe r/EatingDisorderHope would be a better fit for you to seek support. We don’t need anyone bringing us down here; I’m sure you can understand that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzdczf": [
                [
                    {
                        "Parent ID": "t1_ffz6cdt",
                        "Comment ID": "ffzdczf",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:36:31",
                        "Upvotes": 2,
                        "Text": "I’ve officially added nutritional yeast to my shopping list because of you and I haven’t been this excited for buying yeast like... ever!! 😭 ❤️ I love cauliflower and edamame and carrots so I’m definitely going to try out all of these recipes! Thank you so much for sharing and including the calories too 😢 💜 I really do agree about feeling kinship when you know someone knows what this hell is like. I tried for so long to tell myself that it wasn’t actually happening to me and that I had it all under control. I was just passionate and driven about these goals I couldn’t even admit were unhealthy and unrealistic. But now I can admit it, and it’s hard, but I believe we can all one day break free of this and so I hope you will find a day where you never have to think about it again. Thank you from the bottom of my heart for taking the time to write responses to me about this. It felt really good to talk about it 🤗 And I’m sorry about the break up, but I’m glad that you sound like you’re back on your feet and you’ll have many more happier days ahead! 💜",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ffys2qr": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffys2qr",
                "Author": "j4jackj",
                "Date Created": "01-29-2020 21:09:10",
                "Upvotes": 12,
                "Text": "5a. If you have situs inversus totalis, lay on your right, for the same reason normal people like me shound lay on their left.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffz1ofh": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffz1ofh",
                "Author": "brisoI",
                "Date Created": "01-29-2020 23:11:32",
                "Upvotes": 5,
                "Text": "thank you for the tips!! ive been feeling so awful emotionally and that makes me binge 😭",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffz54on": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffz54on",
                "Author": "tseokii",
                "Date Created": "01-30-2020 00:05:13",
                "Upvotes": 6,
                "Text": "oooh I need to try that sleeping tip.\n\nedit: btw that reminded me of advice my mom had given me about rubbing babies' tummies to help them digest food so I looked it up [and yes you can give urself an abdominal self massage to help digest food!](https://www.google.com/url?sa=t&source=web&rct=j&url=http://www.med.umich.edu/1libr/MBCP/AbdominalSelfmassage.pdf&ved=2ahUKEwiWxsSh2KrnAhUIvp4KHUPlBFwQFjAMegQIAhAB&usg=AOvVaw1E7JnN7JXAnnq1_avQ3Ytd) (that is a .pdf so it might try to download in ur browser)\nyou start from your right hip bone and move up your right side. So a clockwise motion from the perspective of the tummy-haver",
                "Edited?": "01-30-2020 00:26:32",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fg1jl1l": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "fg1jl1l",
                "Author": "colazerocultleader",
                "Date Created": "01-30-2020 17:51:13",
                "Upvotes": 3,
                "Text": "thank you you sweet soul 💜",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffz6llj": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffz6llj",
                "Author": "janescandycanes",
                "Date Created": "01-30-2020 00:26:37",
                "Upvotes": 2,
                "Text": "Thank you for this post. Need it rn!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ffz6s8l": [
                {
                    "Parent ID": "t1_ffz6llj",
                    "Comment ID": "ffz6s8l",
                    "Author": "oceanlover__",
                    "Date Created": "01-30-2020 00:29:22",
                    "Upvotes": 1,
                    "Text": "I gotchu 🥰",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "ffze80b": [
                [
                    {
                        "Parent ID": "t1_ffz0bvi",
                        "Comment ID": "ffze80b",
                        "Author": "vanillavomit",
                        "Date Created": "01-30-2020 02:56:46",
                        "Upvotes": 36,
                        "Text": "i just realised how fucking ironic it is next to my comment. not sorry though",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg06j0j": [
                        {
                            "Parent ID": "t1_ffze80b",
                            "Comment ID": "fg06j0j",
                            "Author": "ColesEyebrows",
                            "Date Created": "01-30-2020 10:21:36",
                            "Upvotes": 10,
                            "Text": "I think it works well as a double warning causw purging sweet foods is just boke.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffz4fhl": [
                [
                    {
                        "Parent ID": "t1_ffz3pdg",
                        "Comment ID": "ffz4fhl",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-29-2020 23:53:44",
                        "Upvotes": 3,
                        "Text": "If I didn’t have retinol on right now I’d be letting myself cry (water messes it up... and it’s too cold outside my room to wash my face after so I can reapply 😂 😭 ❤️)This is such a kind message, thank you so, so much for your response. I’d been feeling really down and oversensitive and cranky and overthinking everything and I didn’t understand why... I even convinced myself people I love don’t love me as much anymore somehow. I hate that food has this power and I hate that *I* am the one who let myself become like this. Thank you so much for the tips, I’m going to the grocery store tomorrow and I’m going to just buy tons and tons of veggies!! Do you have any recommendations for sauces/dressings or salad toppings? :D I usually have pretty plain salads if I’m being honest. And thank you for including a shower as a nice thing for yourself. I know it sounds like something so simple that a lot of people do every day, but when it gets like this even finding the motivation to take care of myself like that slips away. I can’t thank you enough, and I’m here for you too! (that goes for all of you in this! We can make it through this)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffz6cdt": [
                        {
                            "Parent ID": "t1_ffz4fhl",
                            "Comment ID": "ffz6cdt",
                            "Author": "oceanlover__",
                            "Date Created": "01-30-2020 00:23:00",
                            "Upvotes": 5,
                            "Text": "Ahhhh you're so welcome!! I feel like anyone who struggles with food is a kindred spirit...we all just \"get\" it, you know? It's so isolating and mentally tormenting to constantly be picking apart your body and the way people view you and analyzing what you put in your body versus how much you weigh, etc. My boyfriend of 2 years recently broke up with me so I also relate to not feeling like people love you as much anymore. But you know what? Now is the time you have to love yourself enough to go the extra mile and invest some time in making yourself feel good!! So yes, shower, lotion, face masks, candles, dim lights, Netflix, cozy blankets, movie nights, do all the nice things for yourself! Part of why we binge is because we feel empty inside, so try filling yourself up in other ways. Of course still eat and nourish your body but just be mindful of how you feel before you eat. And for the veggies, do you have access to an oven? I really love roasting up a bunch of cauliflower. I chop it first from the head into smaller chunks and put it on a baking sheet with some salt. If you've ever used nutritional yeast it's a topping they usually have in the spice section and it has a very cheesy flavor but only 20 calories per tablespoon and it's a probiotic with B12, too! I love seasoning with that. I like to dip the cauliflower in ketchup (maybe too weird, idk haha). I also love to steam a bunch of chopped carrots with sea salt on them and eat big bowls of those, but if you don't have a steamer you can either put the chopped carrots in a pan with about 0.5 inches water on the highest stove setting or put the carrots in a microwavable bowl for about 5 min in the microwave with the same amount of water in the bowl. Edamame is also super good if you get the steam able bag kind and it's usually 130 calories for a huge bag of it that you steam in the microwave for 5 min. Lastly I get cauliflower rice from the frozen aisle, microwave it for 5 min in the bag, and season it with nutritional yeast and everything but the bagel seasoning! I usually make an egg white omelet with turkey to put on top of the cauliflower rice (1 egg, 3 egg whites, a slice of turkey, green onion if you want) and a tablespoon of hummus on top. It's incredibly high volume and filling. If you're in the mood for something sweet, chopping an apple and seasoning it with cinnamon and baking it in the oven for 15 min at 425 degrees is EXCELLENT, or you can microwave frozen fruit for a couple minutes to have a pie-like dessert. Sending you so much love!",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzczbk": [
                [
                    {
                        "Parent ID": "t1_ffz7y91",
                        "Comment ID": "ffzczbk",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:27:37",
                        "Upvotes": 2,
                        "Text": "Sending you lots of positivity too 😭 ❤️ Do you see any improvements with the jade roller? I had one before, but I was really clumsy with my routine and was using it poorly so I broke out 😂 I wanted to use it to massage my face and hopefully do something about the.. “youthful plumpness” of my cheeks 🤣 I’ve been so desperate for them to slim down at some point that I’ve even tried using rice paddles to massage them LOL.. Your routine sounds great btw!! I love dry brushing, I’m going to be consistent about it like you have been too.. Thank you for this support!!! We can get through this 🤗 ❤️ (also my weakness is stick cheese mozzarella..like the one for school lunches 😂 its so sponge-like and also stringy I cant get enough of it!)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg00g11": [
                        {
                            "Parent ID": "t1_ffzczbk",
                            "Comment ID": "fg00g11",
                            "Author": "itsapplered",
                            "Date Created": "01-30-2020 09:17:14",
                            "Upvotes": 2,
                            "Text": "I've just started using the roller consistently this week. I wake up early and have super full days, so its a great motivator to get out of bed and get ready, since it FEELS amazing! I keep it in the freezer and clean it with alcohol (just in case?) before using. I moisturize then roll it on. While I have my coffee. Its the little things that keep me pushing, thats why I have so much self care shit.. just trying to stay consistent on a good path. I have so many weaknesses.. lets just try giving in here and there as treats. Have a most wonderful day <3",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzah7c": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzah7c",
                        "Author": "oceanlover__",
                        "Date Created": "01-30-2020 01:33:22",
                        "Upvotes": 4,
                        "Text": "Based on his history his GF has an ED and he's lurking on here. Kinda creepy tbh!",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzmf4z": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzmf4z",
                        "Author": "joshuasfreedom",
                        "Date Created": "01-30-2020 06:04:42",
                        "Upvotes": -3,
                        "Text": "Harm reduction needs to actually recudce harm, not make harming yourself easier. Isn't this the reason proED is gone?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffzx0pz": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "ffzx0pz",
                            "Author": "TealNTurquoise",
                            "Date Created": "01-30-2020 08:38:01",
                            "Upvotes": 3,
                            "Text": "Discussing how to make oneself more comfortable after something goes wrong isn't giving fucking tips, you douchebag.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fg0d7ey": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "fg0d7ey",
                            "Author": "yellowposy2",
                            "Date Created": "01-30-2020 11:28:50",
                            "Upvotes": 1,
                            "Text": "I think you’re misunderstanding this post- it gives advice for what to do AFTER you’ve already harmed yourself, which is exactly what many harm reduction tips aim to do. Many people who binge respond to a binge with eating even more- which is certainly more harmful than following these tips. I don’t think this subreddit is meant for you. I noticed you mentioned your girlfriend’s eating disorder in your post history. Maybe r/EatingDisorderHope would be a better fit for you to seek support. We don’t need anyone bringing us down here; I’m sure you can understand that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzdczf": [
                [
                    {
                        "Parent ID": "t1_ffz6cdt",
                        "Comment ID": "ffzdczf",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:36:31",
                        "Upvotes": 2,
                        "Text": "I’ve officially added nutritional yeast to my shopping list because of you and I haven’t been this excited for buying yeast like... ever!! 😭 ❤️ I love cauliflower and edamame and carrots so I’m definitely going to try out all of these recipes! Thank you so much for sharing and including the calories too 😢 💜 I really do agree about feeling kinship when you know someone knows what this hell is like. I tried for so long to tell myself that it wasn’t actually happening to me and that I had it all under control. I was just passionate and driven about these goals I couldn’t even admit were unhealthy and unrealistic. But now I can admit it, and it’s hard, but I believe we can all one day break free of this and so I hope you will find a day where you never have to think about it again. Thank you from the bottom of my heart for taking the time to write responses to me about this. It felt really good to talk about it 🤗 And I’m sorry about the break up, but I’m glad that you sound like you’re back on your feet and you’ll have many more happier days ahead! 💜",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ffz8ks0": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffz8ks0",
                "Author": "HarlotHarley",
                "Date Created": "01-30-2020 00:55:56",
                "Upvotes": 2,
                "Text": "Thank you <3",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffzekcj": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffzekcj",
                "Author": "chasseneiges",
                "Date Created": "01-30-2020 03:04:53",
                "Upvotes": 2,
                "Text": "Thank you so so much for posting this! I’ve struggled badly with binging this past month in particular and your post is really helping me feel less alone and self-destructive. My issues with food and binging have made my life so miserable and lonely lately. It’s nice to know that there are people out there who actually understand what it’s like to suffer with disordered thoughts and destructive behaviors",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffzhzql": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffzhzql",
                "Author": "taw345272",
                "Date Created": "01-30-2020 04:28:34",
                "Upvotes": 2,
                "Text": "This is such a great post, I wish I saw this in December. I saved it in case I ever need kind words, thank you :)\n\nA tip from me: I find that certain smells kick me out off binge mode and back into restriction. It takes a bit to identify them, but it might work for you. It’s usually food that you ate during restriction with a distinct smell (for me black coffee, cucumber, mustard and pickle all kind of work - with coffee being the most affectionate).",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffzi3g9": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffzi3g9",
                "Author": "Squirrella",
                "Date Created": "01-30-2020 04:31:04",
                "Upvotes": 2,
                "Text": "I'm definitely going to try your faux apple pie thing. I eat a lot of frozen fruit but microwaving it a little sounds nice. Hubs and I found an excuse to buy a dozen donuts over this last fucking weekend, but during the week I can be good and do late night fruit binging.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffzi9t9": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffzi9t9",
                "Author": "mustyday",
                "Date Created": "01-30-2020 04:35:17",
                "Upvotes": 2,
                "Text": "This is just what I needed. Thank you. I’ve been on a three day binge streak and I’m hoping to break it today. Thank you ❤️",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffzkgvv": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffzkgvv",
                "Author": "pokeupokeu",
                "Date Created": "01-30-2020 05:25:43",
                "Upvotes": 2,
                "Text": "God thank you for this wonderful post. Ive been trapped in a binge c/s cycle heavily nearly all month and have been draining my bank account and had horrible jaw pain from it. Im gonna stock up on lots of fresh and frozen fruit for when my next binge occurs and focus on why im doing it and try and break this cycle.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fg03463": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "fg03463",
                "Author": "Nihilistic_Asshole_9",
                "Date Created": "01-30-2020 09:45:58",
                "Upvotes": 2,
                "Text": "Wait... Can no one tell when I've binged? I feel like it's super obvious and I look pregnant and even a couple pounds is noticeable on me because I'm short.... I've recently gained 5lbs from binging and feel twice my size.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffzk192": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffzk192",
                "Author": "herrobot22",
                "Date Created": "01-30-2020 05:16:05",
                "Upvotes": 0,
                "Text": "Tip 7! Go through a break up! Nothing like severe and utter rejection to get your mind off food. Why don’t you focus on your inadequacy issues instead?! \n\n\nTherapy is too expensive atm.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ffyxu93": [
        [
            {
                "Parent ID": "t3_evy4lx",
                "Comment ID": "ffyxu93",
                "Author": "joshuasfreedom",
                "Date Created": "01-29-2020 22:18:34",
                "Upvotes": -19,
                "Text": "This is awful.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ffyxusa": [
                {
                    "Parent ID": "t1_ffyxu93",
                    "Comment ID": "ffyxusa",
                    "Author": "oceanlover__",
                    "Date Created": "01-29-2020 22:18:46",
                    "Upvotes": 10,
                    "Text": "What?",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "ffze80b": [
                [
                    {
                        "Parent ID": "t1_ffz0bvi",
                        "Comment ID": "ffze80b",
                        "Author": "vanillavomit",
                        "Date Created": "01-30-2020 02:56:46",
                        "Upvotes": 36,
                        "Text": "i just realised how fucking ironic it is next to my comment. not sorry though",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg06j0j": [
                        {
                            "Parent ID": "t1_ffze80b",
                            "Comment ID": "fg06j0j",
                            "Author": "ColesEyebrows",
                            "Date Created": "01-30-2020 10:21:36",
                            "Upvotes": 10,
                            "Text": "I think it works well as a double warning causw purging sweet foods is just boke.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffz4fhl": [
                [
                    {
                        "Parent ID": "t1_ffz3pdg",
                        "Comment ID": "ffz4fhl",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-29-2020 23:53:44",
                        "Upvotes": 3,
                        "Text": "If I didn’t have retinol on right now I’d be letting myself cry (water messes it up... and it’s too cold outside my room to wash my face after so I can reapply 😂 😭 ❤️)This is such a kind message, thank you so, so much for your response. I’d been feeling really down and oversensitive and cranky and overthinking everything and I didn’t understand why... I even convinced myself people I love don’t love me as much anymore somehow. I hate that food has this power and I hate that *I* am the one who let myself become like this. Thank you so much for the tips, I’m going to the grocery store tomorrow and I’m going to just buy tons and tons of veggies!! Do you have any recommendations for sauces/dressings or salad toppings? :D I usually have pretty plain salads if I’m being honest. And thank you for including a shower as a nice thing for yourself. I know it sounds like something so simple that a lot of people do every day, but when it gets like this even finding the motivation to take care of myself like that slips away. I can’t thank you enough, and I’m here for you too! (that goes for all of you in this! We can make it through this)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffz6cdt": [
                        {
                            "Parent ID": "t1_ffz4fhl",
                            "Comment ID": "ffz6cdt",
                            "Author": "oceanlover__",
                            "Date Created": "01-30-2020 00:23:00",
                            "Upvotes": 5,
                            "Text": "Ahhhh you're so welcome!! I feel like anyone who struggles with food is a kindred spirit...we all just \"get\" it, you know? It's so isolating and mentally tormenting to constantly be picking apart your body and the way people view you and analyzing what you put in your body versus how much you weigh, etc. My boyfriend of 2 years recently broke up with me so I also relate to not feeling like people love you as much anymore. But you know what? Now is the time you have to love yourself enough to go the extra mile and invest some time in making yourself feel good!! So yes, shower, lotion, face masks, candles, dim lights, Netflix, cozy blankets, movie nights, do all the nice things for yourself! Part of why we binge is because we feel empty inside, so try filling yourself up in other ways. Of course still eat and nourish your body but just be mindful of how you feel before you eat. And for the veggies, do you have access to an oven? I really love roasting up a bunch of cauliflower. I chop it first from the head into smaller chunks and put it on a baking sheet with some salt. If you've ever used nutritional yeast it's a topping they usually have in the spice section and it has a very cheesy flavor but only 20 calories per tablespoon and it's a probiotic with B12, too! I love seasoning with that. I like to dip the cauliflower in ketchup (maybe too weird, idk haha). I also love to steam a bunch of chopped carrots with sea salt on them and eat big bowls of those, but if you don't have a steamer you can either put the chopped carrots in a pan with about 0.5 inches water on the highest stove setting or put the carrots in a microwavable bowl for about 5 min in the microwave with the same amount of water in the bowl. Edamame is also super good if you get the steam able bag kind and it's usually 130 calories for a huge bag of it that you steam in the microwave for 5 min. Lastly I get cauliflower rice from the frozen aisle, microwave it for 5 min in the bag, and season it with nutritional yeast and everything but the bagel seasoning! I usually make an egg white omelet with turkey to put on top of the cauliflower rice (1 egg, 3 egg whites, a slice of turkey, green onion if you want) and a tablespoon of hummus on top. It's incredibly high volume and filling. If you're in the mood for something sweet, chopping an apple and seasoning it with cinnamon and baking it in the oven for 15 min at 425 degrees is EXCELLENT, or you can microwave frozen fruit for a couple minutes to have a pie-like dessert. Sending you so much love!",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzczbk": [
                [
                    {
                        "Parent ID": "t1_ffz7y91",
                        "Comment ID": "ffzczbk",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:27:37",
                        "Upvotes": 2,
                        "Text": "Sending you lots of positivity too 😭 ❤️ Do you see any improvements with the jade roller? I had one before, but I was really clumsy with my routine and was using it poorly so I broke out 😂 I wanted to use it to massage my face and hopefully do something about the.. “youthful plumpness” of my cheeks 🤣 I’ve been so desperate for them to slim down at some point that I’ve even tried using rice paddles to massage them LOL.. Your routine sounds great btw!! I love dry brushing, I’m going to be consistent about it like you have been too.. Thank you for this support!!! We can get through this 🤗 ❤️ (also my weakness is stick cheese mozzarella..like the one for school lunches 😂 its so sponge-like and also stringy I cant get enough of it!)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg00g11": [
                        {
                            "Parent ID": "t1_ffzczbk",
                            "Comment ID": "fg00g11",
                            "Author": "itsapplered",
                            "Date Created": "01-30-2020 09:17:14",
                            "Upvotes": 2,
                            "Text": "I've just started using the roller consistently this week. I wake up early and have super full days, so its a great motivator to get out of bed and get ready, since it FEELS amazing! I keep it in the freezer and clean it with alcohol (just in case?) before using. I moisturize then roll it on. While I have my coffee. Its the little things that keep me pushing, thats why I have so much self care shit.. just trying to stay consistent on a good path. I have so many weaknesses.. lets just try giving in here and there as treats. Have a most wonderful day <3",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzah7c": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzah7c",
                        "Author": "oceanlover__",
                        "Date Created": "01-30-2020 01:33:22",
                        "Upvotes": 4,
                        "Text": "Based on his history his GF has an ED and he's lurking on here. Kinda creepy tbh!",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzmf4z": [
                [
                    {
                        "Parent ID": "t1_ffz3e0i",
                        "Comment ID": "ffzmf4z",
                        "Author": "joshuasfreedom",
                        "Date Created": "01-30-2020 06:04:42",
                        "Upvotes": -3,
                        "Text": "Harm reduction needs to actually recudce harm, not make harming yourself easier. Isn't this the reason proED is gone?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffzx0pz": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "ffzx0pz",
                            "Author": "TealNTurquoise",
                            "Date Created": "01-30-2020 08:38:01",
                            "Upvotes": 3,
                            "Text": "Discussing how to make oneself more comfortable after something goes wrong isn't giving fucking tips, you douchebag.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fg0d7ey": [
                        {
                            "Parent ID": "t1_ffzmf4z",
                            "Comment ID": "fg0d7ey",
                            "Author": "yellowposy2",
                            "Date Created": "01-30-2020 11:28:50",
                            "Upvotes": 1,
                            "Text": "I think you’re misunderstanding this post- it gives advice for what to do AFTER you’ve already harmed yourself, which is exactly what many harm reduction tips aim to do. Many people who binge respond to a binge with eating even more- which is certainly more harmful than following these tips. I don’t think this subreddit is meant for you. I noticed you mentioned your girlfriend’s eating disorder in your post history. Maybe r/EatingDisorderHope would be a better fit for you to seek support. We don’t need anyone bringing us down here; I’m sure you can understand that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzdczf": [
                [
                    {
                        "Parent ID": "t1_ffz6cdt",
                        "Comment ID": "ffzdczf",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:36:31",
                        "Upvotes": 2,
                        "Text": "I’ve officially added nutritional yeast to my shopping list because of you and I haven’t been this excited for buying yeast like... ever!! 😭 ❤️ I love cauliflower and edamame and carrots so I’m definitely going to try out all of these recipes! Thank you so much for sharing and including the calories too 😢 💜 I really do agree about feeling kinship when you know someone knows what this hell is like. I tried for so long to tell myself that it wasn’t actually happening to me and that I had it all under control. I was just passionate and driven about these goals I couldn’t even admit were unhealthy and unrealistic. But now I can admit it, and it’s hard, but I believe we can all one day break free of this and so I hope you will find a day where you never have to think about it again. Thank you from the bottom of my heart for taking the time to write responses to me about this. It felt really good to talk about it 🤗 And I’m sorry about the break up, but I’m glad that you sound like you’re back on your feet and you’ll have many more happier days ahead! 💜",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "ffz3e0i": [
                {
                    "Parent ID": "t1_ffyxu93",
                    "Comment ID": "ffz3e0i",
                    "Author": "yellowposy2",
                    "Date Created": "01-29-2020 23:37:15",
                    "Upvotes": 10,
                    "Text": "What the fuck? OP is just trying to make people feel better. Harm reduction is really helpful for people with mental illness.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ffzah7c": [
                        {
                            "Parent ID": "t1_ffz3e0i",
                            "Comment ID": "ffzah7c",
                            "Author": "oceanlover__",
                            "Date Created": "01-30-2020 01:33:22",
                            "Upvotes": 4,
                            "Text": "Based on his history his GF has an ED and he's lurking on here. Kinda creepy tbh!",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ffzmf4z": [
                        {
                            "Parent ID": "t1_ffz3e0i",
                            "Comment ID": "ffzmf4z",
                            "Author": "joshuasfreedom",
                            "Date Created": "01-30-2020 06:04:42",
                            "Upvotes": -3,
                            "Text": "Harm reduction needs to actually recudce harm, not make harming yourself easier. Isn't this the reason proED is gone?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffze80b": [
                [
                    {
                        "Parent ID": "t1_ffz0bvi",
                        "Comment ID": "ffze80b",
                        "Author": "vanillavomit",
                        "Date Created": "01-30-2020 02:56:46",
                        "Upvotes": 36,
                        "Text": "i just realised how fucking ironic it is next to my comment. not sorry though",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg06j0j": [
                        {
                            "Parent ID": "t1_ffze80b",
                            "Comment ID": "fg06j0j",
                            "Author": "ColesEyebrows",
                            "Date Created": "01-30-2020 10:21:36",
                            "Upvotes": 10,
                            "Text": "I think it works well as a double warning causw purging sweet foods is just boke.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffz4fhl": [
                [
                    {
                        "Parent ID": "t1_ffz3pdg",
                        "Comment ID": "ffz4fhl",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-29-2020 23:53:44",
                        "Upvotes": 3,
                        "Text": "If I didn’t have retinol on right now I’d be letting myself cry (water messes it up... and it’s too cold outside my room to wash my face after so I can reapply 😂 😭 ❤️)This is such a kind message, thank you so, so much for your response. I’d been feeling really down and oversensitive and cranky and overthinking everything and I didn’t understand why... I even convinced myself people I love don’t love me as much anymore somehow. I hate that food has this power and I hate that *I* am the one who let myself become like this. Thank you so much for the tips, I’m going to the grocery store tomorrow and I’m going to just buy tons and tons of veggies!! Do you have any recommendations for sauces/dressings or salad toppings? :D I usually have pretty plain salads if I’m being honest. And thank you for including a shower as a nice thing for yourself. I know it sounds like something so simple that a lot of people do every day, but when it gets like this even finding the motivation to take care of myself like that slips away. I can’t thank you enough, and I’m here for you too! (that goes for all of you in this! We can make it through this)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ffz6cdt": [
                        {
                            "Parent ID": "t1_ffz4fhl",
                            "Comment ID": "ffz6cdt",
                            "Author": "oceanlover__",
                            "Date Created": "01-30-2020 00:23:00",
                            "Upvotes": 5,
                            "Text": "Ahhhh you're so welcome!! I feel like anyone who struggles with food is a kindred spirit...we all just \"get\" it, you know? It's so isolating and mentally tormenting to constantly be picking apart your body and the way people view you and analyzing what you put in your body versus how much you weigh, etc. My boyfriend of 2 years recently broke up with me so I also relate to not feeling like people love you as much anymore. But you know what? Now is the time you have to love yourself enough to go the extra mile and invest some time in making yourself feel good!! So yes, shower, lotion, face masks, candles, dim lights, Netflix, cozy blankets, movie nights, do all the nice things for yourself! Part of why we binge is because we feel empty inside, so try filling yourself up in other ways. Of course still eat and nourish your body but just be mindful of how you feel before you eat. And for the veggies, do you have access to an oven? I really love roasting up a bunch of cauliflower. I chop it first from the head into smaller chunks and put it on a baking sheet with some salt. If you've ever used nutritional yeast it's a topping they usually have in the spice section and it has a very cheesy flavor but only 20 calories per tablespoon and it's a probiotic with B12, too! I love seasoning with that. I like to dip the cauliflower in ketchup (maybe too weird, idk haha). I also love to steam a bunch of chopped carrots with sea salt on them and eat big bowls of those, but if you don't have a steamer you can either put the chopped carrots in a pan with about 0.5 inches water on the highest stove setting or put the carrots in a microwavable bowl for about 5 min in the microwave with the same amount of water in the bowl. Edamame is also super good if you get the steam able bag kind and it's usually 130 calories for a huge bag of it that you steam in the microwave for 5 min. Lastly I get cauliflower rice from the frozen aisle, microwave it for 5 min in the bag, and season it with nutritional yeast and everything but the bagel seasoning! I usually make an egg white omelet with turkey to put on top of the cauliflower rice (1 egg, 3 egg whites, a slice of turkey, green onion if you want) and a tablespoon of hummus on top. It's incredibly high volume and filling. If you're in the mood for something sweet, chopping an apple and seasoning it with cinnamon and baking it in the oven for 15 min at 425 degrees is EXCELLENT, or you can microwave frozen fruit for a couple minutes to have a pie-like dessert. Sending you so much love!",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzczbk": [
                [
                    {
                        "Parent ID": "t1_ffz7y91",
                        "Comment ID": "ffzczbk",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:27:37",
                        "Upvotes": 2,
                        "Text": "Sending you lots of positivity too 😭 ❤️ Do you see any improvements with the jade roller? I had one before, but I was really clumsy with my routine and was using it poorly so I broke out 😂 I wanted to use it to massage my face and hopefully do something about the.. “youthful plumpness” of my cheeks 🤣 I’ve been so desperate for them to slim down at some point that I’ve even tried using rice paddles to massage them LOL.. Your routine sounds great btw!! I love dry brushing, I’m going to be consistent about it like you have been too.. Thank you for this support!!! We can get through this 🤗 ❤️ (also my weakness is stick cheese mozzarella..like the one for school lunches 😂 its so sponge-like and also stringy I cant get enough of it!)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fg00g11": [
                        {
                            "Parent ID": "t1_ffzczbk",
                            "Comment ID": "fg00g11",
                            "Author": "itsapplered",
                            "Date Created": "01-30-2020 09:17:14",
                            "Upvotes": 2,
                            "Text": "I've just started using the roller consistently this week. I wake up early and have super full days, so its a great motivator to get out of bed and get ready, since it FEELS amazing! I keep it in the freezer and clean it with alcohol (just in case?) before using. I moisturize then roll it on. While I have my coffee. Its the little things that keep me pushing, thats why I have so much self care shit.. just trying to stay consistent on a good path. I have so many weaknesses.. lets just try giving in here and there as treats. Have a most wonderful day <3",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ffzx0pz": [
                [
                    {
                        "Parent ID": "t1_ffzmf4z",
                        "Comment ID": "ffzx0pz",
                        "Author": "TealNTurquoise",
                        "Date Created": "01-30-2020 08:38:01",
                        "Upvotes": 3,
                        "Text": "Discussing how to make oneself more comfortable after something goes wrong isn't giving fucking tips, you douchebag.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fg0d7ey": [
                [
                    {
                        "Parent ID": "t1_ffzmf4z",
                        "Comment ID": "fg0d7ey",
                        "Author": "yellowposy2",
                        "Date Created": "01-30-2020 11:28:50",
                        "Upvotes": 1,
                        "Text": "I think you’re misunderstanding this post- it gives advice for what to do AFTER you’ve already harmed yourself, which is exactly what many harm reduction tips aim to do. Many people who binge respond to a binge with eating even more- which is certainly more harmful than following these tips. I don’t think this subreddit is meant for you. I noticed you mentioned your girlfriend’s eating disorder in your post history. Maybe r/EatingDisorderHope would be a better fit for you to seek support. We don’t need anyone bringing us down here; I’m sure you can understand that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ffzdczf": [
                [
                    {
                        "Parent ID": "t1_ffz6cdt",
                        "Comment ID": "ffzdczf",
                        "Author": "MyFaceSlowPace",
                        "Date Created": "01-30-2020 02:36:31",
                        "Upvotes": 2,
                        "Text": "I’ve officially added nutritional yeast to my shopping list because of you and I haven’t been this excited for buying yeast like... ever!! 😭 ❤️ I love cauliflower and edamame and carrots so I’m definitely going to try out all of these recipes! Thank you so much for sharing and including the calories too 😢 💜 I really do agree about feeling kinship when you know someone knows what this hell is like. I tried for so long to tell myself that it wasn’t actually happening to me and that I had it all under control. I was just passionate and driven about these goals I couldn’t even admit were unhealthy and unrealistic. But now I can admit it, and it’s hard, but I believe we can all one day break free of this and so I hope you will find a day where you never have to think about it again. Thank you from the bottom of my heart for taking the time to write responses to me about this. It felt really good to talk about it 🤗 And I’m sorry about the break up, but I’m glad that you sound like you’re back on your feet and you’ll have many more happier days ahead! 💜",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ]
}