{
    "f9k2c1b": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9k2c1b",
                "Author": "MissLovelorn",
                "Date Created": "12-03-2019 10:41:08",
                "Upvotes": 234,
                "Text": "On another note why are Koreans so chill with starvation diets??? Yeah they mention that they're unhealthy and short-term only but like you're telling thousands of people that you got hot by eating an apple and a cup of milk every day",
                "Edited?": false,
                "Is Submitter?": true,
                "Stickied?": false
            }
        ],
        {
            "f9khqrs": [
                {
                    "Parent ID": "t1_f9k2c1b",
                    "Comment ID": "f9khqrs",
                    "Author": "ddmar",
                    "Date Created": "12-03-2019 13:18:24",
                    "Upvotes": 152,
                    "Text": "Yeah, my mom once told me to stop eating bread after I got out of the hospital and had lost 30 pounds and was underweight because I would gain all the weight back. \n\nShe also encouraged me to chew and spit food, and I never realized growing up that was disordered lmao",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f9lgqed": [
                        {
                            "Parent ID": "t1_f9khqrs",
                            "Comment ID": "f9lgqed",
                            "Author": "psybeams",
                            "Date Created": "12-03-2019 19:24:48",
                            "Upvotes": 65,
                            "Text": "lmao when i was 15 i cried after eating a blizzard from dq and my mom told me to throw it up if i felt that bad about it and taught me how thus began the fingers down the throat lifestyle lmfao whack",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9l3km8": [
                        {
                            "Parent ID": "t1_f9khqrs",
                            "Comment ID": "f9l3km8",
                            "Author": "beets_or_turnips",
                            "Date Created": "12-03-2019 16:54:07",
                            "Upvotes": 25,
                            "Text": "Oh noooooo",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9m2fdw": [
                        {
                            "Parent ID": "t1_f9khqrs",
                            "Comment ID": "f9m2fdw",
                            "Author": "jjfmish",
                            "Date Created": "12-03-2019 23:58:21",
                            "Upvotes": 25,
                            "Text": "TW: numbers\n\nI’m not Korean but my parents are first-gen Russian immigrants so the culture of fat shaming, normalizing extreme dieting, and glorifying underweight bodies is similar. My mom spent my whole teen years calling me fat and whenever I’d tell her to stop she’d say she was doing it out of love and that Canadian/American parents not being brutally honest with their kids is why these countries have problems with obesity. When I was 18 I went on vacation with a group of my family friends and this woman told my mom “your daughter could be pretty if she lost 30 lbs”. I was like a BMI of 25 or 26 at that point so I was a lil chubby at most but to Russians I might as well have been obese. My mom then told me how she said I needed to lose weight, I said “yeah I know I need to lose like 15lbs” and she was like “haha no 30 at least”. My mom also spent that whole trip talking about what a nice body one of my family friends had. Girl was maybe a very fit BMI of 19 at most, worked out every day of the trip, and pretty much lived off fruit and salad at our all inclusive resort. \n\nGuess who spent the next three years repeatedly losing 10-20 lbs just to gain half of it back each time and dealing with never ending cycles of binging and restriction. I’m down almost 30 lbs now and everyone thinks I just outgrew my chubbiness or developed a healthier/more active lifestyle when I went to college because the weight loss was so gradual and I’m still a healthy weight. In reality, I went from being a teen that comfort ate and had problems with binging to an adult that starves herself and abuses ADHD meds to lose weight but ends up losing it hella slowly because of her binge tendencies, It’s frighteningly easy to hide disordered eating when you’re not the ‘typical sufferer’, especially if you’re in a cultural or family environment that encourages weight loss at all costs.",
                            "Edited?": "12-04-2019 00:07:58",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9l8b5y": [
                        {
                            "Parent ID": "t1_f9khqrs",
                            "Comment ID": "f9l8b5y",
                            "Author": "ImperatriceSaltea",
                            "Date Created": "12-03-2019 17:47:05",
                            "Upvotes": 21,
                            "Text": "I feel so sorry for you. Not great to grown up with this :/",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9md6fb": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9md6fb",
                        "Author": "tseokii",
                        "Date Created": "12-04-2019 03:46:08",
                        "Upvotes": 8,
                        "Text": "If you're talking about Kpop idols, they're REALLY skinny. Like, really underweight. But a lot of Koreans have such a small bone structure that even at those low weights, they don't appear too bony or sickly.\n\nAlso idols work out a lot. They spend some ungodly hours dancing and exercising.\n\nNothing can really be done about the areas of your body you LOSE weight from. If you gain weight back quickly, it will tend to gather around your midsection (and very slowly redistribute over time) but I don't think anything impacts how you LOSE it (aside from just your body fat distribution and how your body chooses to lose it)\n\nStarvation diets will do nothing great for your body composition, honestly, because you can't gain muscle on a deficit. In fact, I think any time you lose a lot of fat you tend to lose some muscle as well. So basically, yeah... for a fit body, you do need to exercise. I think working out on a deficit still helps you retain muscle even if losing some of it is inevitable.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m1o80": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9m1o80",
                        "Author": "lshimaru",
                        "Date Created": "12-03-2019 23:46:10",
                        "Upvotes": 10,
                        "Text": "Idk how big of a factor this is but young people in korea walk a lot since taxis and cars are very expensive, so a lot of them have muscular legs and thinner upper bodies. I can’t say I’ve seem anyone of them naked tho so I’m not sure if they’re skinny-fat or just skinny. They also eat a lot of meat so maybe that would help to retain muscle?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9mdhj9": [
                        {
                            "Parent ID": "t1_f9m1o80",
                            "Comment ID": "f9mdhj9",
                            "Author": "tseokii",
                            "Date Created": "12-04-2019 03:54:05",
                            "Upvotes": 5,
                            "Text": "> so a lot of them have muscular legs and thinner upper bodies.\n\nHonestly I don't think this has anything to do with walking a lot, this just seems to be the most common body type for Korean women (long torso+short limbs = small waist+thicker legs) Walking doesn't bulk your legs. Otherwise I'd be screwed because I do a ton of walking lol. But I have the opposite body type (short torso+long limbs = fridge waist+thin legs) and my legs are not very muscular.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9mkkfe": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9mkkfe",
                        "Author": "MissLovelorn",
                        "Date Created": "12-04-2019 06:33:15",
                        "Upvotes": 3,
                        "Text": "I'm not sure but most of the Korean diet videos I've seen also include a lot of toning exercises, especially around the waist/core.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8lfl": [
                [
                    {
                        "Parent ID": "t1_f9l3zcg",
                        "Comment ID": "f9l8lfl",
                        "Author": "tseokii",
                        "Date Created": "12-03-2019 17:50:20",
                        "Upvotes": 13,
                        "Text": "It seems to me that a lot of people are still really put off by the idea of mukbangs/food ASMR specifically even if they're okay about the idea of ASMR videos in general. Like they're okay about the whispering and like idk soap cutting or whatever but nooooooo chewing lol",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9n7uzs": [
                [
                    {
                        "Parent ID": "t1_f9lsn8e",
                        "Comment ID": "f9n7uzs",
                        "Author": "jjfmish",
                        "Date Created": "12-04-2019 11:01:19",
                        "Upvotes": 3,
                        "Text": "Looking back, I’m wondering if Anna Richardson used those early seasons as an excuse to do a ton of crash diets, crazy exercise regimes, and weight loss/toning procedures for free and be forced to stick with them under the guise of ‘testing them’. I think she did end up losing like 25lbs and getting more toned over the first couple of years so I guess it worked? Even if she couldn’t stick to all the diets it definitely made her exercise more regularly and probably made her more conscious of what she was eating outside the show.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9lwl4i": [
                [
                    {
                        "Parent ID": "t1_f9lgqed",
                        "Comment ID": "f9lwl4i",
                        "Author": "bluebrainbethany",
                        "Date Created": "12-03-2019 22:32:49",
                        "Upvotes": 51,
                        "Text": "Wtf your mom needs mother fucking JESUS",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9mzwtm": [
                        {
                            "Parent ID": "t1_f9lwl4i",
                            "Comment ID": "f9mzwtm",
                            "Author": "psybeams",
                            "Date Created": "12-04-2019 09:39:28",
                            "Upvotes": 12,
                            "Text": "looool she denies it even happened like every other shitty thing she’s done to me, it’s all in my head apparently 🤷🏻‍♀️🤷🏻‍♀️",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fbjd21m": [
                [
                    {
                        "Parent ID": "t1_f9lgqed",
                        "Comment ID": "fbjd21m",
                        "Author": "[deleted]",
                        "Date Created": "12-21-2019 06:21:13",
                        "Upvotes": 1,
                        "Text": "The fuck your mum is basically abusive",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mdj2j": [
                [
                    {
                        "Parent ID": "t1_f9mdhj9",
                        "Comment ID": "f9mdj2j",
                        "Author": "lshimaru",
                        "Date Created": "12-04-2019 03:55:11",
                        "Upvotes": 2,
                        "Text": "It’s a lot of uphill walking? Idk I’m not a doctor or anything but I’ve gotten some pretty good calf definition while I’m here and I don’t really work out",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f9l8asj": [
                {
                    "Parent ID": "t1_f9k2c1b",
                    "Comment ID": "f9l8asj",
                    "Author": "tseokii",
                    "Date Created": "12-03-2019 17:46:58",
                    "Upvotes": 64,
                    "Text": "This is a really good question. It's strange. But I think there's a couple factors (obviously not everything) but from my understanding 1. Korean culture is very homogenous, so the pressure to be thin is more pervasive, and beauty standards are more strict (as in, people will agree on beauty ideals more than in other countries with a more diverse population) this may be compounded by the fact that 2. People of an Asian ethnicity are frequently slimmer/have a smaller frame, so being a low BMI is less likely to *seem* unnatural (OBVIOUSLY there is HUGE individual variation here) and 3. Korean culture does not consider personal comments to others (who are already close) to be as rude as in other cultures (further cementing beauty ideals because they're more likely to perpetuated in daily life, perhaps) 4. Korean women seem to be generally afraid of bulking and therefore are not as keen on exercise as a weight loss method because of this\n\nBut I think these factors may be a reason the diet culture is so entrenched. I think it's likely that many young people in Korea are aware, to some degree, that starvation diets and other disordered nonsense is unhealthy, but perhaps they belief the social payoff is just worth it.\n\nThere's other things I can think of too.. I don't think the fitness craze of the 80s hit Korea nearly as hard (if at all? I know little about Korea in the 80s) so being fit and muscular doesn't seem to have ever been held in such a high regard. So weight loss efforts tends to emphasize just being THINNER, not fitter. And indeed a starvation diet is about the quickest way to get thinner, not fitter.\n\nObviously this is not the whole picture at all and you have to take what I say with a grain of salt anyway because I'm not Korean and have never been to Korea lol",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f9lgqed": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9lgqed",
                        "Author": "psybeams",
                        "Date Created": "12-03-2019 19:24:48",
                        "Upvotes": 65,
                        "Text": "lmao when i was 15 i cried after eating a blizzard from dq and my mom told me to throw it up if i felt that bad about it and taught me how thus began the fingers down the throat lifestyle lmfao whack",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9lwl4i": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "f9lwl4i",
                            "Author": "bluebrainbethany",
                            "Date Created": "12-03-2019 22:32:49",
                            "Upvotes": 51,
                            "Text": "Wtf your mom needs mother fucking JESUS",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fbjd21m": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "fbjd21m",
                            "Author": "[deleted]",
                            "Date Created": "12-21-2019 06:21:13",
                            "Upvotes": 1,
                            "Text": "The fuck your mum is basically abusive",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9l3km8": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l3km8",
                        "Author": "beets_or_turnips",
                        "Date Created": "12-03-2019 16:54:07",
                        "Upvotes": 25,
                        "Text": "Oh noooooo",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m2fdw": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9m2fdw",
                        "Author": "jjfmish",
                        "Date Created": "12-03-2019 23:58:21",
                        "Upvotes": 25,
                        "Text": "TW: numbers\n\nI’m not Korean but my parents are first-gen Russian immigrants so the culture of fat shaming, normalizing extreme dieting, and glorifying underweight bodies is similar. My mom spent my whole teen years calling me fat and whenever I’d tell her to stop she’d say she was doing it out of love and that Canadian/American parents not being brutally honest with their kids is why these countries have problems with obesity. When I was 18 I went on vacation with a group of my family friends and this woman told my mom “your daughter could be pretty if she lost 30 lbs”. I was like a BMI of 25 or 26 at that point so I was a lil chubby at most but to Russians I might as well have been obese. My mom then told me how she said I needed to lose weight, I said “yeah I know I need to lose like 15lbs” and she was like “haha no 30 at least”. My mom also spent that whole trip talking about what a nice body one of my family friends had. Girl was maybe a very fit BMI of 19 at most, worked out every day of the trip, and pretty much lived off fruit and salad at our all inclusive resort. \n\nGuess who spent the next three years repeatedly losing 10-20 lbs just to gain half of it back each time and dealing with never ending cycles of binging and restriction. I’m down almost 30 lbs now and everyone thinks I just outgrew my chubbiness or developed a healthier/more active lifestyle when I went to college because the weight loss was so gradual and I’m still a healthy weight. In reality, I went from being a teen that comfort ate and had problems with binging to an adult that starves herself and abuses ADHD meds to lose weight but ends up losing it hella slowly because of her binge tendencies, It’s frighteningly easy to hide disordered eating when you’re not the ‘typical sufferer’, especially if you’re in a cultural or family environment that encourages weight loss at all costs.",
                        "Edited?": "12-04-2019 00:07:58",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8b5y": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l8b5y",
                        "Author": "ImperatriceSaltea",
                        "Date Created": "12-03-2019 17:47:05",
                        "Upvotes": 21,
                        "Text": "I feel so sorry for you. Not great to grown up with this :/",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9md6fb": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9md6fb",
                        "Author": "tseokii",
                        "Date Created": "12-04-2019 03:46:08",
                        "Upvotes": 8,
                        "Text": "If you're talking about Kpop idols, they're REALLY skinny. Like, really underweight. But a lot of Koreans have such a small bone structure that even at those low weights, they don't appear too bony or sickly.\n\nAlso idols work out a lot. They spend some ungodly hours dancing and exercising.\n\nNothing can really be done about the areas of your body you LOSE weight from. If you gain weight back quickly, it will tend to gather around your midsection (and very slowly redistribute over time) but I don't think anything impacts how you LOSE it (aside from just your body fat distribution and how your body chooses to lose it)\n\nStarvation diets will do nothing great for your body composition, honestly, because you can't gain muscle on a deficit. In fact, I think any time you lose a lot of fat you tend to lose some muscle as well. So basically, yeah... for a fit body, you do need to exercise. I think working out on a deficit still helps you retain muscle even if losing some of it is inevitable.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m1o80": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9m1o80",
                        "Author": "lshimaru",
                        "Date Created": "12-03-2019 23:46:10",
                        "Upvotes": 10,
                        "Text": "Idk how big of a factor this is but young people in korea walk a lot since taxis and cars are very expensive, so a lot of them have muscular legs and thinner upper bodies. I can’t say I’ve seem anyone of them naked tho so I’m not sure if they’re skinny-fat or just skinny. They also eat a lot of meat so maybe that would help to retain muscle?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9mdhj9": [
                        {
                            "Parent ID": "t1_f9m1o80",
                            "Comment ID": "f9mdhj9",
                            "Author": "tseokii",
                            "Date Created": "12-04-2019 03:54:05",
                            "Upvotes": 5,
                            "Text": "> so a lot of them have muscular legs and thinner upper bodies.\n\nHonestly I don't think this has anything to do with walking a lot, this just seems to be the most common body type for Korean women (long torso+short limbs = small waist+thicker legs) Walking doesn't bulk your legs. Otherwise I'd be screwed because I do a ton of walking lol. But I have the opposite body type (short torso+long limbs = fridge waist+thin legs) and my legs are not very muscular.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9mkkfe": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9mkkfe",
                        "Author": "MissLovelorn",
                        "Date Created": "12-04-2019 06:33:15",
                        "Upvotes": 3,
                        "Text": "I'm not sure but most of the Korean diet videos I've seen also include a lot of toning exercises, especially around the waist/core.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8lfl": [
                [
                    {
                        "Parent ID": "t1_f9l3zcg",
                        "Comment ID": "f9l8lfl",
                        "Author": "tseokii",
                        "Date Created": "12-03-2019 17:50:20",
                        "Upvotes": 13,
                        "Text": "It seems to me that a lot of people are still really put off by the idea of mukbangs/food ASMR specifically even if they're okay about the idea of ASMR videos in general. Like they're okay about the whispering and like idk soap cutting or whatever but nooooooo chewing lol",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9n7uzs": [
                [
                    {
                        "Parent ID": "t1_f9lsn8e",
                        "Comment ID": "f9n7uzs",
                        "Author": "jjfmish",
                        "Date Created": "12-04-2019 11:01:19",
                        "Upvotes": 3,
                        "Text": "Looking back, I’m wondering if Anna Richardson used those early seasons as an excuse to do a ton of crash diets, crazy exercise regimes, and weight loss/toning procedures for free and be forced to stick with them under the guise of ‘testing them’. I think she did end up losing like 25lbs and getting more toned over the first couple of years so I guess it worked? Even if she couldn’t stick to all the diets it definitely made her exercise more regularly and probably made her more conscious of what she was eating outside the show.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mzwtm": [
                [
                    {
                        "Parent ID": "t1_f9lwl4i",
                        "Comment ID": "f9mzwtm",
                        "Author": "psybeams",
                        "Date Created": "12-04-2019 09:39:28",
                        "Upvotes": 12,
                        "Text": "looool she denies it even happened like every other shitty thing she’s done to me, it’s all in my head apparently 🤷🏻‍♀️🤷🏻‍♀️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mdj2j": [
                [
                    {
                        "Parent ID": "t1_f9mdhj9",
                        "Comment ID": "f9mdj2j",
                        "Author": "lshimaru",
                        "Date Created": "12-04-2019 03:55:11",
                        "Upvotes": 2,
                        "Text": "It’s a lot of uphill walking? Idk I’m not a doctor or anything but I’ve gotten some pretty good calf definition while I’m here and I don’t really work out",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f9m0vbw": [
                {
                    "Parent ID": "t1_f9k2c1b",
                    "Comment ID": "f9m0vbw",
                    "Author": "jjfmish",
                    "Date Created": "12-03-2019 23:33:44",
                    "Upvotes": 12,
                    "Text": "Real question: does this sort of short-term crash dieting lead to looking skinny fat or losing weight from unfavourable areas? I deal with binge/restrict cycles and only lose weight through periods of crash dieting and have just accepted that I won’t look the way I want to no matter how much weight I lose doing this unless I start working out and eating at a more modest deficit. But these Korean girls looks great?",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f9md6fb": [
                        {
                            "Parent ID": "t1_f9m0vbw",
                            "Comment ID": "f9md6fb",
                            "Author": "tseokii",
                            "Date Created": "12-04-2019 03:46:08",
                            "Upvotes": 8,
                            "Text": "If you're talking about Kpop idols, they're REALLY skinny. Like, really underweight. But a lot of Koreans have such a small bone structure that even at those low weights, they don't appear too bony or sickly.\n\nAlso idols work out a lot. They spend some ungodly hours dancing and exercising.\n\nNothing can really be done about the areas of your body you LOSE weight from. If you gain weight back quickly, it will tend to gather around your midsection (and very slowly redistribute over time) but I don't think anything impacts how you LOSE it (aside from just your body fat distribution and how your body chooses to lose it)\n\nStarvation diets will do nothing great for your body composition, honestly, because you can't gain muscle on a deficit. In fact, I think any time you lose a lot of fat you tend to lose some muscle as well. So basically, yeah... for a fit body, you do need to exercise. I think working out on a deficit still helps you retain muscle even if losing some of it is inevitable.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9m1o80": [
                        {
                            "Parent ID": "t1_f9m0vbw",
                            "Comment ID": "f9m1o80",
                            "Author": "lshimaru",
                            "Date Created": "12-03-2019 23:46:10",
                            "Upvotes": 10,
                            "Text": "Idk how big of a factor this is but young people in korea walk a lot since taxis and cars are very expensive, so a lot of them have muscular legs and thinner upper bodies. I can’t say I’ve seem anyone of them naked tho so I’m not sure if they’re skinny-fat or just skinny. They also eat a lot of meat so maybe that would help to retain muscle?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f9mkkfe": [
                        {
                            "Parent ID": "t1_f9m0vbw",
                            "Comment ID": "f9mkkfe",
                            "Author": "MissLovelorn",
                            "Date Created": "12-04-2019 06:33:15",
                            "Upvotes": 3,
                            "Text": "I'm not sure but most of the Korean diet videos I've seen also include a lot of toning exercises, especially around the waist/core.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9lgqed": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9lgqed",
                        "Author": "psybeams",
                        "Date Created": "12-03-2019 19:24:48",
                        "Upvotes": 65,
                        "Text": "lmao when i was 15 i cried after eating a blizzard from dq and my mom told me to throw it up if i felt that bad about it and taught me how thus began the fingers down the throat lifestyle lmfao whack",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9lwl4i": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "f9lwl4i",
                            "Author": "bluebrainbethany",
                            "Date Created": "12-03-2019 22:32:49",
                            "Upvotes": 51,
                            "Text": "Wtf your mom needs mother fucking JESUS",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fbjd21m": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "fbjd21m",
                            "Author": "[deleted]",
                            "Date Created": "12-21-2019 06:21:13",
                            "Upvotes": 1,
                            "Text": "The fuck your mum is basically abusive",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9l3km8": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l3km8",
                        "Author": "beets_or_turnips",
                        "Date Created": "12-03-2019 16:54:07",
                        "Upvotes": 25,
                        "Text": "Oh noooooo",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m2fdw": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9m2fdw",
                        "Author": "jjfmish",
                        "Date Created": "12-03-2019 23:58:21",
                        "Upvotes": 25,
                        "Text": "TW: numbers\n\nI’m not Korean but my parents are first-gen Russian immigrants so the culture of fat shaming, normalizing extreme dieting, and glorifying underweight bodies is similar. My mom spent my whole teen years calling me fat and whenever I’d tell her to stop she’d say she was doing it out of love and that Canadian/American parents not being brutally honest with their kids is why these countries have problems with obesity. When I was 18 I went on vacation with a group of my family friends and this woman told my mom “your daughter could be pretty if she lost 30 lbs”. I was like a BMI of 25 or 26 at that point so I was a lil chubby at most but to Russians I might as well have been obese. My mom then told me how she said I needed to lose weight, I said “yeah I know I need to lose like 15lbs” and she was like “haha no 30 at least”. My mom also spent that whole trip talking about what a nice body one of my family friends had. Girl was maybe a very fit BMI of 19 at most, worked out every day of the trip, and pretty much lived off fruit and salad at our all inclusive resort. \n\nGuess who spent the next three years repeatedly losing 10-20 lbs just to gain half of it back each time and dealing with never ending cycles of binging and restriction. I’m down almost 30 lbs now and everyone thinks I just outgrew my chubbiness or developed a healthier/more active lifestyle when I went to college because the weight loss was so gradual and I’m still a healthy weight. In reality, I went from being a teen that comfort ate and had problems with binging to an adult that starves herself and abuses ADHD meds to lose weight but ends up losing it hella slowly because of her binge tendencies, It’s frighteningly easy to hide disordered eating when you’re not the ‘typical sufferer’, especially if you’re in a cultural or family environment that encourages weight loss at all costs.",
                        "Edited?": "12-04-2019 00:07:58",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8b5y": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l8b5y",
                        "Author": "ImperatriceSaltea",
                        "Date Created": "12-03-2019 17:47:05",
                        "Upvotes": 21,
                        "Text": "I feel so sorry for you. Not great to grown up with this :/",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8lfl": [
                [
                    {
                        "Parent ID": "t1_f9l3zcg",
                        "Comment ID": "f9l8lfl",
                        "Author": "tseokii",
                        "Date Created": "12-03-2019 17:50:20",
                        "Upvotes": 13,
                        "Text": "It seems to me that a lot of people are still really put off by the idea of mukbangs/food ASMR specifically even if they're okay about the idea of ASMR videos in general. Like they're okay about the whispering and like idk soap cutting or whatever but nooooooo chewing lol",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9n7uzs": [
                [
                    {
                        "Parent ID": "t1_f9lsn8e",
                        "Comment ID": "f9n7uzs",
                        "Author": "jjfmish",
                        "Date Created": "12-04-2019 11:01:19",
                        "Upvotes": 3,
                        "Text": "Looking back, I’m wondering if Anna Richardson used those early seasons as an excuse to do a ton of crash diets, crazy exercise regimes, and weight loss/toning procedures for free and be forced to stick with them under the guise of ‘testing them’. I think she did end up losing like 25lbs and getting more toned over the first couple of years so I guess it worked? Even if she couldn’t stick to all the diets it definitely made her exercise more regularly and probably made her more conscious of what she was eating outside the show.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mdhj9": [
                [
                    {
                        "Parent ID": "t1_f9m1o80",
                        "Comment ID": "f9mdhj9",
                        "Author": "tseokii",
                        "Date Created": "12-04-2019 03:54:05",
                        "Upvotes": 5,
                        "Text": "> so a lot of them have muscular legs and thinner upper bodies.\n\nHonestly I don't think this has anything to do with walking a lot, this just seems to be the most common body type for Korean women (long torso+short limbs = small waist+thicker legs) Walking doesn't bulk your legs. Otherwise I'd be screwed because I do a ton of walking lol. But I have the opposite body type (short torso+long limbs = fridge waist+thin legs) and my legs are not very muscular.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9mdj2j": [
                        {
                            "Parent ID": "t1_f9mdhj9",
                            "Comment ID": "f9mdj2j",
                            "Author": "lshimaru",
                            "Date Created": "12-04-2019 03:55:11",
                            "Upvotes": 2,
                            "Text": "It’s a lot of uphill walking? Idk I’m not a doctor or anything but I’ve gotten some pretty good calf definition while I’m here and I don’t really work out",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9mzwtm": [
                [
                    {
                        "Parent ID": "t1_f9lwl4i",
                        "Comment ID": "f9mzwtm",
                        "Author": "psybeams",
                        "Date Created": "12-04-2019 09:39:28",
                        "Upvotes": 12,
                        "Text": "looool she denies it even happened like every other shitty thing she’s done to me, it’s all in my head apparently 🤷🏻‍♀️🤷🏻‍♀️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9kylxg": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9kylxg",
                "Author": "mangganese",
                "Date Created": "12-03-2019 16:02:08",
                "Upvotes": 76,
                "Text": "Don't forget supersize v superskinny! but skipping half of the show and only watching the parts I can use for thinspo",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9k3lwi": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9k3lwi",
                "Author": "not_quite_aesthetic",
                "Date Created": "12-03-2019 10:54:27",
                "Upvotes": 130,
                "Text": "That's why I made a separate account just for eating disorder-related videos 👀",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9kbxf1": [
                {
                    "Parent ID": "t1_f9k3lwi",
                    "Comment ID": "f9kbxf1",
                    "Author": "hnr-2000",
                    "Date Created": "12-03-2019 12:20:16",
                    "Upvotes": 45,
                    "Text": "Oh my god why didn’t I think of doing that 😂",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f9lgqed": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9lgqed",
                        "Author": "psybeams",
                        "Date Created": "12-03-2019 19:24:48",
                        "Upvotes": 65,
                        "Text": "lmao when i was 15 i cried after eating a blizzard from dq and my mom told me to throw it up if i felt that bad about it and taught me how thus began the fingers down the throat lifestyle lmfao whack",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9lwl4i": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "f9lwl4i",
                            "Author": "bluebrainbethany",
                            "Date Created": "12-03-2019 22:32:49",
                            "Upvotes": 51,
                            "Text": "Wtf your mom needs mother fucking JESUS",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fbjd21m": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "fbjd21m",
                            "Author": "[deleted]",
                            "Date Created": "12-21-2019 06:21:13",
                            "Upvotes": 1,
                            "Text": "The fuck your mum is basically abusive",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9l3km8": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l3km8",
                        "Author": "beets_or_turnips",
                        "Date Created": "12-03-2019 16:54:07",
                        "Upvotes": 25,
                        "Text": "Oh noooooo",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m2fdw": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9m2fdw",
                        "Author": "jjfmish",
                        "Date Created": "12-03-2019 23:58:21",
                        "Upvotes": 25,
                        "Text": "TW: numbers\n\nI’m not Korean but my parents are first-gen Russian immigrants so the culture of fat shaming, normalizing extreme dieting, and glorifying underweight bodies is similar. My mom spent my whole teen years calling me fat and whenever I’d tell her to stop she’d say she was doing it out of love and that Canadian/American parents not being brutally honest with their kids is why these countries have problems with obesity. When I was 18 I went on vacation with a group of my family friends and this woman told my mom “your daughter could be pretty if she lost 30 lbs”. I was like a BMI of 25 or 26 at that point so I was a lil chubby at most but to Russians I might as well have been obese. My mom then told me how she said I needed to lose weight, I said “yeah I know I need to lose like 15lbs” and she was like “haha no 30 at least”. My mom also spent that whole trip talking about what a nice body one of my family friends had. Girl was maybe a very fit BMI of 19 at most, worked out every day of the trip, and pretty much lived off fruit and salad at our all inclusive resort. \n\nGuess who spent the next three years repeatedly losing 10-20 lbs just to gain half of it back each time and dealing with never ending cycles of binging and restriction. I’m down almost 30 lbs now and everyone thinks I just outgrew my chubbiness or developed a healthier/more active lifestyle when I went to college because the weight loss was so gradual and I’m still a healthy weight. In reality, I went from being a teen that comfort ate and had problems with binging to an adult that starves herself and abuses ADHD meds to lose weight but ends up losing it hella slowly because of her binge tendencies, It’s frighteningly easy to hide disordered eating when you’re not the ‘typical sufferer’, especially if you’re in a cultural or family environment that encourages weight loss at all costs.",
                        "Edited?": "12-04-2019 00:07:58",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8b5y": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l8b5y",
                        "Author": "ImperatriceSaltea",
                        "Date Created": "12-03-2019 17:47:05",
                        "Upvotes": 21,
                        "Text": "I feel so sorry for you. Not great to grown up with this :/",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9md6fb": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9md6fb",
                        "Author": "tseokii",
                        "Date Created": "12-04-2019 03:46:08",
                        "Upvotes": 8,
                        "Text": "If you're talking about Kpop idols, they're REALLY skinny. Like, really underweight. But a lot of Koreans have such a small bone structure that even at those low weights, they don't appear too bony or sickly.\n\nAlso idols work out a lot. They spend some ungodly hours dancing and exercising.\n\nNothing can really be done about the areas of your body you LOSE weight from. If you gain weight back quickly, it will tend to gather around your midsection (and very slowly redistribute over time) but I don't think anything impacts how you LOSE it (aside from just your body fat distribution and how your body chooses to lose it)\n\nStarvation diets will do nothing great for your body composition, honestly, because you can't gain muscle on a deficit. In fact, I think any time you lose a lot of fat you tend to lose some muscle as well. So basically, yeah... for a fit body, you do need to exercise. I think working out on a deficit still helps you retain muscle even if losing some of it is inevitable.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m1o80": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9m1o80",
                        "Author": "lshimaru",
                        "Date Created": "12-03-2019 23:46:10",
                        "Upvotes": 10,
                        "Text": "Idk how big of a factor this is but young people in korea walk a lot since taxis and cars are very expensive, so a lot of them have muscular legs and thinner upper bodies. I can’t say I’ve seem anyone of them naked tho so I’m not sure if they’re skinny-fat or just skinny. They also eat a lot of meat so maybe that would help to retain muscle?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9mdhj9": [
                        {
                            "Parent ID": "t1_f9m1o80",
                            "Comment ID": "f9mdhj9",
                            "Author": "tseokii",
                            "Date Created": "12-04-2019 03:54:05",
                            "Upvotes": 5,
                            "Text": "> so a lot of them have muscular legs and thinner upper bodies.\n\nHonestly I don't think this has anything to do with walking a lot, this just seems to be the most common body type for Korean women (long torso+short limbs = small waist+thicker legs) Walking doesn't bulk your legs. Otherwise I'd be screwed because I do a ton of walking lol. But I have the opposite body type (short torso+long limbs = fridge waist+thin legs) and my legs are not very muscular.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9mkkfe": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9mkkfe",
                        "Author": "MissLovelorn",
                        "Date Created": "12-04-2019 06:33:15",
                        "Upvotes": 3,
                        "Text": "I'm not sure but most of the Korean diet videos I've seen also include a lot of toning exercises, especially around the waist/core.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8lfl": [
                [
                    {
                        "Parent ID": "t1_f9l3zcg",
                        "Comment ID": "f9l8lfl",
                        "Author": "tseokii",
                        "Date Created": "12-03-2019 17:50:20",
                        "Upvotes": 13,
                        "Text": "It seems to me that a lot of people are still really put off by the idea of mukbangs/food ASMR specifically even if they're okay about the idea of ASMR videos in general. Like they're okay about the whispering and like idk soap cutting or whatever but nooooooo chewing lol",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9n7uzs": [
                [
                    {
                        "Parent ID": "t1_f9lsn8e",
                        "Comment ID": "f9n7uzs",
                        "Author": "jjfmish",
                        "Date Created": "12-04-2019 11:01:19",
                        "Upvotes": 3,
                        "Text": "Looking back, I’m wondering if Anna Richardson used those early seasons as an excuse to do a ton of crash diets, crazy exercise regimes, and weight loss/toning procedures for free and be forced to stick with them under the guise of ‘testing them’. I think she did end up losing like 25lbs and getting more toned over the first couple of years so I guess it worked? Even if she couldn’t stick to all the diets it definitely made her exercise more regularly and probably made her more conscious of what she was eating outside the show.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mzwtm": [
                [
                    {
                        "Parent ID": "t1_f9lwl4i",
                        "Comment ID": "f9mzwtm",
                        "Author": "psybeams",
                        "Date Created": "12-04-2019 09:39:28",
                        "Upvotes": 12,
                        "Text": "looool she denies it even happened like every other shitty thing she’s done to me, it’s all in my head apparently 🤷🏻‍♀️🤷🏻‍♀️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mdj2j": [
                [
                    {
                        "Parent ID": "t1_f9mdhj9",
                        "Comment ID": "f9mdj2j",
                        "Author": "lshimaru",
                        "Date Created": "12-04-2019 03:55:11",
                        "Upvotes": 2,
                        "Text": "It’s a lot of uphill walking? Idk I’m not a doctor or anything but I’ve gotten some pretty good calf definition while I’m here and I don’t really work out",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f9llku3": [
                {
                    "Parent ID": "t1_f9k3lwi",
                    "Comment ID": "f9llku3",
                    "Author": "velocity2ds",
                    "Date Created": "12-03-2019 20:21:05",
                    "Upvotes": 17,
                    "Text": "My brother signed in on his YouTube account once on my laptop and I never signed out so he’s just stuck seeing my nonsense recommenced back to him",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f9lgqed": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9lgqed",
                        "Author": "psybeams",
                        "Date Created": "12-03-2019 19:24:48",
                        "Upvotes": 65,
                        "Text": "lmao when i was 15 i cried after eating a blizzard from dq and my mom told me to throw it up if i felt that bad about it and taught me how thus began the fingers down the throat lifestyle lmfao whack",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9lwl4i": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "f9lwl4i",
                            "Author": "bluebrainbethany",
                            "Date Created": "12-03-2019 22:32:49",
                            "Upvotes": 51,
                            "Text": "Wtf your mom needs mother fucking JESUS",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fbjd21m": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "fbjd21m",
                            "Author": "[deleted]",
                            "Date Created": "12-21-2019 06:21:13",
                            "Upvotes": 1,
                            "Text": "The fuck your mum is basically abusive",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9l3km8": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l3km8",
                        "Author": "beets_or_turnips",
                        "Date Created": "12-03-2019 16:54:07",
                        "Upvotes": 25,
                        "Text": "Oh noooooo",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m2fdw": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9m2fdw",
                        "Author": "jjfmish",
                        "Date Created": "12-03-2019 23:58:21",
                        "Upvotes": 25,
                        "Text": "TW: numbers\n\nI’m not Korean but my parents are first-gen Russian immigrants so the culture of fat shaming, normalizing extreme dieting, and glorifying underweight bodies is similar. My mom spent my whole teen years calling me fat and whenever I’d tell her to stop she’d say she was doing it out of love and that Canadian/American parents not being brutally honest with their kids is why these countries have problems with obesity. When I was 18 I went on vacation with a group of my family friends and this woman told my mom “your daughter could be pretty if she lost 30 lbs”. I was like a BMI of 25 or 26 at that point so I was a lil chubby at most but to Russians I might as well have been obese. My mom then told me how she said I needed to lose weight, I said “yeah I know I need to lose like 15lbs” and she was like “haha no 30 at least”. My mom also spent that whole trip talking about what a nice body one of my family friends had. Girl was maybe a very fit BMI of 19 at most, worked out every day of the trip, and pretty much lived off fruit and salad at our all inclusive resort. \n\nGuess who spent the next three years repeatedly losing 10-20 lbs just to gain half of it back each time and dealing with never ending cycles of binging and restriction. I’m down almost 30 lbs now and everyone thinks I just outgrew my chubbiness or developed a healthier/more active lifestyle when I went to college because the weight loss was so gradual and I’m still a healthy weight. In reality, I went from being a teen that comfort ate and had problems with binging to an adult that starves herself and abuses ADHD meds to lose weight but ends up losing it hella slowly because of her binge tendencies, It’s frighteningly easy to hide disordered eating when you’re not the ‘typical sufferer’, especially if you’re in a cultural or family environment that encourages weight loss at all costs.",
                        "Edited?": "12-04-2019 00:07:58",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8b5y": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l8b5y",
                        "Author": "ImperatriceSaltea",
                        "Date Created": "12-03-2019 17:47:05",
                        "Upvotes": 21,
                        "Text": "I feel so sorry for you. Not great to grown up with this :/",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9md6fb": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9md6fb",
                        "Author": "tseokii",
                        "Date Created": "12-04-2019 03:46:08",
                        "Upvotes": 8,
                        "Text": "If you're talking about Kpop idols, they're REALLY skinny. Like, really underweight. But a lot of Koreans have such a small bone structure that even at those low weights, they don't appear too bony or sickly.\n\nAlso idols work out a lot. They spend some ungodly hours dancing and exercising.\n\nNothing can really be done about the areas of your body you LOSE weight from. If you gain weight back quickly, it will tend to gather around your midsection (and very slowly redistribute over time) but I don't think anything impacts how you LOSE it (aside from just your body fat distribution and how your body chooses to lose it)\n\nStarvation diets will do nothing great for your body composition, honestly, because you can't gain muscle on a deficit. In fact, I think any time you lose a lot of fat you tend to lose some muscle as well. So basically, yeah... for a fit body, you do need to exercise. I think working out on a deficit still helps you retain muscle even if losing some of it is inevitable.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m1o80": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9m1o80",
                        "Author": "lshimaru",
                        "Date Created": "12-03-2019 23:46:10",
                        "Upvotes": 10,
                        "Text": "Idk how big of a factor this is but young people in korea walk a lot since taxis and cars are very expensive, so a lot of them have muscular legs and thinner upper bodies. I can’t say I’ve seem anyone of them naked tho so I’m not sure if they’re skinny-fat or just skinny. They also eat a lot of meat so maybe that would help to retain muscle?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9mdhj9": [
                        {
                            "Parent ID": "t1_f9m1o80",
                            "Comment ID": "f9mdhj9",
                            "Author": "tseokii",
                            "Date Created": "12-04-2019 03:54:05",
                            "Upvotes": 5,
                            "Text": "> so a lot of them have muscular legs and thinner upper bodies.\n\nHonestly I don't think this has anything to do with walking a lot, this just seems to be the most common body type for Korean women (long torso+short limbs = small waist+thicker legs) Walking doesn't bulk your legs. Otherwise I'd be screwed because I do a ton of walking lol. But I have the opposite body type (short torso+long limbs = fridge waist+thin legs) and my legs are not very muscular.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9mkkfe": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9mkkfe",
                        "Author": "MissLovelorn",
                        "Date Created": "12-04-2019 06:33:15",
                        "Upvotes": 3,
                        "Text": "I'm not sure but most of the Korean diet videos I've seen also include a lot of toning exercises, especially around the waist/core.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8lfl": [
                [
                    {
                        "Parent ID": "t1_f9l3zcg",
                        "Comment ID": "f9l8lfl",
                        "Author": "tseokii",
                        "Date Created": "12-03-2019 17:50:20",
                        "Upvotes": 13,
                        "Text": "It seems to me that a lot of people are still really put off by the idea of mukbangs/food ASMR specifically even if they're okay about the idea of ASMR videos in general. Like they're okay about the whispering and like idk soap cutting or whatever but nooooooo chewing lol",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9n7uzs": [
                [
                    {
                        "Parent ID": "t1_f9lsn8e",
                        "Comment ID": "f9n7uzs",
                        "Author": "jjfmish",
                        "Date Created": "12-04-2019 11:01:19",
                        "Upvotes": 3,
                        "Text": "Looking back, I’m wondering if Anna Richardson used those early seasons as an excuse to do a ton of crash diets, crazy exercise regimes, and weight loss/toning procedures for free and be forced to stick with them under the guise of ‘testing them’. I think she did end up losing like 25lbs and getting more toned over the first couple of years so I guess it worked? Even if she couldn’t stick to all the diets it definitely made her exercise more regularly and probably made her more conscious of what she was eating outside the show.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mzwtm": [
                [
                    {
                        "Parent ID": "t1_f9lwl4i",
                        "Comment ID": "f9mzwtm",
                        "Author": "psybeams",
                        "Date Created": "12-04-2019 09:39:28",
                        "Upvotes": 12,
                        "Text": "looool she denies it even happened like every other shitty thing she’s done to me, it’s all in my head apparently 🤷🏻‍♀️🤷🏻‍♀️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mdj2j": [
                [
                    {
                        "Parent ID": "t1_f9mdhj9",
                        "Comment ID": "f9mdj2j",
                        "Author": "lshimaru",
                        "Date Created": "12-04-2019 03:55:11",
                        "Upvotes": 2,
                        "Text": "It’s a lot of uphill walking? Idk I’m not a doctor or anything but I’ve gotten some pretty good calf definition while I’m here and I don’t really work out",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9kf296": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9kf296",
                "Author": "incompetentbeing",
                "Date Created": "12-03-2019 12:51:40",
                "Upvotes": 56,
                "Text": "Once in a meeting, I was ambushed with a request to pull something up on YoutTube and share my screen. I didn't have the sense to quickly log out. All my ASMR videos made me look like such a perv.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9l3zcg": [
                {
                    "Parent ID": "t1_f9kf296",
                    "Comment ID": "f9l3zcg",
                    "Author": "beets_or_turnips",
                    "Date Created": "12-03-2019 16:58:32",
                    "Upvotes": 22,
                    "Text": "Yeah? I thought ASMR videos were a pretty mainstream thing now.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f9l8lfl": [
                        {
                            "Parent ID": "t1_f9l3zcg",
                            "Comment ID": "f9l8lfl",
                            "Author": "tseokii",
                            "Date Created": "12-03-2019 17:50:20",
                            "Upvotes": 13,
                            "Text": "It seems to me that a lot of people are still really put off by the idea of mukbangs/food ASMR specifically even if they're okay about the idea of ASMR videos in general. Like they're okay about the whispering and like idk soap cutting or whatever but nooooooo chewing lol",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9lgqed": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9lgqed",
                        "Author": "psybeams",
                        "Date Created": "12-03-2019 19:24:48",
                        "Upvotes": 65,
                        "Text": "lmao when i was 15 i cried after eating a blizzard from dq and my mom told me to throw it up if i felt that bad about it and taught me how thus began the fingers down the throat lifestyle lmfao whack",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9lwl4i": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "f9lwl4i",
                            "Author": "bluebrainbethany",
                            "Date Created": "12-03-2019 22:32:49",
                            "Upvotes": 51,
                            "Text": "Wtf your mom needs mother fucking JESUS",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fbjd21m": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "fbjd21m",
                            "Author": "[deleted]",
                            "Date Created": "12-21-2019 06:21:13",
                            "Upvotes": 1,
                            "Text": "The fuck your mum is basically abusive",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9l3km8": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l3km8",
                        "Author": "beets_or_turnips",
                        "Date Created": "12-03-2019 16:54:07",
                        "Upvotes": 25,
                        "Text": "Oh noooooo",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m2fdw": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9m2fdw",
                        "Author": "jjfmish",
                        "Date Created": "12-03-2019 23:58:21",
                        "Upvotes": 25,
                        "Text": "TW: numbers\n\nI’m not Korean but my parents are first-gen Russian immigrants so the culture of fat shaming, normalizing extreme dieting, and glorifying underweight bodies is similar. My mom spent my whole teen years calling me fat and whenever I’d tell her to stop she’d say she was doing it out of love and that Canadian/American parents not being brutally honest with their kids is why these countries have problems with obesity. When I was 18 I went on vacation with a group of my family friends and this woman told my mom “your daughter could be pretty if she lost 30 lbs”. I was like a BMI of 25 or 26 at that point so I was a lil chubby at most but to Russians I might as well have been obese. My mom then told me how she said I needed to lose weight, I said “yeah I know I need to lose like 15lbs” and she was like “haha no 30 at least”. My mom also spent that whole trip talking about what a nice body one of my family friends had. Girl was maybe a very fit BMI of 19 at most, worked out every day of the trip, and pretty much lived off fruit and salad at our all inclusive resort. \n\nGuess who spent the next three years repeatedly losing 10-20 lbs just to gain half of it back each time and dealing with never ending cycles of binging and restriction. I’m down almost 30 lbs now and everyone thinks I just outgrew my chubbiness or developed a healthier/more active lifestyle when I went to college because the weight loss was so gradual and I’m still a healthy weight. In reality, I went from being a teen that comfort ate and had problems with binging to an adult that starves herself and abuses ADHD meds to lose weight but ends up losing it hella slowly because of her binge tendencies, It’s frighteningly easy to hide disordered eating when you’re not the ‘typical sufferer’, especially if you’re in a cultural or family environment that encourages weight loss at all costs.",
                        "Edited?": "12-04-2019 00:07:58",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8b5y": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l8b5y",
                        "Author": "ImperatriceSaltea",
                        "Date Created": "12-03-2019 17:47:05",
                        "Upvotes": 21,
                        "Text": "I feel so sorry for you. Not great to grown up with this :/",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9md6fb": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9md6fb",
                        "Author": "tseokii",
                        "Date Created": "12-04-2019 03:46:08",
                        "Upvotes": 8,
                        "Text": "If you're talking about Kpop idols, they're REALLY skinny. Like, really underweight. But a lot of Koreans have such a small bone structure that even at those low weights, they don't appear too bony or sickly.\n\nAlso idols work out a lot. They spend some ungodly hours dancing and exercising.\n\nNothing can really be done about the areas of your body you LOSE weight from. If you gain weight back quickly, it will tend to gather around your midsection (and very slowly redistribute over time) but I don't think anything impacts how you LOSE it (aside from just your body fat distribution and how your body chooses to lose it)\n\nStarvation diets will do nothing great for your body composition, honestly, because you can't gain muscle on a deficit. In fact, I think any time you lose a lot of fat you tend to lose some muscle as well. So basically, yeah... for a fit body, you do need to exercise. I think working out on a deficit still helps you retain muscle even if losing some of it is inevitable.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m1o80": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9m1o80",
                        "Author": "lshimaru",
                        "Date Created": "12-03-2019 23:46:10",
                        "Upvotes": 10,
                        "Text": "Idk how big of a factor this is but young people in korea walk a lot since taxis and cars are very expensive, so a lot of them have muscular legs and thinner upper bodies. I can’t say I’ve seem anyone of them naked tho so I’m not sure if they’re skinny-fat or just skinny. They also eat a lot of meat so maybe that would help to retain muscle?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9mdhj9": [
                        {
                            "Parent ID": "t1_f9m1o80",
                            "Comment ID": "f9mdhj9",
                            "Author": "tseokii",
                            "Date Created": "12-04-2019 03:54:05",
                            "Upvotes": 5,
                            "Text": "> so a lot of them have muscular legs and thinner upper bodies.\n\nHonestly I don't think this has anything to do with walking a lot, this just seems to be the most common body type for Korean women (long torso+short limbs = small waist+thicker legs) Walking doesn't bulk your legs. Otherwise I'd be screwed because I do a ton of walking lol. But I have the opposite body type (short torso+long limbs = fridge waist+thin legs) and my legs are not very muscular.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9mkkfe": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9mkkfe",
                        "Author": "MissLovelorn",
                        "Date Created": "12-04-2019 06:33:15",
                        "Upvotes": 3,
                        "Text": "I'm not sure but most of the Korean diet videos I've seen also include a lot of toning exercises, especially around the waist/core.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f9n7uzs": [
                [
                    {
                        "Parent ID": "t1_f9lsn8e",
                        "Comment ID": "f9n7uzs",
                        "Author": "jjfmish",
                        "Date Created": "12-04-2019 11:01:19",
                        "Upvotes": 3,
                        "Text": "Looking back, I’m wondering if Anna Richardson used those early seasons as an excuse to do a ton of crash diets, crazy exercise regimes, and weight loss/toning procedures for free and be forced to stick with them under the guise of ‘testing them’. I think she did end up losing like 25lbs and getting more toned over the first couple of years so I guess it worked? Even if she couldn’t stick to all the diets it definitely made her exercise more regularly and probably made her more conscious of what she was eating outside the show.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mzwtm": [
                [
                    {
                        "Parent ID": "t1_f9lwl4i",
                        "Comment ID": "f9mzwtm",
                        "Author": "psybeams",
                        "Date Created": "12-04-2019 09:39:28",
                        "Upvotes": 12,
                        "Text": "looool she denies it even happened like every other shitty thing she’s done to me, it’s all in my head apparently 🤷🏻‍♀️🤷🏻‍♀️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mdj2j": [
                [
                    {
                        "Parent ID": "t1_f9mdhj9",
                        "Comment ID": "f9mdj2j",
                        "Author": "lshimaru",
                        "Date Created": "12-04-2019 03:55:11",
                        "Upvotes": 2,
                        "Text": "It’s a lot of uphill walking? Idk I’m not a doctor or anything but I’ve gotten some pretty good calf definition while I’m here and I don’t really work out",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9ks2b4": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9ks2b4",
                "Author": "ks788",
                "Date Created": "12-03-2019 14:58:50",
                "Upvotes": 108,
                "Text": "Korean Diet culture is so fascinating like they think it’s completely normal to starve yourself to lose weight and don’t question it. I was watching a Korean reality tv show and one girl said that she eats like 300 calories and workouts for 4 hours and everyone was like “oh cool”",
                "Edited?": "12-03-2019 15:37:11",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9kn4nj": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9kn4nj",
                "Author": "karmarell",
                "Date Created": "12-03-2019 14:11:17",
                "Upvotes": 50,
                "Text": "Yeah, 'Secret Eaters', hoarding videos, dating experiences as a fat woman and plus size hauls. I love watching these kind of videos for some reason although I've never been overweight. My account is a collection of embarrassment 😆",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9llpr0": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9llpr0",
                "Author": "LilBpixi3",
                "Date Created": "12-03-2019 20:22:37",
                "Upvotes": 17,
                "Text": "Same but also Amber Lyn Reid reaction videos",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9lblxe": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9lblxe",
                "Author": "Whitepetticoat",
                "Date Created": "12-03-2019 18:25:20",
                "Upvotes": 15,
                "Text": "When that happens I clear my search and watch history and it goes away.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9l2st3": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9l2st3",
                "Author": "prettyweeper",
                "Date Created": "12-03-2019 16:45:47",
                "Upvotes": 11,
                "Text": "same here tbh. i have had people see it before it’s pretty embarrassing (‘:",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9llhl5": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9llhl5",
                "Author": "velocity2ds",
                "Date Created": "12-03-2019 20:20:04",
                "Upvotes": 12,
                "Text": "Now you got me in the mood for some supersize and super skinny",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f9lsn8e": [
                {
                    "Parent ID": "t1_f9llhl5",
                    "Comment ID": "f9lsn8e",
                    "Author": "scarlettanneblack",
                    "Date Created": "12-03-2019 21:42:48",
                    "Upvotes": 7,
                    "Text": "That apple diet episode!  Gawd.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f9n7uzs": [
                        {
                            "Parent ID": "t1_f9lsn8e",
                            "Comment ID": "f9n7uzs",
                            "Author": "jjfmish",
                            "Date Created": "12-04-2019 11:01:19",
                            "Upvotes": 3,
                            "Text": "Looking back, I’m wondering if Anna Richardson used those early seasons as an excuse to do a ton of crash diets, crazy exercise regimes, and weight loss/toning procedures for free and be forced to stick with them under the guise of ‘testing them’. I think she did end up losing like 25lbs and getting more toned over the first couple of years so I guess it worked? Even if she couldn’t stick to all the diets it definitely made her exercise more regularly and probably made her more conscious of what she was eating outside the show.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9lgqed": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9lgqed",
                        "Author": "psybeams",
                        "Date Created": "12-03-2019 19:24:48",
                        "Upvotes": 65,
                        "Text": "lmao when i was 15 i cried after eating a blizzard from dq and my mom told me to throw it up if i felt that bad about it and taught me how thus began the fingers down the throat lifestyle lmfao whack",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9lwl4i": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "f9lwl4i",
                            "Author": "bluebrainbethany",
                            "Date Created": "12-03-2019 22:32:49",
                            "Upvotes": 51,
                            "Text": "Wtf your mom needs mother fucking JESUS",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fbjd21m": [
                        {
                            "Parent ID": "t1_f9lgqed",
                            "Comment ID": "fbjd21m",
                            "Author": "[deleted]",
                            "Date Created": "12-21-2019 06:21:13",
                            "Upvotes": 1,
                            "Text": "The fuck your mum is basically abusive",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9l3km8": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l3km8",
                        "Author": "beets_or_turnips",
                        "Date Created": "12-03-2019 16:54:07",
                        "Upvotes": 25,
                        "Text": "Oh noooooo",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m2fdw": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9m2fdw",
                        "Author": "jjfmish",
                        "Date Created": "12-03-2019 23:58:21",
                        "Upvotes": 25,
                        "Text": "TW: numbers\n\nI’m not Korean but my parents are first-gen Russian immigrants so the culture of fat shaming, normalizing extreme dieting, and glorifying underweight bodies is similar. My mom spent my whole teen years calling me fat and whenever I’d tell her to stop she’d say she was doing it out of love and that Canadian/American parents not being brutally honest with their kids is why these countries have problems with obesity. When I was 18 I went on vacation with a group of my family friends and this woman told my mom “your daughter could be pretty if she lost 30 lbs”. I was like a BMI of 25 or 26 at that point so I was a lil chubby at most but to Russians I might as well have been obese. My mom then told me how she said I needed to lose weight, I said “yeah I know I need to lose like 15lbs” and she was like “haha no 30 at least”. My mom also spent that whole trip talking about what a nice body one of my family friends had. Girl was maybe a very fit BMI of 19 at most, worked out every day of the trip, and pretty much lived off fruit and salad at our all inclusive resort. \n\nGuess who spent the next three years repeatedly losing 10-20 lbs just to gain half of it back each time and dealing with never ending cycles of binging and restriction. I’m down almost 30 lbs now and everyone thinks I just outgrew my chubbiness or developed a healthier/more active lifestyle when I went to college because the weight loss was so gradual and I’m still a healthy weight. In reality, I went from being a teen that comfort ate and had problems with binging to an adult that starves herself and abuses ADHD meds to lose weight but ends up losing it hella slowly because of her binge tendencies, It’s frighteningly easy to hide disordered eating when you’re not the ‘typical sufferer’, especially if you’re in a cultural or family environment that encourages weight loss at all costs.",
                        "Edited?": "12-04-2019 00:07:58",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8b5y": [
                [
                    {
                        "Parent ID": "t1_f9khqrs",
                        "Comment ID": "f9l8b5y",
                        "Author": "ImperatriceSaltea",
                        "Date Created": "12-03-2019 17:47:05",
                        "Upvotes": 21,
                        "Text": "I feel so sorry for you. Not great to grown up with this :/",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9md6fb": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9md6fb",
                        "Author": "tseokii",
                        "Date Created": "12-04-2019 03:46:08",
                        "Upvotes": 8,
                        "Text": "If you're talking about Kpop idols, they're REALLY skinny. Like, really underweight. But a lot of Koreans have such a small bone structure that even at those low weights, they don't appear too bony or sickly.\n\nAlso idols work out a lot. They spend some ungodly hours dancing and exercising.\n\nNothing can really be done about the areas of your body you LOSE weight from. If you gain weight back quickly, it will tend to gather around your midsection (and very slowly redistribute over time) but I don't think anything impacts how you LOSE it (aside from just your body fat distribution and how your body chooses to lose it)\n\nStarvation diets will do nothing great for your body composition, honestly, because you can't gain muscle on a deficit. In fact, I think any time you lose a lot of fat you tend to lose some muscle as well. So basically, yeah... for a fit body, you do need to exercise. I think working out on a deficit still helps you retain muscle even if losing some of it is inevitable.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9m1o80": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9m1o80",
                        "Author": "lshimaru",
                        "Date Created": "12-03-2019 23:46:10",
                        "Upvotes": 10,
                        "Text": "Idk how big of a factor this is but young people in korea walk a lot since taxis and cars are very expensive, so a lot of them have muscular legs and thinner upper bodies. I can’t say I’ve seem anyone of them naked tho so I’m not sure if they’re skinny-fat or just skinny. They also eat a lot of meat so maybe that would help to retain muscle?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f9mdhj9": [
                        {
                            "Parent ID": "t1_f9m1o80",
                            "Comment ID": "f9mdhj9",
                            "Author": "tseokii",
                            "Date Created": "12-04-2019 03:54:05",
                            "Upvotes": 5,
                            "Text": "> so a lot of them have muscular legs and thinner upper bodies.\n\nHonestly I don't think this has anything to do with walking a lot, this just seems to be the most common body type for Korean women (long torso+short limbs = small waist+thicker legs) Walking doesn't bulk your legs. Otherwise I'd be screwed because I do a ton of walking lol. But I have the opposite body type (short torso+long limbs = fridge waist+thin legs) and my legs are not very muscular.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f9mkkfe": [
                [
                    {
                        "Parent ID": "t1_f9m0vbw",
                        "Comment ID": "f9mkkfe",
                        "Author": "MissLovelorn",
                        "Date Created": "12-04-2019 06:33:15",
                        "Upvotes": 3,
                        "Text": "I'm not sure but most of the Korean diet videos I've seen also include a lot of toning exercises, especially around the waist/core.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f9l8lfl": [
                [
                    {
                        "Parent ID": "t1_f9l3zcg",
                        "Comment ID": "f9l8lfl",
                        "Author": "tseokii",
                        "Date Created": "12-03-2019 17:50:20",
                        "Upvotes": 13,
                        "Text": "It seems to me that a lot of people are still really put off by the idea of mukbangs/food ASMR specifically even if they're okay about the idea of ASMR videos in general. Like they're okay about the whispering and like idk soap cutting or whatever but nooooooo chewing lol",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mzwtm": [
                [
                    {
                        "Parent ID": "t1_f9lwl4i",
                        "Comment ID": "f9mzwtm",
                        "Author": "psybeams",
                        "Date Created": "12-04-2019 09:39:28",
                        "Upvotes": 12,
                        "Text": "looool she denies it even happened like every other shitty thing she’s done to me, it’s all in my head apparently 🤷🏻‍♀️🤷🏻‍♀️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f9mdj2j": [
                [
                    {
                        "Parent ID": "t1_f9mdhj9",
                        "Comment ID": "f9mdj2j",
                        "Author": "lshimaru",
                        "Date Created": "12-04-2019 03:55:11",
                        "Upvotes": 2,
                        "Text": "It’s a lot of uphill walking? Idk I’m not a doctor or anything but I’ve gotten some pretty good calf definition while I’m here and I don’t really work out",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f9m5exb": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9m5exb",
                "Author": "a9zm",
                "Date Created": "12-04-2019 00:51:11",
                "Upvotes": 9,
                "Text": "My TA in college (programming course) was looking over to check my work and I accidentally opened the tab with my YouTube homepage and he’s just like ‘oh you’re really into health huh’? And I joking (but not ironically) went ‘oh yep, big fan!’\n\nRIP lol",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9ko7nc": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9ko7nc",
                "Author": "KATTxxK",
                "Date Created": "12-03-2019 14:21:48",
                "Upvotes": 7,
                "Text": "Same here too .",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9l7q6s": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9l7q6s",
                "Author": "girlmewse",
                "Date Created": "12-03-2019 17:40:25",
                "Upvotes": 8,
                "Text": "Same, can’t open tumblr either.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9lax6z": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9lax6z",
                "Author": "Ta1kativ",
                "Date Created": "12-03-2019 18:17:23",
                "Upvotes": 8,
                "Text": "That’s why I have 2 accounts",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9lpbg5": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9lpbg5",
                "Author": "spookyfuck79",
                "Date Created": "12-03-2019 21:03:27",
                "Upvotes": 5,
                "Text": "Mine is full of supersize vs superskinny",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9ltts8": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9ltts8",
                "Author": "sicsicsickkk",
                "Date Created": "12-03-2019 21:57:19",
                "Upvotes": 6,
                "Text": "I’m just waiting for my bf to mention something about my supersize vs super skinny video recs 😂",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9n84cf": [
        [
            {
                "Parent ID": "t3_e5jpea",
                "Comment ID": "f9n84cf",
                "Author": "jjfmish",
                "Date Created": "12-04-2019 11:03:57",
                "Upvotes": 3,
                "Text": "Hahahaha hahaha omg the panic when you have friends coming over and they say they’re almost there and you have to rush to sign out of YouTube and pretend it’s totally normal that you don’t have an account.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}