{
    "ekus6fv": [
        [
            {
                "Parent ID": "t3_bcz2ds",
                "Comment ID": "ekus6fv",
                "Author": "eardingu",
                "Date Created": "04-14-2019 00:56:03",
                "Upvotes": 67,
                "Text": "We'll never be content with our body but we'll still continue our behaviors 😔",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekuw2xp": [
        [
            {
                "Parent ID": "t3_bcz2ds",
                "Comment ID": "ekuw2xp",
                "Author": "Free_Tacos_4Everyone",
                "Date Created": "04-14-2019 02:27:11",
                "Upvotes": 46,
                "Text": "Man, fuuuuuuck body dysmorphia. Its such a major cockblock. Im sorry, I wish you happiness, whatever that may entail.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekuybdb": [
        [
            {
                "Parent ID": "t3_bcz2ds",
                "Comment ID": "ekuybdb",
                "Author": "MyNamelessFace",
                "Date Created": "04-14-2019 03:28:14",
                "Upvotes": 31,
                "Text": "I know what you feel like. \\*hug\\*\n\nA few years ago I reached my goalweight of 94lbs (I'm really short, so that's not too low) and made up a new goalweight, because I still wasn't happy with my body. But i was so frustrated that in the end I gained weight to 115lbs... But when I looked back at photos of myself with 94-95lbs, I saw a slim figure and just wished I'd stayed that weight. Now I am 101lbs and slowly trying to reach 95lbs again, but even though I see that I lose weight, I'm (again!!) not happy with my body and won't be at my goal weight. It's ridiculous  \nThis downward spiral just sucks and I feel you.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ekv2zd2": [
                {
                    "Parent ID": "t1_ekuybdb",
                    "Comment ID": "ekv2zd2",
                    "Author": "mewme-mow",
                    "Date Created": "04-14-2019 05:48:14",
                    "Upvotes": 8,
                    "Text": "i was fine at one point then i figured i looked horrible and lost some weight, now looking back at photos i even prefer that but i'm being an idiot about it - like i'm trying to gain a little bit but then i keep watching myself to not gain at all. even though that's supposed to be the point. i'm afraid if i'll go higher i'll start preferring how i look  now. it seems to come around in cycles. although, i did notice that if i have more affinity for life (lol) then i want to weigh more. if i feel low then it's like NO I CAN'T LOOK LIKE A GROWN WOMAN. i wonder what freud would think about that",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "ekuzcx7": [
        [
            {
                "Parent ID": "t3_bcz2ds",
                "Comment ID": "ekuzcx7",
                "Author": "everythingabove02",
                "Date Created": "04-14-2019 03:59:03",
                "Upvotes": 7,
                "Text": "This is just a endless spiral... A mean circle, I really hope you one day will break",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekvepdq": [
        [
            {
                "Parent ID": "t3_bcz2ds",
                "Comment ID": "ekvepdq",
                "Author": "teamobliterator",
                "Date Created": "04-14-2019 09:35:48",
                "Upvotes": 7,
                "Text": "Try now eating at maintenance and staying at that weight for a bit. See if it makes you feel different mentally. I know I did that and it seemed like my hormones kicked back into gear and I felt great.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ekzo4aw": [
                {
                    "Parent ID": "t1_ekvepdq",
                    "Comment ID": "ekzo4aw",
                    "Author": "softcoffee",
                    "Date Created": "04-15-2019 21:17:04",
                    "Upvotes": 1,
                    "Text": "I agree with this 100%\n\nOP try to stay at maintanence calories. Gaining might make you want to restrict again, and lowering your goal just makes this continue. I think being at maintanence will give you a change to assess your body, relax your eating and see how you feel about it all.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "ekv628l": [
        [
            {
                "Parent ID": "t3_bcz2ds",
                "Comment ID": "ekv628l",
                "Author": "danimarie82",
                "Date Created": "04-14-2019 07:05:11",
                "Upvotes": 5,
                "Text": "I can relate. I hit my lowest weight about a month ago and then started on this insane period of binge eating that has made me gain 10 pounds in the last month. Even though I know that it's only 10 pounds, I FEEL like I'm as big as I was at my highest. I know that it's just my body in survival mode right now but I've literally been praying for the ability for the hardcore restricting to return. It's an awful cycle and I wish you peace.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekw23j0": [
        [
            {
                "Parent ID": "t3_bcz2ds",
                "Comment ID": "ekw23j0",
                "Author": "orthofuckyrself",
                "Date Created": "04-14-2019 14:27:17",
                "Upvotes": 3,
                "Text": ">Like what the fuck do I do now lmao\n\nMaintain and focus on fitness and feeling good. Your body image will catch up, and your relationship with food will begin to heal.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ekuxw88": [
        [
            {
                "Parent ID": "t3_bcz2ds",
                "Comment ID": "ekuxw88",
                "Author": "coffeecreamer06",
                "Date Created": "04-14-2019 03:16:10",
                "Upvotes": -2,
                "Text": "Even though you feel that way, congratulations 💖💖💖",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}