{
    "eoljc2o": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eoljc2o",
                "Author": "pabstpumpkinbeer",
                "Date Created": "05-23-2019 23:22:28",
                "Upvotes": 220,
                "Text": "BED is a real, valid, eating disorder. I care about it. I care about you. Your struggles are valid and your feelings matter. I'm so, so sorry you're going through this. \n\nI truly believe that all EDs are different faces of the same coin. The core feelings of all EDs are the same. I become suicidal when I'm stuck in a binge/purge cycle. It is literally hell and it makes me want to die. Because of food and its shitty fucking calories.\n\nYou're not pathetic.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eono0i6": [
                {
                    "Parent ID": "t1_eoljc2o",
                    "Comment ID": "eono0i6",
                    "Author": "iceleo",
                    "Date Created": "05-24-2019 12:01:20",
                    "Upvotes": 11,
                    "Text": "I have obsessive tendencies with counting and calories that just keep on getting worse. The obsession with calorie counting and numbers fill my head and there is NO ESCAPE. I’m always counting, calculating, estimating, obsessing, over and over and it makes me want to KILL myself too because I hate it so much",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "eolk9f3": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eolk9f3",
                "Author": "hopelessly--hopeful",
                "Date Created": "05-23-2019 23:28:53",
                "Upvotes": 90,
                "Text": "Dude I feel this so hard. Struggling with the same demon right now. I used to be able to restrict, but this last year had been nothing but bingeing. I laid in bed and cried the other day because i realized that I've completely ruined my body. Even if I do eventually lose weight I'm never going to have the cute toned body that I so desperately crave. And I'm not getting any younger, I hate so much that I wasted my youth as a slave to this disease. All the internet hugs for you.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eolxz1o": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eolxz1o",
                "Author": "sintos-compa",
                "Date Created": "05-24-2019 01:10:10",
                "Upvotes": 70,
                "Text": "binge eating disorder is a goddamn yoke upon my shoulders. like you said, it's murdering me, because i seem only to be able to stay 100% away from food, or eat all the food. either way i die.\n\nit fucking sucks.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eolt3nw": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eolt3nw",
                "Author": "PieldeSapo",
                "Date Created": "05-24-2019 00:32:06",
                "Upvotes": 49,
                "Text": "The lack of control over something so basic and the feeling like you really are tryin to get your shit together and just CANT. Like you really fucking want to and just CANT. You are not alone in that, myself included. BED is valid. We have a bingeing support chat on WhatsApp, it wasn't mine from the beginning but I'll link you the thread so you can ask the host to join if you'd like.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eon8mw7": [
                {
                    "Parent ID": "t1_eolt3nw",
                    "Comment ID": "eon8mw7",
                    "Author": "ItsProbablyAliens",
                    "Date Created": "05-24-2019 09:06:39",
                    "Upvotes": 8,
                    "Text": "Dammit that really speaks to me. I really am trying to get my shit together and I feel like I’m constantly battling myself. I really want to win and I just CAN’T. Thanks for saying that, I feel less alone today.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "eolx89p": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eolx89p",
                "Author": "sincereenfuego",
                "Date Created": "05-24-2019 01:04:08",
                "Upvotes": 38,
                "Text": "Hey friend, wanted to start by saying thanks for making this post to talk about how you feel and I hope you don't delete it. Talking about the hurt is better than acting on the hurt.\n\nBED might seem like the odd one out in the ED family tree, but it is one of the most common EDs out of them all. I am sorry that you seem to be in a rough patch with it right now. It definitely isn't talked about as much in the media, which needs to change, but it is just as devastating as any other ED. One thing to always remember is that an ED is a mental disorder. EDs extremity isn't determined by weight, but by mental health. We are all sick mentally, but the adverse effects show physically. There is no glamor in binging 3000 calories worth of food, in nearly fainting due to starving, in sitting next to a toilet to purge a previous meal. No glamor, but we all do it, or something similar. That's why we are here and that is why we want to support one another through the worst of what we feel or do.\n\n&#x200B;\n\nYou are not pathetic. You are a human being. Same as me. Same as anyone else reading this. I wish you the best and hope you feel better.  Thank you for being brave enough to make this post. <3",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eomhy7n": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eomhy7n",
                "Author": "Free_Tacos_4Everyone",
                "Date Created": "05-24-2019 04:16:56",
                "Upvotes": 30,
                "Text": "You know, the main reason I have a ton of karma on reddit is because around 6 years ago, I thought I beat my BED. I lost over 100 pounds and posted my picture on various subreddits, and people cheered. I cheered. I conquered the monster that had plagued me for years...only to realize that monster had transformed into something not unlike anorexia. I again was miserable, and slowly over the years I put back all the weight I lost and more. But in these past years I have discovered that while my weight may fluctuate, and my self esteem may ebb with my constantly changing physique, I still am here. This anger you have, I feel it. No one *truly* does understand this pain, and powerlessness that comes with an eating disorder, especially the ones that cause a person to *gain* weight. But I wish I could impart to you that at a certain point, it can get better. Yes, im fat again. No, I'm not exactly pleased with it, but I respect myself far more than to let this disorder ruin me. I was just accepted into nursing school, I moved to a beautiful house in a warm, beautiful state, and life is pretty fucking good. You don't have to let it overtake you. Its just one day at a time.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eolx340": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eolx340",
                "Author": "slayedoll",
                "Date Created": "05-24-2019 01:02:58",
                "Upvotes": 28,
                "Text": "the positive aspects of food to common people like bonding, celebrating & for comfort just makes everything sadder. i wish all these didn't exist :-(\n\nhugs to all on here. no one suffering from this is the least bit pathetic.",
                "Edited?": "05-24-2019 04:17:15",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eon07zf": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eon07zf",
                "Author": "Adrenalize_me",
                "Date Created": "05-24-2019 07:18:49",
                "Upvotes": 19,
                "Text": "As someone who ate roughly 4200 calories last night in the span of 45 minutes, I feel this so fucking much. I hate talking about my BED because I’ve heard comments like “Oh, I wish I could just eat whatever I wanted and blame it on a disorder.” \n\nThis struggle fucking sucks. And I have said the same thing as you, about how you can’t quit food cold-turkey like you can with cigarettes. You need it to live.\n\nI’m sorry you’re going through this.. you’re not alone.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eomnv4v": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eomnv4v",
                "Author": "vomitandthrowaway",
                "Date Created": "05-24-2019 05:15:04",
                "Upvotes": 13,
                "Text": "BED is valid and no one here in the right mind thinks or will tell you otherwise. \nThe pain and body dismorphia it brings you and that is caused by an eating disorder alone is real, and it sucks, but I hope it passes soon because you sound like a wonderfully intelligent and perceptive person.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eon1o6d": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eon1o6d",
                "Author": "saveboykings",
                "Date Created": "05-24-2019 07:41:56",
                "Upvotes": 13,
                "Text": "I battled and defeated depression, I battled and defeated debilitating anxiety. I left a family that controlled every second of my life, I fought to get an emergency passport in a third world country behind my family's backs to be able to leave. I graduated college with honors, I was able to land a gig that pays me well from home. I somehow found someone great to love me, I have a home, I have enough money so that I'm not miserable or cold. My life, compared to before I was able to leave my family, is  perfect. I have freedom now, I can dress how I like, I can do what I want, I could leave the house as much as I please, I can kiss my boyfriend without feeling like garbage. I am free. But every waking minute, every fucking day, I have to fight myself from opening my pantry and eating *everything.* I don't know why. I thought when I moved away, I thought when I'm no longer stressed, my eating habits would become normal. That I'd be able to have control. I literally don't fucking understand, I have a brain, I have dignity. But can I stop myself from eating 2,000 calories in a sitting because a switch went off in my head? No. I don't know why. BED is a stupid disorder. I was never diagnosed and it's not \"real\" enough for me to believe I have it. But at the same time, I don't have an explanation for my appetite. It's not even an appetite, I'm not even fucking hungry when I binge. But I just have to eat so much my mouth hurts for hours after. If death meant freedom from *this* then I fucking get it too. I hate hating myself, it's so tiring. I hate hating the way I look, it isn't fair. I've been through so fucking much I should be able to look in the mirror without it destroying my self esteem. But here we are. Fuck BED, if it's real anyway and I'm not just a glutinous piece of shit.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eonixm1": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eonixm1",
                "Author": "kVIIIwithan8",
                "Date Created": "05-24-2019 11:00:47",
                "Upvotes": 9,
                "Text": "What your going through is real and valid. \n\nNow, I have a different ED, so my experience might not relate. However, I did spend 19years of my life taking care of my dad before his heroin addiction finally killed him. I'm going to talk about it for a second here because I've noticed a lot of similarities between him and me. His addiction was just different from ours--we are addicted in some capacity to our behaviors around food, be it eating too much, too little, purging, or what have you. We are all addicts in our own way and that's why I think sharing this is going to be helpful. \n\nHe described feelings of being out of control, stressed out, anxious, depressed, and frustrated as being some of his main triggers. The way heroin works (at least as I understand it) is it forces your brain to produce HELLA dopamine and makes you feel good, safe, secure. He said it felt like soft bunny hands were cradling you and whatever void in your soul felt gone. You just had this incredible feeling of being ok. This might be totally bonkers, but I imagine that's what it's like to be in the womb y'know? You feel like everything is good, all of your needs are taken care of, nothing is stressing you out, and you feel safe. \n\nI have all of those same triggers that he had. When I get stressed or anxious or depressed or I just feel like everything in my life is unstable, that's when my ED manifests. I get that control over myself, I get the pride (and then obviously I shatter it when I realize how pathetic I am but y'know), I get a sense of comfort when I do give in and just eat. From my ED, I get all of these things that make me feel a bit safer, a bit more secure, a bit more loved even. I'm chasing all the same things my dad was, but he found it through heroin while I found it in food. \n\nOut of the people that try to give up heroin, 2% are successful. it's a drug that follows you around your entire life. I'm not saying that you shouldn't try to quit if that's something you're dealing with, it's definitely worth it to be in that 2%, but I'm bringing it up to show how incredibly difficult it is. The process is painful (ever hear of being dope sick?), Sometimes it's expensive, and at the end of it all, your brain is always going to remember that it can make itself happy again by using. Your brain will never forget it. That's why it's so hard to give up even if you're already clean. \n\nFor EDs, I think we do the same thing. Our brains will never forget how much easier it feels to restrict/BP/binge/etc. Our brains will always know what it can get out of performing ED behaviors. That avenue will always be an option according to our brains. It's up to us to say \"no\". \n\nIn the clinics and groups and programs that ive taken my dad to, the number one recommendation they make is \"people, places, things\". If there are certain people that make you want to use or that are around that lifestyle and not trying to get out of it, stay away from them. Cut them outta your life. If there are certain places where you are more likely to use, don't go there or at least don't be there alone. If there are certain things that trigger you to want to use, don't be around them alone. He never took that advice and I think that made his struggle harder. \n\nFor me, I think that advice is actually pretty good. For one thing, there are certain subs that I look at to trigger myself. That's bad and I shouldn't do that. Also, my mom played a big part in me developing the ED to begin with; I have pretty much cut her out of my life to save myself. Getting away from me with another example, let's say someone is more likely to binge when they are home alone. I'm not saying it's easy or the one solution, but avoid being home alone then. Take away the options you have to engage with your ED by taking away the triggers and comfort zones that allow you or encourage you to take part in your ED. Get away from the people, places, and things that trigger you. \n\nAlso, like addicts, we can only take things one day at a time. I can't promise I won't relapse tomorrow. Or next week. Or next year. I can't say that I havent relapsed before. All I can do is try not to relapse today. If it happens, it happens but then I'll wake up the next day and do the same thing: just try not to relapse that day. Obviously I'm not the pinnacle of recovery, but at least getting away from my triggers got me to a) stop acting like my ED was normal b) made me notice when I was doing ED shit and c) got me to stop doing it like it was second nature or a daily habit. \n\nNow, OP, I know food is always around and out there. But your triggers are not everywhere. So I ask that you sit down and really think about what's happening in your life when you binge. Did you see that one person that always makes you feel fat or like your life is out of control? Did you go to that one place where it feels like everyone is judging you? Etc. Engage with that dialogue and you might find that it's easier to say \"I don't have to do this, I can just stop talking to that jerk, Doug\" or whatever.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eoohfp2": [
                {
                    "Parent ID": "t1_eonixm1",
                    "Comment ID": "eoohfp2",
                    "Author": "duskinsoil",
                    "Date Created": "05-24-2019 17:57:05",
                    "Upvotes": 4,
                    "Text": "I saved this comment. Thank you for writing it.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "eompx67": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eompx67",
                "Author": "uncom4table",
                "Date Created": "05-24-2019 05:34:24",
                "Upvotes": 15,
                "Text": "My best friend killed herself in February. She was only 27. She had struggled hard with anorexia and depression since we were kids. Recently, she looked like she was wasting away. Looking back at her most recent Instagram posts, it looks like a cry for help and no one noticed. I went to see her in the hospital when she had 0 percent brain function before they took her off life support. This is one of the hardest things I've ever gone through. I always thought my own ED was manageable. But, it really opened my eyes to the harsh reality of what living with an ED can be like for many people. \n\n\nPlease don't kill yourself.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eomtd4n": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eomtd4n",
                "Author": "SmokeMeAKipper-",
                "Date Created": "05-24-2019 06:05:07",
                "Upvotes": 8,
                "Text": "I don't have good advice for you. I just didn't want to click away from this without commenting.\n\nI was here. I read this. I know almost EXACTLY how you feel. BED is a nightmare, eating disorders are a fucking nightmare. You aren't dumb or alone or disgusting or pathetic. You're just....sick. It's not a reflection on you that you are sick. And I truly hope that when you wake up in the morning, life is kinder to you and the struggle is a bit easier.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eomzdgi": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eomzdgi",
                "Author": "defyangravity",
                "Date Created": "05-24-2019 07:04:35",
                "Upvotes": 8,
                "Text": "I have BED to and I relate to this so hard. I’m sorry you are dealing with this as well OP.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eomiphh": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eomiphh",
                "Author": "DisturbedWeakness",
                "Date Created": "05-24-2019 04:24:42",
                "Upvotes": 7,
                "Text": "Hi, I hear you. Want to wish you the best.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eomwi8g": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eomwi8g",
                "Author": "yamiryukia330",
                "Date Created": "05-24-2019 06:33:09",
                "Upvotes": 6,
                "Text": "Eating disorders are a nightmare. And BED is just as valid and serious of a disorder as anorexia or bulimia. You are stronger then you realize and your still here. Just because it's not glamorized doesn't mean it's not serious. Please get help?",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eoniqfx": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eoniqfx",
                "Author": "FeatherWorld",
                "Date Created": "05-24-2019 10:58:27",
                "Upvotes": 5,
                "Text": "Food runs the world and it's so engrained into daily life. I can't escape it when I need it to survive. 🥺 I fast and all the while food consumes my thoughts, both my love and my enemy. The highlight of most of my days and comfort, even though shortlived. It doesn't help that events and get togethers surround it and even travel. You just can't get away from it and it is a nightmare. If I could become indifferent to it as some people, I would choose it, just to have some resemblance of self control, even though it is such a huge passion of mine, an obsession. People think I am the one with self control because I don't eat breakfast or lunch at work and little do they know that they are the ones with real control. Calories and food scare me and I can't trust myself, even though it's vital to life. No I can't just have a little this or that. Once I start, I can hardly get myself to stop, even when my stomach is bursting and shame creeps in, after it's far too late. I can't not count calories, otherwise I over eat for my small body and gain weight. I have no off switch. So I have to eat proportioned, carefully calculated items, otherwise I'm a failure and I might as well fuck it and give in to my innermost desires. You are not alone :( ♡",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eoo0awj": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eoo0awj",
                "Author": "EsotericKnowledge",
                "Date Created": "05-24-2019 14:27:00",
                "Upvotes": 4,
                "Text": "I don't remember who said it, but there's some famous thing about how for every addiction out there, all you have to do is *not do the drug/substance*, but when you're addicted to food, that isn't an option. How many people could get over their heroin addiction shooting up a small dose once a day to stay alive? How many pack-or-more a day smokers could kick smoking if they had to smoke 3 cigarettes, no more and no less, every day? You know what I mean?  \nBED is such a bitch because there's just no getting away from food. It's not like you can move out of the bad neighborhood with the food dealers and try to turn your life around. You know?",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eonbg0h": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "eonbg0h",
                "Author": "Marissla",
                "Date Created": "05-24-2019 09:34:39",
                "Upvotes": 3,
                "Text": "For me it’s because I was so malnourished that I couldn’t think rationally. I’m a completely different person recovered. I smile and actually enjoy life then when I did in my depths of my ed",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ere2qr4": [
        [
            {
                "Parent ID": "t3_bsbxtb",
                "Comment ID": "ere2qr4",
                "Author": "wetblanketdreams",
                "Date Created": "06-17-2019 06:33:08",
                "Upvotes": 1,
                "Text": "I relate. You're not alone. Binge eaters need more support",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}