{
    "eg4slbh": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg4slbh",
                "Author": "toritxtornado",
                "Date Created": "02-09-2019 21:09:25",
                "Upvotes": 236,
                "Text": "this is where you have to swallow your pride and get into a program. it’s not going to be fun or easy, but i’ve been exactly where you are, and treatment saved my life. now i’m happy and nowhere close to death. i choose every day to live. it’s a conscious decision to eat because i have a family i love and loves me. i would not be able to leave them behind. \n\nyou have the potential to get better, but you need inpatient or residential help. call a center and get into treatment. asap. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eg4t1v1": [
                {
                    "Parent ID": "t1_eg4slbh",
                    "Comment ID": "eg4t1v1",
                    "Author": "IdidntChooseThis",
                    "Date Created": "02-09-2019 21:16:12",
                    "Upvotes": 133,
                    "Text": "At this point I agree. It's probably time for an emergency room visit. 11.6 bmi is the die any time category, even more so if it's been a long time below 15. Hate to say it, but it's going to be better if you check yourself into a hospital then to a residential program asap.\n",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "eg4t4fr": [
                        {
                            "Parent ID": "t1_eg4t1v1",
                            "Comment ID": "eg4t4fr",
                            "Author": "toritxtornado",
                            "Date Created": "02-09-2019 21:17:13",
                            "Upvotes": 61,
                            "Text": "agreed. an ER visit is the right call here. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4i5vi": [
                [
                    {
                        "Parent ID": "t1_eg4i35j",
                        "Comment ID": "eg4i5vi",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:38:57",
                        "Upvotes": 81,
                        "Text": "She loves you. She cares about you. Your mom will not be mad at you. It's okay to be scared, but you have to be brave too. If you can't be brave for yourself, please be brave for me?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4izd8": [
                        {
                            "Parent ID": "t1_eg4i5vi",
                            "Comment ID": "eg4izd8",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:50:24",
                            "Upvotes": 80,
                            "Text": "I called, she got mad. She told me to drink propel and eat something, but I'm thinking I can salvage this by doing a mono and eating an apple. I can't drink the propel because that would mess up the mono",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4vswr": [
                [
                    {
                        "Parent ID": "t1_eg4v84c",
                        "Comment ID": "eg4vswr",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:56:44",
                        "Upvotes": 24,
                        "Text": "I’m sorry if I implied you were actively suicidal. That’s my reason for having a list, but I can tell in your post that you’re fighting a different kind of darkness. \n\nThe thing I realized about my darkness is that once I got help for my ED and severe depression for the first time, it changed everything. All of a sudden, things weren’t pitch black; they were just... dark, because I’d seen a glimpse of life on the other side. I had context all of a sudden, and this sadness wasn’t the only thing I knew how to feel. \n\nI relapse all the time, and sometimes I’m a huge mess, but now I know it’s not permanent. I know I can have moments and those moments can string together and become entire days of feeling normal. \n\nI felt like a huge idiot for getting help, honestly. Like a fraud who brought all her problems upon herself. But today I’m still here, and I can honestly say that I’m glad, even though a huge part of me always wishes my ED would just be the end of me. \n\nI’m so glad you ate an apple. It sounds like your mom is diminishing your struggle. Can you get to an ER on your own? Is there anyone else you can call?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg5to4k": [
                        {
                            "Parent ID": "t1_eg4vswr",
                            "Comment ID": "eg5to4k",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 10:19:13",
                            "Upvotes": 4,
                            "Text": "Thank you, and you didn't imply anything. Your words help a lot. I'll be reaching out in person next time I see my mom. She doesn't mean to make it worse, I know that. But she always just says \"you can get better if you just make yourself \" which of course doesn't help at all. I know she means well but honestly at this point I want to stop asking for her help. I don't have anyone else close enough though",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg6s61b": [
                [
                    {
                        "Parent ID": "t1_eg6ofig",
                        "Comment ID": "eg6s61b",
                        "Author": "patbumbum",
                        "Date Created": "02-10-2019 17:48:16",
                        "Upvotes": 3,
                        "Text": "Banana bag. Is a multivitamin bag, It  yellow. How are you moving around with 11.6 bmi",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg6skj0": [
                        {
                            "Parent ID": "t1_eg6s61b",
                            "Comment ID": "eg6skj0",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 17:53:47",
                            "Upvotes": 2,
                            "Text": "It's actually a bit lower now",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg50nqd": [
                [
                    {
                        "Parent ID": "t1_eg4z56y",
                        "Comment ID": "eg50nqd",
                        "Author": "sstephenn",
                        "Date Created": "02-09-2019 23:17:02",
                        "Upvotes": 36,
                        "Text": "this wasn’t meant to be rude this was just my reaction when seeing the post, this person needs to be hospitalized. This BMI is Incompatible with life. I didn’t mean to come off as harsh just absolutely shocked me when I read that number oof",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg59z89": [
                        {
                            "Parent ID": "t1_eg50nqd",
                            "Comment ID": "eg59z89",
                            "Author": "NoaahFoster",
                            "Date Created": "02-10-2019 02:53:09",
                            "Upvotes": 21,
                            "Text": "I was shocked too. OP’s BMI would need to go up by seven more to be within the *lowest* healthy BMI range... when I read that my first thought was I am afraid for this person’s life. I hope they get the life saving help they need before it’s too late. ",
                            "Edited?": "02-10-2019 02:56:41",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4v3md": [
                [
                    {
                        "Parent ID": "t1_eg4t4fr",
                        "Comment ID": "eg4v3md",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 21:46:09",
                        "Upvotes": 51,
                        "Text": "Thank you guys, but I've been at this weight before. I've also been through multiple hospitalizations and 2 residential programs, all of which have clearly failed. We'll see what happens  next weekend, my mom is coming to see me then. For now I'm just going to go to bed. Thank you all for your serious and well thought out advice.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4x1e9": [
                        {
                            "Parent ID": "t1_eg4v3md",
                            "Comment ID": "eg4x1e9",
                            "Author": "broketreebranch",
                            "Date Created": "02-09-2019 22:15:44",
                            "Upvotes": 99,
                            "Text": "Please don’t give up. Please go to an ER soon. You could die in your sleep. Your life is worthy. There are people who care about you and are rooting for you.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "eg542kx": [
                        {
                            "Parent ID": "t1_eg4v3md",
                            "Comment ID": "eg542kx",
                            "Author": "bakermillerfloyd",
                            "Date Created": "02-10-2019 00:23:25",
                            "Upvotes": 62,
                            "Text": "Going to bed will not fix this. Your mom may not get to see you next weekend nor ever again. This is coming from somebody who's been where you are- get help *now*.",
                            "Edited?": "02-10-2019 01:12:55",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "eg54mzq": [
                        {
                            "Parent ID": "t1_eg4v3md",
                            "Comment ID": "eg54mzq",
                            "Author": "lizzyb187",
                            "Date Created": "02-10-2019 00:35:52",
                            "Upvotes": 36,
                            "Text": "There is a lot of failure on the way to being successful. Failure means you're trying. Keep trying, even if you fail again. You wont always fail. Stick with it. I have faith that you can do it. I care.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "eg5nb9m": [
                        {
                            "Parent ID": "t1_eg4v3md",
                            "Comment ID": "eg5nb9m",
                            "Author": "toritxtornado",
                            "Date Created": "02-10-2019 08:42:52",
                            "Upvotes": 11,
                            "Text": "you fail when you give up. i also had to go through many and tried different programs across the country before it really stuck. you can still get through this to the other side. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4jezx": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4jezx",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:56:35",
                        "Upvotes": 92,
                        "Text": "If your mom isn't taking your struggles seriously, is there anyone else you could reach out to? Are you in university? Is there a mental health service you could reach out to?\n\nI would not recommend doing a mono, but if you can eat anything that can give you enough energy until you can meet with someone who will take you seriously, please do so.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4jift": [
                        {
                            "Parent ID": "t1_eg4jezx",
                            "Comment ID": "eg4jift",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:57:59",
                            "Upvotes": 39,
                            "Text": "I'm going to eat an apple. Will it make me gain weight? I just want to wake up lighter tomorrow ",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4zxl4": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4zxl4",
                        "Author": "linedryonly",
                        "Date Created": "02-09-2019 23:04:03",
                        "Upvotes": 47,
                        "Text": "Hey I just want to give an alternative explanation to why your mom may have gotten mad. It's possible that she's frustrated because she wants you to be better and she feels powerless to help. It's common for families and loved ones to react with anger because they hate that you're suffering but they can't do anything to fix it. I don't how your relationship with your mother, but I think it's likely that she's angry because she loves you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jru3": [
                [
                    {
                        "Parent ID": "t1_eg4jift",
                        "Comment ID": "eg4jru3",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:01:45",
                        "Upvotes": 63,
                        "Text": "You may have some water retention if you haven't drank anything today. Please consider reaching out to someone who will take your problems seriously. Your recovery team? Your dietician if need be?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4k1ki": [
                        {
                            "Parent ID": "t1_eg4jru3",
                            "Comment ID": "eg4k1ki",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:05:46",
                            "Upvotes": 38,
                            "Text": "I have already, but it'll be a while before I see anyone on my team. And I've been drinking plenty of plain water",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4k84f": [
                [
                    {
                        "Parent ID": "t1_eg4k1ki",
                        "Comment ID": "eg4k84f",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:08:28",
                        "Upvotes": 79,
                        "Text": "You can also eat a bit of salt in order to help your electrolytes. Potassium chloride will help a lot too, if you have it.\n\nI'm not sure if your timezone is EST. Are you going to sleep soon? I can stay up with you if you feel like you won't make it til morning.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kd9y": [
                        {
                            "Parent ID": "t1_eg4k84f",
                            "Comment ID": "eg4kd9y",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:10:34",
                            "Upvotes": 53,
                            "Text": "I think I'll make it, thank you so much. I'll go to sleep in a few hours, it's about 7 PM. I'm eating my apple but I don't think I'll add any salt, I feel much better. Thank you so much, you are such a great person!!! <3",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4kpsl": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4kpsl",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:15:31",
                        "Upvotes": 10,
                        "Text": "I'll check in with you tomorrow morning, okay? What time do you usually wake up?\n\nI've been where you are now, and having someone who just wanted to know that I was okay helped more than you can imagine. If I can do even a small percentage of that for you, I'm happy.\n\nAlso, if you feel like you need to talk at any point in the night, please don't hesitate to message me!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kxxo": [
                        {
                            "Parent ID": "t1_eg4kpsl",
                            "Comment ID": "eg4kxxo",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:18:40",
                            "Upvotes": 8,
                            "Text": "Thank you so much. I should be up by 10 at the latest",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4uveg": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4uveg",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:42:49",
                        "Upvotes": 3,
                        "Text": "Proud of you for the apple! ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4kzh1": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4kzh1",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:19:17",
                        "Upvotes": 11,
                        "Text": "Thank you again, you have no idea how much you helped me. I honestly think you may have saved my life",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4lbwg": [
                        {
                            "Parent ID": "t1_eg4kzh1",
                            "Comment ID": "eg4lbwg",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:24:16",
                            "Upvotes": 11,
                            "Text": "You are loved here",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4l2t0": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4l2t0",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:20:37",
                        "Upvotes": 5,
                        "Text": "You're welcome ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "eg55uz5": [
                {
                    "Parent ID": "t1_eg4slbh",
                    "Comment ID": "eg55uz5",
                    "Author": "Catoverloadzzz",
                    "Date Created": "02-10-2019 01:04:08",
                    "Upvotes": 37,
                    "Text": "Please check in. You may feel \"just okay\" for a few hours before all hell breaks loose. \n\nYou are 19. Young. So much to live for. Ive been there, homeless, starving, no food even when I desperately needed the calories to live. \n\nOr. Throw your life away. \n\nIt's all up to you. We will support you but can't make decisions until you do yourself.\n\n",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "eg4t4fr": [
                [
                    {
                        "Parent ID": "t1_eg4t1v1",
                        "Comment ID": "eg4t4fr",
                        "Author": "toritxtornado",
                        "Date Created": "02-09-2019 21:17:13",
                        "Upvotes": 61,
                        "Text": "agreed. an ER visit is the right call here. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4v3md": [
                        {
                            "Parent ID": "t1_eg4t4fr",
                            "Comment ID": "eg4v3md",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 21:46:09",
                            "Upvotes": 51,
                            "Text": "Thank you guys, but I've been at this weight before. I've also been through multiple hospitalizations and 2 residential programs, all of which have clearly failed. We'll see what happens  next weekend, my mom is coming to see me then. For now I'm just going to go to bed. Thank you all for your serious and well thought out advice.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4i5vi": [
                [
                    {
                        "Parent ID": "t1_eg4i35j",
                        "Comment ID": "eg4i5vi",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:38:57",
                        "Upvotes": 81,
                        "Text": "She loves you. She cares about you. Your mom will not be mad at you. It's okay to be scared, but you have to be brave too. If you can't be brave for yourself, please be brave for me?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4izd8": [
                        {
                            "Parent ID": "t1_eg4i5vi",
                            "Comment ID": "eg4izd8",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:50:24",
                            "Upvotes": 80,
                            "Text": "I called, she got mad. She told me to drink propel and eat something, but I'm thinking I can salvage this by doing a mono and eating an apple. I can't drink the propel because that would mess up the mono",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4vswr": [
                [
                    {
                        "Parent ID": "t1_eg4v84c",
                        "Comment ID": "eg4vswr",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:56:44",
                        "Upvotes": 24,
                        "Text": "I’m sorry if I implied you were actively suicidal. That’s my reason for having a list, but I can tell in your post that you’re fighting a different kind of darkness. \n\nThe thing I realized about my darkness is that once I got help for my ED and severe depression for the first time, it changed everything. All of a sudden, things weren’t pitch black; they were just... dark, because I’d seen a glimpse of life on the other side. I had context all of a sudden, and this sadness wasn’t the only thing I knew how to feel. \n\nI relapse all the time, and sometimes I’m a huge mess, but now I know it’s not permanent. I know I can have moments and those moments can string together and become entire days of feeling normal. \n\nI felt like a huge idiot for getting help, honestly. Like a fraud who brought all her problems upon herself. But today I’m still here, and I can honestly say that I’m glad, even though a huge part of me always wishes my ED would just be the end of me. \n\nI’m so glad you ate an apple. It sounds like your mom is diminishing your struggle. Can you get to an ER on your own? Is there anyone else you can call?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg5to4k": [
                        {
                            "Parent ID": "t1_eg4vswr",
                            "Comment ID": "eg5to4k",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 10:19:13",
                            "Upvotes": 4,
                            "Text": "Thank you, and you didn't imply anything. Your words help a lot. I'll be reaching out in person next time I see my mom. She doesn't mean to make it worse, I know that. But she always just says \"you can get better if you just make yourself \" which of course doesn't help at all. I know she means well but honestly at this point I want to stop asking for her help. I don't have anyone else close enough though",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg6s61b": [
                [
                    {
                        "Parent ID": "t1_eg6ofig",
                        "Comment ID": "eg6s61b",
                        "Author": "patbumbum",
                        "Date Created": "02-10-2019 17:48:16",
                        "Upvotes": 3,
                        "Text": "Banana bag. Is a multivitamin bag, It  yellow. How are you moving around with 11.6 bmi",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg6skj0": [
                        {
                            "Parent ID": "t1_eg6s61b",
                            "Comment ID": "eg6skj0",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 17:53:47",
                            "Upvotes": 2,
                            "Text": "It's actually a bit lower now",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg50nqd": [
                [
                    {
                        "Parent ID": "t1_eg4z56y",
                        "Comment ID": "eg50nqd",
                        "Author": "sstephenn",
                        "Date Created": "02-09-2019 23:17:02",
                        "Upvotes": 36,
                        "Text": "this wasn’t meant to be rude this was just my reaction when seeing the post, this person needs to be hospitalized. This BMI is Incompatible with life. I didn’t mean to come off as harsh just absolutely shocked me when I read that number oof",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg59z89": [
                        {
                            "Parent ID": "t1_eg50nqd",
                            "Comment ID": "eg59z89",
                            "Author": "NoaahFoster",
                            "Date Created": "02-10-2019 02:53:09",
                            "Upvotes": 21,
                            "Text": "I was shocked too. OP’s BMI would need to go up by seven more to be within the *lowest* healthy BMI range... when I read that my first thought was I am afraid for this person’s life. I hope they get the life saving help they need before it’s too late. ",
                            "Edited?": "02-10-2019 02:56:41",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4x1e9": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg4x1e9",
                        "Author": "broketreebranch",
                        "Date Created": "02-09-2019 22:15:44",
                        "Upvotes": 99,
                        "Text": "Please don’t give up. Please go to an ER soon. You could die in your sleep. Your life is worthy. There are people who care about you and are rooting for you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg542kx": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg542kx",
                        "Author": "bakermillerfloyd",
                        "Date Created": "02-10-2019 00:23:25",
                        "Upvotes": 62,
                        "Text": "Going to bed will not fix this. Your mom may not get to see you next weekend nor ever again. This is coming from somebody who's been where you are- get help *now*.",
                        "Edited?": "02-10-2019 01:12:55",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg54mzq": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg54mzq",
                        "Author": "lizzyb187",
                        "Date Created": "02-10-2019 00:35:52",
                        "Upvotes": 36,
                        "Text": "There is a lot of failure on the way to being successful. Failure means you're trying. Keep trying, even if you fail again. You wont always fail. Stick with it. I have faith that you can do it. I care.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg5nb9m": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg5nb9m",
                        "Author": "toritxtornado",
                        "Date Created": "02-10-2019 08:42:52",
                        "Upvotes": 11,
                        "Text": "you fail when you give up. i also had to go through many and tried different programs across the country before it really stuck. you can still get through this to the other side. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jezx": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4jezx",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:56:35",
                        "Upvotes": 92,
                        "Text": "If your mom isn't taking your struggles seriously, is there anyone else you could reach out to? Are you in university? Is there a mental health service you could reach out to?\n\nI would not recommend doing a mono, but if you can eat anything that can give you enough energy until you can meet with someone who will take you seriously, please do so.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4jift": [
                        {
                            "Parent ID": "t1_eg4jezx",
                            "Comment ID": "eg4jift",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:57:59",
                            "Upvotes": 39,
                            "Text": "I'm going to eat an apple. Will it make me gain weight? I just want to wake up lighter tomorrow ",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4zxl4": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4zxl4",
                        "Author": "linedryonly",
                        "Date Created": "02-09-2019 23:04:03",
                        "Upvotes": 47,
                        "Text": "Hey I just want to give an alternative explanation to why your mom may have gotten mad. It's possible that she's frustrated because she wants you to be better and she feels powerless to help. It's common for families and loved ones to react with anger because they hate that you're suffering but they can't do anything to fix it. I don't how your relationship with your mother, but I think it's likely that she's angry because she loves you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jru3": [
                [
                    {
                        "Parent ID": "t1_eg4jift",
                        "Comment ID": "eg4jru3",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:01:45",
                        "Upvotes": 63,
                        "Text": "You may have some water retention if you haven't drank anything today. Please consider reaching out to someone who will take your problems seriously. Your recovery team? Your dietician if need be?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4k1ki": [
                        {
                            "Parent ID": "t1_eg4jru3",
                            "Comment ID": "eg4k1ki",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:05:46",
                            "Upvotes": 38,
                            "Text": "I have already, but it'll be a while before I see anyone on my team. And I've been drinking plenty of plain water",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4k84f": [
                [
                    {
                        "Parent ID": "t1_eg4k1ki",
                        "Comment ID": "eg4k84f",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:08:28",
                        "Upvotes": 79,
                        "Text": "You can also eat a bit of salt in order to help your electrolytes. Potassium chloride will help a lot too, if you have it.\n\nI'm not sure if your timezone is EST. Are you going to sleep soon? I can stay up with you if you feel like you won't make it til morning.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kd9y": [
                        {
                            "Parent ID": "t1_eg4k84f",
                            "Comment ID": "eg4kd9y",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:10:34",
                            "Upvotes": 53,
                            "Text": "I think I'll make it, thank you so much. I'll go to sleep in a few hours, it's about 7 PM. I'm eating my apple but I don't think I'll add any salt, I feel much better. Thank you so much, you are such a great person!!! <3",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4kpsl": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4kpsl",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:15:31",
                        "Upvotes": 10,
                        "Text": "I'll check in with you tomorrow morning, okay? What time do you usually wake up?\n\nI've been where you are now, and having someone who just wanted to know that I was okay helped more than you can imagine. If I can do even a small percentage of that for you, I'm happy.\n\nAlso, if you feel like you need to talk at any point in the night, please don't hesitate to message me!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kxxo": [
                        {
                            "Parent ID": "t1_eg4kpsl",
                            "Comment ID": "eg4kxxo",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:18:40",
                            "Upvotes": 8,
                            "Text": "Thank you so much. I should be up by 10 at the latest",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4uveg": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4uveg",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:42:49",
                        "Upvotes": 3,
                        "Text": "Proud of you for the apple! ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4kzh1": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4kzh1",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:19:17",
                        "Upvotes": 11,
                        "Text": "Thank you again, you have no idea how much you helped me. I honestly think you may have saved my life",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4lbwg": [
                        {
                            "Parent ID": "t1_eg4kzh1",
                            "Comment ID": "eg4lbwg",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:24:16",
                            "Upvotes": 11,
                            "Text": "You are loved here",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4l2t0": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4l2t0",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:20:37",
                        "Upvotes": 5,
                        "Text": "You're welcome ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "eg4hpz0": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg4hpz0",
                "Author": "bollarcones",
                "Date Created": "02-09-2019 18:32:43",
                "Upvotes": 137,
                "Text": "Please don't give up yet! Is there anyone you could call? Perhaps your mom? You haven't let anyone down, and I know from the bottom of my heart that while it seems like nothing is worth it right now, things can change.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eg4i35j": [
                {
                    "Parent ID": "t1_eg4hpz0",
                    "Comment ID": "eg4i35j",
                    "Author": "Chibi-Bunny",
                    "Date Created": "02-09-2019 18:37:54",
                    "Upvotes": 106,
                    "Text": "I'm about to call her, I'm just so scared",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "eg4i5vi": [
                        {
                            "Parent ID": "t1_eg4i35j",
                            "Comment ID": "eg4i5vi",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 18:38:57",
                            "Upvotes": 81,
                            "Text": "She loves you. She cares about you. Your mom will not be mad at you. It's okay to be scared, but you have to be brave too. If you can't be brave for yourself, please be brave for me?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4t4fr": [
                [
                    {
                        "Parent ID": "t1_eg4t1v1",
                        "Comment ID": "eg4t4fr",
                        "Author": "toritxtornado",
                        "Date Created": "02-09-2019 21:17:13",
                        "Upvotes": 61,
                        "Text": "agreed. an ER visit is the right call here. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4v3md": [
                        {
                            "Parent ID": "t1_eg4t4fr",
                            "Comment ID": "eg4v3md",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 21:46:09",
                            "Upvotes": 51,
                            "Text": "Thank you guys, but I've been at this weight before. I've also been through multiple hospitalizations and 2 residential programs, all of which have clearly failed. We'll see what happens  next weekend, my mom is coming to see me then. For now I'm just going to go to bed. Thank you all for your serious and well thought out advice.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4vswr": [
                [
                    {
                        "Parent ID": "t1_eg4v84c",
                        "Comment ID": "eg4vswr",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:56:44",
                        "Upvotes": 24,
                        "Text": "I’m sorry if I implied you were actively suicidal. That’s my reason for having a list, but I can tell in your post that you’re fighting a different kind of darkness. \n\nThe thing I realized about my darkness is that once I got help for my ED and severe depression for the first time, it changed everything. All of a sudden, things weren’t pitch black; they were just... dark, because I’d seen a glimpse of life on the other side. I had context all of a sudden, and this sadness wasn’t the only thing I knew how to feel. \n\nI relapse all the time, and sometimes I’m a huge mess, but now I know it’s not permanent. I know I can have moments and those moments can string together and become entire days of feeling normal. \n\nI felt like a huge idiot for getting help, honestly. Like a fraud who brought all her problems upon herself. But today I’m still here, and I can honestly say that I’m glad, even though a huge part of me always wishes my ED would just be the end of me. \n\nI’m so glad you ate an apple. It sounds like your mom is diminishing your struggle. Can you get to an ER on your own? Is there anyone else you can call?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg5to4k": [
                        {
                            "Parent ID": "t1_eg4vswr",
                            "Comment ID": "eg5to4k",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 10:19:13",
                            "Upvotes": 4,
                            "Text": "Thank you, and you didn't imply anything. Your words help a lot. I'll be reaching out in person next time I see my mom. She doesn't mean to make it worse, I know that. But she always just says \"you can get better if you just make yourself \" which of course doesn't help at all. I know she means well but honestly at this point I want to stop asking for her help. I don't have anyone else close enough though",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg6s61b": [
                [
                    {
                        "Parent ID": "t1_eg6ofig",
                        "Comment ID": "eg6s61b",
                        "Author": "patbumbum",
                        "Date Created": "02-10-2019 17:48:16",
                        "Upvotes": 3,
                        "Text": "Banana bag. Is a multivitamin bag, It  yellow. How are you moving around with 11.6 bmi",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg6skj0": [
                        {
                            "Parent ID": "t1_eg6s61b",
                            "Comment ID": "eg6skj0",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 17:53:47",
                            "Upvotes": 2,
                            "Text": "It's actually a bit lower now",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg50nqd": [
                [
                    {
                        "Parent ID": "t1_eg4z56y",
                        "Comment ID": "eg50nqd",
                        "Author": "sstephenn",
                        "Date Created": "02-09-2019 23:17:02",
                        "Upvotes": 36,
                        "Text": "this wasn’t meant to be rude this was just my reaction when seeing the post, this person needs to be hospitalized. This BMI is Incompatible with life. I didn’t mean to come off as harsh just absolutely shocked me when I read that number oof",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg59z89": [
                        {
                            "Parent ID": "t1_eg50nqd",
                            "Comment ID": "eg59z89",
                            "Author": "NoaahFoster",
                            "Date Created": "02-10-2019 02:53:09",
                            "Upvotes": 21,
                            "Text": "I was shocked too. OP’s BMI would need to go up by seven more to be within the *lowest* healthy BMI range... when I read that my first thought was I am afraid for this person’s life. I hope they get the life saving help they need before it’s too late. ",
                            "Edited?": "02-10-2019 02:56:41",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4izd8": [
                [
                    {
                        "Parent ID": "t1_eg4i5vi",
                        "Comment ID": "eg4izd8",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 18:50:24",
                        "Upvotes": 80,
                        "Text": "I called, she got mad. She told me to drink propel and eat something, but I'm thinking I can salvage this by doing a mono and eating an apple. I can't drink the propel because that would mess up the mono",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4jezx": [
                        {
                            "Parent ID": "t1_eg4izd8",
                            "Comment ID": "eg4jezx",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 18:56:35",
                            "Upvotes": 92,
                            "Text": "If your mom isn't taking your struggles seriously, is there anyone else you could reach out to? Are you in university? Is there a mental health service you could reach out to?\n\nI would not recommend doing a mono, but if you can eat anything that can give you enough energy until you can meet with someone who will take you seriously, please do so.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "eg4zxl4": [
                        {
                            "Parent ID": "t1_eg4izd8",
                            "Comment ID": "eg4zxl4",
                            "Author": "linedryonly",
                            "Date Created": "02-09-2019 23:04:03",
                            "Upvotes": 47,
                            "Text": "Hey I just want to give an alternative explanation to why your mom may have gotten mad. It's possible that she's frustrated because she wants you to be better and she feels powerless to help. It's common for families and loved ones to react with anger because they hate that you're suffering but they can't do anything to fix it. I don't how your relationship with your mother, but I think it's likely that she's angry because she loves you.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4x1e9": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg4x1e9",
                        "Author": "broketreebranch",
                        "Date Created": "02-09-2019 22:15:44",
                        "Upvotes": 99,
                        "Text": "Please don’t give up. Please go to an ER soon. You could die in your sleep. Your life is worthy. There are people who care about you and are rooting for you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg542kx": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg542kx",
                        "Author": "bakermillerfloyd",
                        "Date Created": "02-10-2019 00:23:25",
                        "Upvotes": 62,
                        "Text": "Going to bed will not fix this. Your mom may not get to see you next weekend nor ever again. This is coming from somebody who's been where you are- get help *now*.",
                        "Edited?": "02-10-2019 01:12:55",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg54mzq": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg54mzq",
                        "Author": "lizzyb187",
                        "Date Created": "02-10-2019 00:35:52",
                        "Upvotes": 36,
                        "Text": "There is a lot of failure on the way to being successful. Failure means you're trying. Keep trying, even if you fail again. You wont always fail. Stick with it. I have faith that you can do it. I care.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg5nb9m": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg5nb9m",
                        "Author": "toritxtornado",
                        "Date Created": "02-10-2019 08:42:52",
                        "Upvotes": 11,
                        "Text": "you fail when you give up. i also had to go through many and tried different programs across the country before it really stuck. you can still get through this to the other side. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jift": [
                [
                    {
                        "Parent ID": "t1_eg4jezx",
                        "Comment ID": "eg4jift",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 18:57:59",
                        "Upvotes": 39,
                        "Text": "I'm going to eat an apple. Will it make me gain weight? I just want to wake up lighter tomorrow ",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4jru3": [
                        {
                            "Parent ID": "t1_eg4jift",
                            "Comment ID": "eg4jru3",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:01:45",
                            "Upvotes": 63,
                            "Text": "You may have some water retention if you haven't drank anything today. Please consider reaching out to someone who will take your problems seriously. Your recovery team? Your dietician if need be?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4k1ki": [
                [
                    {
                        "Parent ID": "t1_eg4jru3",
                        "Comment ID": "eg4k1ki",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:05:46",
                        "Upvotes": 38,
                        "Text": "I have already, but it'll be a while before I see anyone on my team. And I've been drinking plenty of plain water",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4k84f": [
                        {
                            "Parent ID": "t1_eg4k1ki",
                            "Comment ID": "eg4k84f",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:08:28",
                            "Upvotes": 79,
                            "Text": "You can also eat a bit of salt in order to help your electrolytes. Potassium chloride will help a lot too, if you have it.\n\nI'm not sure if your timezone is EST. Are you going to sleep soon? I can stay up with you if you feel like you won't make it til morning.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4kd9y": [
                [
                    {
                        "Parent ID": "t1_eg4k84f",
                        "Comment ID": "eg4kd9y",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:10:34",
                        "Upvotes": 53,
                        "Text": "I think I'll make it, thank you so much. I'll go to sleep in a few hours, it's about 7 PM. I'm eating my apple but I don't think I'll add any salt, I feel much better. Thank you so much, you are such a great person!!! <3",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kpsl": [
                        {
                            "Parent ID": "t1_eg4kd9y",
                            "Comment ID": "eg4kpsl",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:15:31",
                            "Upvotes": 10,
                            "Text": "I'll check in with you tomorrow morning, okay? What time do you usually wake up?\n\nI've been where you are now, and having someone who just wanted to know that I was okay helped more than you can imagine. If I can do even a small percentage of that for you, I'm happy.\n\nAlso, if you feel like you need to talk at any point in the night, please don't hesitate to message me!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "eg4uveg": [
                        {
                            "Parent ID": "t1_eg4kd9y",
                            "Comment ID": "eg4uveg",
                            "Author": "bunnyalert",
                            "Date Created": "02-09-2019 21:42:49",
                            "Upvotes": 3,
                            "Text": "Proud of you for the apple! ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4kxxo": [
                [
                    {
                        "Parent ID": "t1_eg4kpsl",
                        "Comment ID": "eg4kxxo",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:18:40",
                        "Upvotes": 8,
                        "Text": "Thank you so much. I should be up by 10 at the latest",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kzh1": [
                        {
                            "Parent ID": "t1_eg4kxxo",
                            "Comment ID": "eg4kzh1",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:19:17",
                            "Upvotes": 11,
                            "Text": "Thank you again, you have no idea how much you helped me. I honestly think you may have saved my life",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "eg4l2t0": [
                        {
                            "Parent ID": "t1_eg4kxxo",
                            "Comment ID": "eg4l2t0",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:20:37",
                            "Upvotes": 5,
                            "Text": "You're welcome ❤️",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4lbwg": [
                [
                    {
                        "Parent ID": "t1_eg4kzh1",
                        "Comment ID": "eg4lbwg",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:24:16",
                        "Upvotes": 11,
                        "Text": "You are loved here",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "eg4uq3o": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg4uq3o",
                "Author": "bunnyalert",
                "Date Created": "02-09-2019 21:40:37",
                "Upvotes": 68,
                "Text": "What are some experiences of life that you’d like to have? If you could wave a magic wand, would you want to travel anywhere? See something in nature? Try something scary or weird or fun?\n\nMy list includes stuff like scuba diving, learning to paint, and learning the banjo. I’m intensely suicidal all the time, but this stupid list is what keeps me here. If I’m dead, I can’t see wild penguins ever, and that kinda sucks. \n\nThere’s a world of experiences you can have if you stay alive. Recovery is possible. You’re not going to get better overnight, but slowly you can work to free yourself from these habits. You’re a whole person under this fog, full of life and potential and dreams. You can find that person. \n\nI don’t know you but I really, desperately hope you stay alive. If you need help finding help, I’m here and so are thousands in this community. You don’t deserve to suffer. \n",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eg4v84c": [
                {
                    "Parent ID": "t1_eg4uq3o",
                    "Comment ID": "eg4v84c",
                    "Author": "Chibi-Bunny",
                    "Date Created": "02-09-2019 21:48:02",
                    "Upvotes": 41,
                    "Text": "Thank you. I love your list, and I do have some things of my own I want to accomplish. I'm not actively suicidal, it's just hard to remember that anything besides this is possible. It doesn't feel real, like I'll always be in this place.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "eg4vswr": [
                        {
                            "Parent ID": "t1_eg4v84c",
                            "Comment ID": "eg4vswr",
                            "Author": "bunnyalert",
                            "Date Created": "02-09-2019 21:56:44",
                            "Upvotes": 24,
                            "Text": "I’m sorry if I implied you were actively suicidal. That’s my reason for having a list, but I can tell in your post that you’re fighting a different kind of darkness. \n\nThe thing I realized about my darkness is that once I got help for my ED and severe depression for the first time, it changed everything. All of a sudden, things weren’t pitch black; they were just... dark, because I’d seen a glimpse of life on the other side. I had context all of a sudden, and this sadness wasn’t the only thing I knew how to feel. \n\nI relapse all the time, and sometimes I’m a huge mess, but now I know it’s not permanent. I know I can have moments and those moments can string together and become entire days of feeling normal. \n\nI felt like a huge idiot for getting help, honestly. Like a fraud who brought all her problems upon herself. But today I’m still here, and I can honestly say that I’m glad, even though a huge part of me always wishes my ED would just be the end of me. \n\nI’m so glad you ate an apple. It sounds like your mom is diminishing your struggle. Can you get to an ER on your own? Is there anyone else you can call?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4t4fr": [
                [
                    {
                        "Parent ID": "t1_eg4t1v1",
                        "Comment ID": "eg4t4fr",
                        "Author": "toritxtornado",
                        "Date Created": "02-09-2019 21:17:13",
                        "Upvotes": 61,
                        "Text": "agreed. an ER visit is the right call here. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4v3md": [
                        {
                            "Parent ID": "t1_eg4t4fr",
                            "Comment ID": "eg4v3md",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 21:46:09",
                            "Upvotes": 51,
                            "Text": "Thank you guys, but I've been at this weight before. I've also been through multiple hospitalizations and 2 residential programs, all of which have clearly failed. We'll see what happens  next weekend, my mom is coming to see me then. For now I'm just going to go to bed. Thank you all for your serious and well thought out advice.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4i5vi": [
                [
                    {
                        "Parent ID": "t1_eg4i35j",
                        "Comment ID": "eg4i5vi",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:38:57",
                        "Upvotes": 81,
                        "Text": "She loves you. She cares about you. Your mom will not be mad at you. It's okay to be scared, but you have to be brave too. If you can't be brave for yourself, please be brave for me?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4izd8": [
                        {
                            "Parent ID": "t1_eg4i5vi",
                            "Comment ID": "eg4izd8",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:50:24",
                            "Upvotes": 80,
                            "Text": "I called, she got mad. She told me to drink propel and eat something, but I'm thinking I can salvage this by doing a mono and eating an apple. I can't drink the propel because that would mess up the mono",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg6s61b": [
                [
                    {
                        "Parent ID": "t1_eg6ofig",
                        "Comment ID": "eg6s61b",
                        "Author": "patbumbum",
                        "Date Created": "02-10-2019 17:48:16",
                        "Upvotes": 3,
                        "Text": "Banana bag. Is a multivitamin bag, It  yellow. How are you moving around with 11.6 bmi",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg6skj0": [
                        {
                            "Parent ID": "t1_eg6s61b",
                            "Comment ID": "eg6skj0",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 17:53:47",
                            "Upvotes": 2,
                            "Text": "It's actually a bit lower now",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg50nqd": [
                [
                    {
                        "Parent ID": "t1_eg4z56y",
                        "Comment ID": "eg50nqd",
                        "Author": "sstephenn",
                        "Date Created": "02-09-2019 23:17:02",
                        "Upvotes": 36,
                        "Text": "this wasn’t meant to be rude this was just my reaction when seeing the post, this person needs to be hospitalized. This BMI is Incompatible with life. I didn’t mean to come off as harsh just absolutely shocked me when I read that number oof",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg59z89": [
                        {
                            "Parent ID": "t1_eg50nqd",
                            "Comment ID": "eg59z89",
                            "Author": "NoaahFoster",
                            "Date Created": "02-10-2019 02:53:09",
                            "Upvotes": 21,
                            "Text": "I was shocked too. OP’s BMI would need to go up by seven more to be within the *lowest* healthy BMI range... when I read that my first thought was I am afraid for this person’s life. I hope they get the life saving help they need before it’s too late. ",
                            "Edited?": "02-10-2019 02:56:41",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg5to4k": [
                [
                    {
                        "Parent ID": "t1_eg4vswr",
                        "Comment ID": "eg5to4k",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-10-2019 10:19:13",
                        "Upvotes": 4,
                        "Text": "Thank you, and you didn't imply anything. Your words help a lot. I'll be reaching out in person next time I see my mom. She doesn't mean to make it worse, I know that. But she always just says \"you can get better if you just make yourself \" which of course doesn't help at all. I know she means well but honestly at this point I want to stop asking for her help. I don't have anyone else close enough though",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4x1e9": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg4x1e9",
                        "Author": "broketreebranch",
                        "Date Created": "02-09-2019 22:15:44",
                        "Upvotes": 99,
                        "Text": "Please don’t give up. Please go to an ER soon. You could die in your sleep. Your life is worthy. There are people who care about you and are rooting for you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg542kx": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg542kx",
                        "Author": "bakermillerfloyd",
                        "Date Created": "02-10-2019 00:23:25",
                        "Upvotes": 62,
                        "Text": "Going to bed will not fix this. Your mom may not get to see you next weekend nor ever again. This is coming from somebody who's been where you are- get help *now*.",
                        "Edited?": "02-10-2019 01:12:55",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg54mzq": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg54mzq",
                        "Author": "lizzyb187",
                        "Date Created": "02-10-2019 00:35:52",
                        "Upvotes": 36,
                        "Text": "There is a lot of failure on the way to being successful. Failure means you're trying. Keep trying, even if you fail again. You wont always fail. Stick with it. I have faith that you can do it. I care.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg5nb9m": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg5nb9m",
                        "Author": "toritxtornado",
                        "Date Created": "02-10-2019 08:42:52",
                        "Upvotes": 11,
                        "Text": "you fail when you give up. i also had to go through many and tried different programs across the country before it really stuck. you can still get through this to the other side. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jezx": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4jezx",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:56:35",
                        "Upvotes": 92,
                        "Text": "If your mom isn't taking your struggles seriously, is there anyone else you could reach out to? Are you in university? Is there a mental health service you could reach out to?\n\nI would not recommend doing a mono, but if you can eat anything that can give you enough energy until you can meet with someone who will take you seriously, please do so.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4jift": [
                        {
                            "Parent ID": "t1_eg4jezx",
                            "Comment ID": "eg4jift",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:57:59",
                            "Upvotes": 39,
                            "Text": "I'm going to eat an apple. Will it make me gain weight? I just want to wake up lighter tomorrow ",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4zxl4": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4zxl4",
                        "Author": "linedryonly",
                        "Date Created": "02-09-2019 23:04:03",
                        "Upvotes": 47,
                        "Text": "Hey I just want to give an alternative explanation to why your mom may have gotten mad. It's possible that she's frustrated because she wants you to be better and she feels powerless to help. It's common for families and loved ones to react with anger because they hate that you're suffering but they can't do anything to fix it. I don't how your relationship with your mother, but I think it's likely that she's angry because she loves you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jru3": [
                [
                    {
                        "Parent ID": "t1_eg4jift",
                        "Comment ID": "eg4jru3",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:01:45",
                        "Upvotes": 63,
                        "Text": "You may have some water retention if you haven't drank anything today. Please consider reaching out to someone who will take your problems seriously. Your recovery team? Your dietician if need be?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4k1ki": [
                        {
                            "Parent ID": "t1_eg4jru3",
                            "Comment ID": "eg4k1ki",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:05:46",
                            "Upvotes": 38,
                            "Text": "I have already, but it'll be a while before I see anyone on my team. And I've been drinking plenty of plain water",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4k84f": [
                [
                    {
                        "Parent ID": "t1_eg4k1ki",
                        "Comment ID": "eg4k84f",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:08:28",
                        "Upvotes": 79,
                        "Text": "You can also eat a bit of salt in order to help your electrolytes. Potassium chloride will help a lot too, if you have it.\n\nI'm not sure if your timezone is EST. Are you going to sleep soon? I can stay up with you if you feel like you won't make it til morning.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kd9y": [
                        {
                            "Parent ID": "t1_eg4k84f",
                            "Comment ID": "eg4kd9y",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:10:34",
                            "Upvotes": 53,
                            "Text": "I think I'll make it, thank you so much. I'll go to sleep in a few hours, it's about 7 PM. I'm eating my apple but I don't think I'll add any salt, I feel much better. Thank you so much, you are such a great person!!! <3",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4kpsl": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4kpsl",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:15:31",
                        "Upvotes": 10,
                        "Text": "I'll check in with you tomorrow morning, okay? What time do you usually wake up?\n\nI've been where you are now, and having someone who just wanted to know that I was okay helped more than you can imagine. If I can do even a small percentage of that for you, I'm happy.\n\nAlso, if you feel like you need to talk at any point in the night, please don't hesitate to message me!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kxxo": [
                        {
                            "Parent ID": "t1_eg4kpsl",
                            "Comment ID": "eg4kxxo",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:18:40",
                            "Upvotes": 8,
                            "Text": "Thank you so much. I should be up by 10 at the latest",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4uveg": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4uveg",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:42:49",
                        "Upvotes": 3,
                        "Text": "Proud of you for the apple! ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4kzh1": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4kzh1",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:19:17",
                        "Upvotes": 11,
                        "Text": "Thank you again, you have no idea how much you helped me. I honestly think you may have saved my life",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4lbwg": [
                        {
                            "Parent ID": "t1_eg4kzh1",
                            "Comment ID": "eg4lbwg",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:24:16",
                            "Upvotes": 11,
                            "Text": "You are loved here",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4l2t0": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4l2t0",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:20:37",
                        "Upvotes": 5,
                        "Text": "You're welcome ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "eg4zasb": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg4zasb",
                "Author": "FancyForager",
                "Date Created": "02-09-2019 22:52:49",
                "Upvotes": 34,
                "Text": "We are all here for you. You can even pm me and I will give you my phone number and you can literally call me on the phone. I won't even talk much, I will just listen. Please choose to keep living. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eg5cxsv": [
                {
                    "Parent ID": "t1_eg4zasb",
                    "Comment ID": "eg5cxsv",
                    "Author": "KimHyorin",
                    "Date Created": "02-10-2019 04:21:35",
                    "Upvotes": 13,
                    "Text": "Seconding this. Please keep fighting.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "eg4t4fr": [
                [
                    {
                        "Parent ID": "t1_eg4t1v1",
                        "Comment ID": "eg4t4fr",
                        "Author": "toritxtornado",
                        "Date Created": "02-09-2019 21:17:13",
                        "Upvotes": 61,
                        "Text": "agreed. an ER visit is the right call here. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4v3md": [
                        {
                            "Parent ID": "t1_eg4t4fr",
                            "Comment ID": "eg4v3md",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 21:46:09",
                            "Upvotes": 51,
                            "Text": "Thank you guys, but I've been at this weight before. I've also been through multiple hospitalizations and 2 residential programs, all of which have clearly failed. We'll see what happens  next weekend, my mom is coming to see me then. For now I'm just going to go to bed. Thank you all for your serious and well thought out advice.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4i5vi": [
                [
                    {
                        "Parent ID": "t1_eg4i35j",
                        "Comment ID": "eg4i5vi",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:38:57",
                        "Upvotes": 81,
                        "Text": "She loves you. She cares about you. Your mom will not be mad at you. It's okay to be scared, but you have to be brave too. If you can't be brave for yourself, please be brave for me?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4izd8": [
                        {
                            "Parent ID": "t1_eg4i5vi",
                            "Comment ID": "eg4izd8",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:50:24",
                            "Upvotes": 80,
                            "Text": "I called, she got mad. She told me to drink propel and eat something, but I'm thinking I can salvage this by doing a mono and eating an apple. I can't drink the propel because that would mess up the mono",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4vswr": [
                [
                    {
                        "Parent ID": "t1_eg4v84c",
                        "Comment ID": "eg4vswr",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:56:44",
                        "Upvotes": 24,
                        "Text": "I’m sorry if I implied you were actively suicidal. That’s my reason for having a list, but I can tell in your post that you’re fighting a different kind of darkness. \n\nThe thing I realized about my darkness is that once I got help for my ED and severe depression for the first time, it changed everything. All of a sudden, things weren’t pitch black; they were just... dark, because I’d seen a glimpse of life on the other side. I had context all of a sudden, and this sadness wasn’t the only thing I knew how to feel. \n\nI relapse all the time, and sometimes I’m a huge mess, but now I know it’s not permanent. I know I can have moments and those moments can string together and become entire days of feeling normal. \n\nI felt like a huge idiot for getting help, honestly. Like a fraud who brought all her problems upon herself. But today I’m still here, and I can honestly say that I’m glad, even though a huge part of me always wishes my ED would just be the end of me. \n\nI’m so glad you ate an apple. It sounds like your mom is diminishing your struggle. Can you get to an ER on your own? Is there anyone else you can call?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg5to4k": [
                        {
                            "Parent ID": "t1_eg4vswr",
                            "Comment ID": "eg5to4k",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 10:19:13",
                            "Upvotes": 4,
                            "Text": "Thank you, and you didn't imply anything. Your words help a lot. I'll be reaching out in person next time I see my mom. She doesn't mean to make it worse, I know that. But she always just says \"you can get better if you just make yourself \" which of course doesn't help at all. I know she means well but honestly at this point I want to stop asking for her help. I don't have anyone else close enough though",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg6s61b": [
                [
                    {
                        "Parent ID": "t1_eg6ofig",
                        "Comment ID": "eg6s61b",
                        "Author": "patbumbum",
                        "Date Created": "02-10-2019 17:48:16",
                        "Upvotes": 3,
                        "Text": "Banana bag. Is a multivitamin bag, It  yellow. How are you moving around with 11.6 bmi",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg6skj0": [
                        {
                            "Parent ID": "t1_eg6s61b",
                            "Comment ID": "eg6skj0",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 17:53:47",
                            "Upvotes": 2,
                            "Text": "It's actually a bit lower now",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg50nqd": [
                [
                    {
                        "Parent ID": "t1_eg4z56y",
                        "Comment ID": "eg50nqd",
                        "Author": "sstephenn",
                        "Date Created": "02-09-2019 23:17:02",
                        "Upvotes": 36,
                        "Text": "this wasn’t meant to be rude this was just my reaction when seeing the post, this person needs to be hospitalized. This BMI is Incompatible with life. I didn’t mean to come off as harsh just absolutely shocked me when I read that number oof",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg59z89": [
                        {
                            "Parent ID": "t1_eg50nqd",
                            "Comment ID": "eg59z89",
                            "Author": "NoaahFoster",
                            "Date Created": "02-10-2019 02:53:09",
                            "Upvotes": 21,
                            "Text": "I was shocked too. OP’s BMI would need to go up by seven more to be within the *lowest* healthy BMI range... when I read that my first thought was I am afraid for this person’s life. I hope they get the life saving help they need before it’s too late. ",
                            "Edited?": "02-10-2019 02:56:41",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4x1e9": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg4x1e9",
                        "Author": "broketreebranch",
                        "Date Created": "02-09-2019 22:15:44",
                        "Upvotes": 99,
                        "Text": "Please don’t give up. Please go to an ER soon. You could die in your sleep. Your life is worthy. There are people who care about you and are rooting for you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg542kx": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg542kx",
                        "Author": "bakermillerfloyd",
                        "Date Created": "02-10-2019 00:23:25",
                        "Upvotes": 62,
                        "Text": "Going to bed will not fix this. Your mom may not get to see you next weekend nor ever again. This is coming from somebody who's been where you are- get help *now*.",
                        "Edited?": "02-10-2019 01:12:55",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg54mzq": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg54mzq",
                        "Author": "lizzyb187",
                        "Date Created": "02-10-2019 00:35:52",
                        "Upvotes": 36,
                        "Text": "There is a lot of failure on the way to being successful. Failure means you're trying. Keep trying, even if you fail again. You wont always fail. Stick with it. I have faith that you can do it. I care.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg5nb9m": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg5nb9m",
                        "Author": "toritxtornado",
                        "Date Created": "02-10-2019 08:42:52",
                        "Upvotes": 11,
                        "Text": "you fail when you give up. i also had to go through many and tried different programs across the country before it really stuck. you can still get through this to the other side. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jezx": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4jezx",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:56:35",
                        "Upvotes": 92,
                        "Text": "If your mom isn't taking your struggles seriously, is there anyone else you could reach out to? Are you in university? Is there a mental health service you could reach out to?\n\nI would not recommend doing a mono, but if you can eat anything that can give you enough energy until you can meet with someone who will take you seriously, please do so.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4jift": [
                        {
                            "Parent ID": "t1_eg4jezx",
                            "Comment ID": "eg4jift",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:57:59",
                            "Upvotes": 39,
                            "Text": "I'm going to eat an apple. Will it make me gain weight? I just want to wake up lighter tomorrow ",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4zxl4": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4zxl4",
                        "Author": "linedryonly",
                        "Date Created": "02-09-2019 23:04:03",
                        "Upvotes": 47,
                        "Text": "Hey I just want to give an alternative explanation to why your mom may have gotten mad. It's possible that she's frustrated because she wants you to be better and she feels powerless to help. It's common for families and loved ones to react with anger because they hate that you're suffering but they can't do anything to fix it. I don't how your relationship with your mother, but I think it's likely that she's angry because she loves you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jru3": [
                [
                    {
                        "Parent ID": "t1_eg4jift",
                        "Comment ID": "eg4jru3",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:01:45",
                        "Upvotes": 63,
                        "Text": "You may have some water retention if you haven't drank anything today. Please consider reaching out to someone who will take your problems seriously. Your recovery team? Your dietician if need be?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4k1ki": [
                        {
                            "Parent ID": "t1_eg4jru3",
                            "Comment ID": "eg4k1ki",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:05:46",
                            "Upvotes": 38,
                            "Text": "I have already, but it'll be a while before I see anyone on my team. And I've been drinking plenty of plain water",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4k84f": [
                [
                    {
                        "Parent ID": "t1_eg4k1ki",
                        "Comment ID": "eg4k84f",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:08:28",
                        "Upvotes": 79,
                        "Text": "You can also eat a bit of salt in order to help your electrolytes. Potassium chloride will help a lot too, if you have it.\n\nI'm not sure if your timezone is EST. Are you going to sleep soon? I can stay up with you if you feel like you won't make it til morning.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kd9y": [
                        {
                            "Parent ID": "t1_eg4k84f",
                            "Comment ID": "eg4kd9y",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:10:34",
                            "Upvotes": 53,
                            "Text": "I think I'll make it, thank you so much. I'll go to sleep in a few hours, it's about 7 PM. I'm eating my apple but I don't think I'll add any salt, I feel much better. Thank you so much, you are such a great person!!! <3",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4kpsl": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4kpsl",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:15:31",
                        "Upvotes": 10,
                        "Text": "I'll check in with you tomorrow morning, okay? What time do you usually wake up?\n\nI've been where you are now, and having someone who just wanted to know that I was okay helped more than you can imagine. If I can do even a small percentage of that for you, I'm happy.\n\nAlso, if you feel like you need to talk at any point in the night, please don't hesitate to message me!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kxxo": [
                        {
                            "Parent ID": "t1_eg4kpsl",
                            "Comment ID": "eg4kxxo",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:18:40",
                            "Upvotes": 8,
                            "Text": "Thank you so much. I should be up by 10 at the latest",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4uveg": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4uveg",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:42:49",
                        "Upvotes": 3,
                        "Text": "Proud of you for the apple! ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4kzh1": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4kzh1",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:19:17",
                        "Upvotes": 11,
                        "Text": "Thank you again, you have no idea how much you helped me. I honestly think you may have saved my life",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4lbwg": [
                        {
                            "Parent ID": "t1_eg4kzh1",
                            "Comment ID": "eg4lbwg",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:24:16",
                            "Upvotes": 11,
                            "Text": "You are loved here",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4l2t0": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4l2t0",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:20:37",
                        "Upvotes": 5,
                        "Text": "You're welcome ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "eg59c9z": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg59c9z",
                "Author": "[deleted]",
                "Date Created": "02-10-2019 02:35:18",
                "Upvotes": 31,
                "Text": "this makes me weep. you will die at this rate, and soon. I’m hoping you are sleeping soundly and waking up in a few hours with the will to keep moving forward. \n\nfriend, please picture yourself explaining this to your younger self, they’re only 3 or 4 years old. could you explain this to them? hold their hand and tell them how you’re going to starve them out? there is a version of you, deeply buried beneath the hate and loathing, who longs to be cared for. please care for them. please give them electrolytes today, and a little salt. we love you. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eg4xalh": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg4xalh",
                "Author": "surpriseDRE",
                "Date Created": "02-09-2019 22:19:48",
                "Upvotes": 28,
                "Text": "My friend, you need help. You need to ask for help. Your mom isn’t cutting it. Things can absolutely get better, but not if you continue like this. Please please please ask someone other than your mom. You are a human being and you deserve to eat and to live. Call the suicide hotline if nothing else. I know you’re not actively suicidal but they can help with crises and it sounds like you’re having a crisis ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eg54frt": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg54frt",
                "Author": "Tylly",
                "Date Created": "02-10-2019 00:31:26",
                "Upvotes": 26,
                "Text": "Don't give up yet tiny bunny, we need you around. We're all in this together, we need you.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eg5u0vp": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg5u0vp",
                "Author": "Chibi-Bunny",
                "Date Created": "02-10-2019 10:23:47",
                "Upvotes": 19,
                "Text": "Thank you all so much. I made it through the night and I'm going to try to make it until I can see my mom again. I'm going to let her know what's been going on and hopefully she can set up an appointment with my treatment team. I need to see them again. I'm scared but I don't want to die. Thank you all again so much, you are all so wonderful. I truly hope you all get the help you deserve as well. Stay strong and fight, I will too. Thank you again, from the bottom of my heart",
                "Edited?": false,
                "Is Submitter?": true,
                "Stickied?": false
            }
        ]
    ],
    "eg53tfb": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg53tfb",
                "Author": "brucie239",
                "Date Created": "02-10-2019 00:18:04",
                "Upvotes": 10,
                "Text": "you are loved, we are here for you, please message if you need to talk",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eg5450m": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg5450m",
                "Author": "wondermadness",
                "Date Created": "02-10-2019 00:24:53",
                "Upvotes": 8,
                "Text": "Please stay strong honey, I’m here if you need anyone to talk to. Just remember you have what it takes to recover, we all believe in you. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eg5bgzw": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg5bgzw",
                "Author": "kittenbun",
                "Date Created": "02-10-2019 03:36:58",
                "Upvotes": 11,
                "Text": "your mom loves you and you love her, please know that there is no pain worse than losing your baby, she carried you inside her for 9 months, carefully, looking after you both until she could bring you into the world. if you die now she will never recover and her heart will be broken until she joins you in death, so please, please try and get help again, you are worth so much and you deserve to be happy, you have your whole life ahead of you. please keep us updated as i can see from the other comments that we are all so worried about you and want you to get better xx",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eg5nrs5": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg5nrs5",
                "Author": "Heartfr0st",
                "Date Created": "02-10-2019 08:50:39",
                "Upvotes": 3,
                "Text": "I’m with everyone else, if you need anyone to talk to, my inbox is open. Please please try and take care of yourself. I know it’s so hard to convince yourself to eat, but just remember that even if you eat 500-600 calories, it will STILL result in long term weight loss. I know those are really scary numbers for you right now, and I’m not saying you should eat that much. It’s more of a reminder that you have a higher ceiling than your brain is letting you think you have.\n\nI was in recovery for about 4 months recently, and my therapist would always repeat to me that “food is fuel”. I don’t know if this will work for you but maybe you could think of food as a tool to get you to the moment where you can get help? It’s not the scary enemy, but rather something for you to use.\n\nI just desperately want you to hold on until you’re able to get help again. Sending every bit of love and support. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eg5pzi0": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg5pzi0",
                "Author": "new-accwho-dis",
                "Date Created": "02-10-2019 09:26:06",
                "Upvotes": 3,
                "Text": "im so sorry, i really really hope youre ok.. you deserve to live :(( ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eg6o3j2": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg6o3j2",
                "Author": "patbumbum",
                "Date Created": "02-10-2019 16:53:04",
                "Upvotes": 3,
                "Text": "11.6 is not compatible with life. Call an Uber get yourself to Emergency room for a banana bag and a check up.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eg6ofig": [
                {
                    "Parent ID": "t1_eg6o3j2",
                    "Comment ID": "eg6ofig",
                    "Author": "Chibi-Bunny",
                    "Date Created": "02-10-2019 16:57:25",
                    "Upvotes": 2,
                    "Text": "I have no idea what a banana bag is, but I literally have to wait until at least next weekend before I'm able to see a doctor. Thanks for the concern but I'll be ok, this isn't my first time here",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "eg6s61b": [
                        {
                            "Parent ID": "t1_eg6ofig",
                            "Comment ID": "eg6s61b",
                            "Author": "patbumbum",
                            "Date Created": "02-10-2019 17:48:16",
                            "Upvotes": 3,
                            "Text": "Banana bag. Is a multivitamin bag, It  yellow. How are you moving around with 11.6 bmi",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4t4fr": [
                [
                    {
                        "Parent ID": "t1_eg4t1v1",
                        "Comment ID": "eg4t4fr",
                        "Author": "toritxtornado",
                        "Date Created": "02-09-2019 21:17:13",
                        "Upvotes": 61,
                        "Text": "agreed. an ER visit is the right call here. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4v3md": [
                        {
                            "Parent ID": "t1_eg4t4fr",
                            "Comment ID": "eg4v3md",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 21:46:09",
                            "Upvotes": 51,
                            "Text": "Thank you guys, but I've been at this weight before. I've also been through multiple hospitalizations and 2 residential programs, all of which have clearly failed. We'll see what happens  next weekend, my mom is coming to see me then. For now I'm just going to go to bed. Thank you all for your serious and well thought out advice.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4i5vi": [
                [
                    {
                        "Parent ID": "t1_eg4i35j",
                        "Comment ID": "eg4i5vi",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:38:57",
                        "Upvotes": 81,
                        "Text": "She loves you. She cares about you. Your mom will not be mad at you. It's okay to be scared, but you have to be brave too. If you can't be brave for yourself, please be brave for me?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4izd8": [
                        {
                            "Parent ID": "t1_eg4i5vi",
                            "Comment ID": "eg4izd8",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:50:24",
                            "Upvotes": 80,
                            "Text": "I called, she got mad. She told me to drink propel and eat something, but I'm thinking I can salvage this by doing a mono and eating an apple. I can't drink the propel because that would mess up the mono",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4vswr": [
                [
                    {
                        "Parent ID": "t1_eg4v84c",
                        "Comment ID": "eg4vswr",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:56:44",
                        "Upvotes": 24,
                        "Text": "I’m sorry if I implied you were actively suicidal. That’s my reason for having a list, but I can tell in your post that you’re fighting a different kind of darkness. \n\nThe thing I realized about my darkness is that once I got help for my ED and severe depression for the first time, it changed everything. All of a sudden, things weren’t pitch black; they were just... dark, because I’d seen a glimpse of life on the other side. I had context all of a sudden, and this sadness wasn’t the only thing I knew how to feel. \n\nI relapse all the time, and sometimes I’m a huge mess, but now I know it’s not permanent. I know I can have moments and those moments can string together and become entire days of feeling normal. \n\nI felt like a huge idiot for getting help, honestly. Like a fraud who brought all her problems upon herself. But today I’m still here, and I can honestly say that I’m glad, even though a huge part of me always wishes my ED would just be the end of me. \n\nI’m so glad you ate an apple. It sounds like your mom is diminishing your struggle. Can you get to an ER on your own? Is there anyone else you can call?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg5to4k": [
                        {
                            "Parent ID": "t1_eg4vswr",
                            "Comment ID": "eg5to4k",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 10:19:13",
                            "Upvotes": 4,
                            "Text": "Thank you, and you didn't imply anything. Your words help a lot. I'll be reaching out in person next time I see my mom. She doesn't mean to make it worse, I know that. But she always just says \"you can get better if you just make yourself \" which of course doesn't help at all. I know she means well but honestly at this point I want to stop asking for her help. I don't have anyone else close enough though",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg50nqd": [
                [
                    {
                        "Parent ID": "t1_eg4z56y",
                        "Comment ID": "eg50nqd",
                        "Author": "sstephenn",
                        "Date Created": "02-09-2019 23:17:02",
                        "Upvotes": 36,
                        "Text": "this wasn’t meant to be rude this was just my reaction when seeing the post, this person needs to be hospitalized. This BMI is Incompatible with life. I didn’t mean to come off as harsh just absolutely shocked me when I read that number oof",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg59z89": [
                        {
                            "Parent ID": "t1_eg50nqd",
                            "Comment ID": "eg59z89",
                            "Author": "NoaahFoster",
                            "Date Created": "02-10-2019 02:53:09",
                            "Upvotes": 21,
                            "Text": "I was shocked too. OP’s BMI would need to go up by seven more to be within the *lowest* healthy BMI range... when I read that my first thought was I am afraid for this person’s life. I hope they get the life saving help they need before it’s too late. ",
                            "Edited?": "02-10-2019 02:56:41",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg6skj0": [
                [
                    {
                        "Parent ID": "t1_eg6s61b",
                        "Comment ID": "eg6skj0",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-10-2019 17:53:47",
                        "Upvotes": 2,
                        "Text": "It's actually a bit lower now",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4x1e9": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg4x1e9",
                        "Author": "broketreebranch",
                        "Date Created": "02-09-2019 22:15:44",
                        "Upvotes": 99,
                        "Text": "Please don’t give up. Please go to an ER soon. You could die in your sleep. Your life is worthy. There are people who care about you and are rooting for you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg542kx": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg542kx",
                        "Author": "bakermillerfloyd",
                        "Date Created": "02-10-2019 00:23:25",
                        "Upvotes": 62,
                        "Text": "Going to bed will not fix this. Your mom may not get to see you next weekend nor ever again. This is coming from somebody who's been where you are- get help *now*.",
                        "Edited?": "02-10-2019 01:12:55",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg54mzq": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg54mzq",
                        "Author": "lizzyb187",
                        "Date Created": "02-10-2019 00:35:52",
                        "Upvotes": 36,
                        "Text": "There is a lot of failure on the way to being successful. Failure means you're trying. Keep trying, even if you fail again. You wont always fail. Stick with it. I have faith that you can do it. I care.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg5nb9m": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg5nb9m",
                        "Author": "toritxtornado",
                        "Date Created": "02-10-2019 08:42:52",
                        "Upvotes": 11,
                        "Text": "you fail when you give up. i also had to go through many and tried different programs across the country before it really stuck. you can still get through this to the other side. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jezx": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4jezx",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:56:35",
                        "Upvotes": 92,
                        "Text": "If your mom isn't taking your struggles seriously, is there anyone else you could reach out to? Are you in university? Is there a mental health service you could reach out to?\n\nI would not recommend doing a mono, but if you can eat anything that can give you enough energy until you can meet with someone who will take you seriously, please do so.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4jift": [
                        {
                            "Parent ID": "t1_eg4jezx",
                            "Comment ID": "eg4jift",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:57:59",
                            "Upvotes": 39,
                            "Text": "I'm going to eat an apple. Will it make me gain weight? I just want to wake up lighter tomorrow ",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4zxl4": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4zxl4",
                        "Author": "linedryonly",
                        "Date Created": "02-09-2019 23:04:03",
                        "Upvotes": 47,
                        "Text": "Hey I just want to give an alternative explanation to why your mom may have gotten mad. It's possible that she's frustrated because she wants you to be better and she feels powerless to help. It's common for families and loved ones to react with anger because they hate that you're suffering but they can't do anything to fix it. I don't how your relationship with your mother, but I think it's likely that she's angry because she loves you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jru3": [
                [
                    {
                        "Parent ID": "t1_eg4jift",
                        "Comment ID": "eg4jru3",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:01:45",
                        "Upvotes": 63,
                        "Text": "You may have some water retention if you haven't drank anything today. Please consider reaching out to someone who will take your problems seriously. Your recovery team? Your dietician if need be?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4k1ki": [
                        {
                            "Parent ID": "t1_eg4jru3",
                            "Comment ID": "eg4k1ki",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:05:46",
                            "Upvotes": 38,
                            "Text": "I have already, but it'll be a while before I see anyone on my team. And I've been drinking plenty of plain water",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4k84f": [
                [
                    {
                        "Parent ID": "t1_eg4k1ki",
                        "Comment ID": "eg4k84f",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:08:28",
                        "Upvotes": 79,
                        "Text": "You can also eat a bit of salt in order to help your electrolytes. Potassium chloride will help a lot too, if you have it.\n\nI'm not sure if your timezone is EST. Are you going to sleep soon? I can stay up with you if you feel like you won't make it til morning.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kd9y": [
                        {
                            "Parent ID": "t1_eg4k84f",
                            "Comment ID": "eg4kd9y",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:10:34",
                            "Upvotes": 53,
                            "Text": "I think I'll make it, thank you so much. I'll go to sleep in a few hours, it's about 7 PM. I'm eating my apple but I don't think I'll add any salt, I feel much better. Thank you so much, you are such a great person!!! <3",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4kpsl": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4kpsl",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:15:31",
                        "Upvotes": 10,
                        "Text": "I'll check in with you tomorrow morning, okay? What time do you usually wake up?\n\nI've been where you are now, and having someone who just wanted to know that I was okay helped more than you can imagine. If I can do even a small percentage of that for you, I'm happy.\n\nAlso, if you feel like you need to talk at any point in the night, please don't hesitate to message me!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kxxo": [
                        {
                            "Parent ID": "t1_eg4kpsl",
                            "Comment ID": "eg4kxxo",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:18:40",
                            "Upvotes": 8,
                            "Text": "Thank you so much. I should be up by 10 at the latest",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4uveg": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4uveg",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:42:49",
                        "Upvotes": 3,
                        "Text": "Proud of you for the apple! ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4kzh1": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4kzh1",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:19:17",
                        "Upvotes": 11,
                        "Text": "Thank you again, you have no idea how much you helped me. I honestly think you may have saved my life",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4lbwg": [
                        {
                            "Parent ID": "t1_eg4kzh1",
                            "Comment ID": "eg4lbwg",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:24:16",
                            "Upvotes": 11,
                            "Text": "You are loved here",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4l2t0": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4l2t0",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:20:37",
                        "Upvotes": 5,
                        "Text": "You're welcome ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "eg4tzwn": [
        [
            {
                "Parent ID": "t3_aoynfb",
                "Comment ID": "eg4tzwn",
                "Author": "sstephenn",
                "Date Created": "02-09-2019 21:29:50",
                "Upvotes": -57,
                "Text": "11.6 what the hell",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eg4z56y": [
                {
                    "Parent ID": "t1_eg4tzwn",
                    "Comment ID": "eg4z56y",
                    "Author": "FancyForager",
                    "Date Created": "02-09-2019 22:50:09",
                    "Upvotes": 21,
                    "Text": "Wow fuck off",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "eg50nqd": [
                        {
                            "Parent ID": "t1_eg4z56y",
                            "Comment ID": "eg50nqd",
                            "Author": "sstephenn",
                            "Date Created": "02-09-2019 23:17:02",
                            "Upvotes": 36,
                            "Text": "this wasn’t meant to be rude this was just my reaction when seeing the post, this person needs to be hospitalized. This BMI is Incompatible with life. I didn’t mean to come off as harsh just absolutely shocked me when I read that number oof",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4t4fr": [
                [
                    {
                        "Parent ID": "t1_eg4t1v1",
                        "Comment ID": "eg4t4fr",
                        "Author": "toritxtornado",
                        "Date Created": "02-09-2019 21:17:13",
                        "Upvotes": 61,
                        "Text": "agreed. an ER visit is the right call here. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4v3md": [
                        {
                            "Parent ID": "t1_eg4t4fr",
                            "Comment ID": "eg4v3md",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 21:46:09",
                            "Upvotes": 51,
                            "Text": "Thank you guys, but I've been at this weight before. I've also been through multiple hospitalizations and 2 residential programs, all of which have clearly failed. We'll see what happens  next weekend, my mom is coming to see me then. For now I'm just going to go to bed. Thank you all for your serious and well thought out advice.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4i5vi": [
                [
                    {
                        "Parent ID": "t1_eg4i35j",
                        "Comment ID": "eg4i5vi",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:38:57",
                        "Upvotes": 81,
                        "Text": "She loves you. She cares about you. Your mom will not be mad at you. It's okay to be scared, but you have to be brave too. If you can't be brave for yourself, please be brave for me?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4izd8": [
                        {
                            "Parent ID": "t1_eg4i5vi",
                            "Comment ID": "eg4izd8",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:50:24",
                            "Upvotes": 80,
                            "Text": "I called, she got mad. She told me to drink propel and eat something, but I'm thinking I can salvage this by doing a mono and eating an apple. I can't drink the propel because that would mess up the mono",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4vswr": [
                [
                    {
                        "Parent ID": "t1_eg4v84c",
                        "Comment ID": "eg4vswr",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:56:44",
                        "Upvotes": 24,
                        "Text": "I’m sorry if I implied you were actively suicidal. That’s my reason for having a list, but I can tell in your post that you’re fighting a different kind of darkness. \n\nThe thing I realized about my darkness is that once I got help for my ED and severe depression for the first time, it changed everything. All of a sudden, things weren’t pitch black; they were just... dark, because I’d seen a glimpse of life on the other side. I had context all of a sudden, and this sadness wasn’t the only thing I knew how to feel. \n\nI relapse all the time, and sometimes I’m a huge mess, but now I know it’s not permanent. I know I can have moments and those moments can string together and become entire days of feeling normal. \n\nI felt like a huge idiot for getting help, honestly. Like a fraud who brought all her problems upon herself. But today I’m still here, and I can honestly say that I’m glad, even though a huge part of me always wishes my ED would just be the end of me. \n\nI’m so glad you ate an apple. It sounds like your mom is diminishing your struggle. Can you get to an ER on your own? Is there anyone else you can call?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg5to4k": [
                        {
                            "Parent ID": "t1_eg4vswr",
                            "Comment ID": "eg5to4k",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 10:19:13",
                            "Upvotes": 4,
                            "Text": "Thank you, and you didn't imply anything. Your words help a lot. I'll be reaching out in person next time I see my mom. She doesn't mean to make it worse, I know that. But she always just says \"you can get better if you just make yourself \" which of course doesn't help at all. I know she means well but honestly at this point I want to stop asking for her help. I don't have anyone else close enough though",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg6s61b": [
                [
                    {
                        "Parent ID": "t1_eg6ofig",
                        "Comment ID": "eg6s61b",
                        "Author": "patbumbum",
                        "Date Created": "02-10-2019 17:48:16",
                        "Upvotes": 3,
                        "Text": "Banana bag. Is a multivitamin bag, It  yellow. How are you moving around with 11.6 bmi",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg6skj0": [
                        {
                            "Parent ID": "t1_eg6s61b",
                            "Comment ID": "eg6skj0",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-10-2019 17:53:47",
                            "Upvotes": 2,
                            "Text": "It's actually a bit lower now",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg59z89": [
                [
                    {
                        "Parent ID": "t1_eg50nqd",
                        "Comment ID": "eg59z89",
                        "Author": "NoaahFoster",
                        "Date Created": "02-10-2019 02:53:09",
                        "Upvotes": 21,
                        "Text": "I was shocked too. OP’s BMI would need to go up by seven more to be within the *lowest* healthy BMI range... when I read that my first thought was I am afraid for this person’s life. I hope they get the life saving help they need before it’s too late. ",
                        "Edited?": "02-10-2019 02:56:41",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4x1e9": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg4x1e9",
                        "Author": "broketreebranch",
                        "Date Created": "02-09-2019 22:15:44",
                        "Upvotes": 99,
                        "Text": "Please don’t give up. Please go to an ER soon. You could die in your sleep. Your life is worthy. There are people who care about you and are rooting for you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg542kx": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg542kx",
                        "Author": "bakermillerfloyd",
                        "Date Created": "02-10-2019 00:23:25",
                        "Upvotes": 62,
                        "Text": "Going to bed will not fix this. Your mom may not get to see you next weekend nor ever again. This is coming from somebody who's been where you are- get help *now*.",
                        "Edited?": "02-10-2019 01:12:55",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg54mzq": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg54mzq",
                        "Author": "lizzyb187",
                        "Date Created": "02-10-2019 00:35:52",
                        "Upvotes": 36,
                        "Text": "There is a lot of failure on the way to being successful. Failure means you're trying. Keep trying, even if you fail again. You wont always fail. Stick with it. I have faith that you can do it. I care.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg5nb9m": [
                [
                    {
                        "Parent ID": "t1_eg4v3md",
                        "Comment ID": "eg5nb9m",
                        "Author": "toritxtornado",
                        "Date Created": "02-10-2019 08:42:52",
                        "Upvotes": 11,
                        "Text": "you fail when you give up. i also had to go through many and tried different programs across the country before it really stuck. you can still get through this to the other side. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jezx": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4jezx",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 18:56:35",
                        "Upvotes": 92,
                        "Text": "If your mom isn't taking your struggles seriously, is there anyone else you could reach out to? Are you in university? Is there a mental health service you could reach out to?\n\nI would not recommend doing a mono, but if you can eat anything that can give you enough energy until you can meet with someone who will take you seriously, please do so.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4jift": [
                        {
                            "Parent ID": "t1_eg4jezx",
                            "Comment ID": "eg4jift",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 18:57:59",
                            "Upvotes": 39,
                            "Text": "I'm going to eat an apple. Will it make me gain weight? I just want to wake up lighter tomorrow ",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4zxl4": [
                [
                    {
                        "Parent ID": "t1_eg4izd8",
                        "Comment ID": "eg4zxl4",
                        "Author": "linedryonly",
                        "Date Created": "02-09-2019 23:04:03",
                        "Upvotes": 47,
                        "Text": "Hey I just want to give an alternative explanation to why your mom may have gotten mad. It's possible that she's frustrated because she wants you to be better and she feels powerless to help. It's common for families and loved ones to react with anger because they hate that you're suffering but they can't do anything to fix it. I don't how your relationship with your mother, but I think it's likely that she's angry because she loves you.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4jru3": [
                [
                    {
                        "Parent ID": "t1_eg4jift",
                        "Comment ID": "eg4jru3",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:01:45",
                        "Upvotes": 63,
                        "Text": "You may have some water retention if you haven't drank anything today. Please consider reaching out to someone who will take your problems seriously. Your recovery team? Your dietician if need be?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4k1ki": [
                        {
                            "Parent ID": "t1_eg4jru3",
                            "Comment ID": "eg4k1ki",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:05:46",
                            "Upvotes": 38,
                            "Text": "I have already, but it'll be a while before I see anyone on my team. And I've been drinking plenty of plain water",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4k84f": [
                [
                    {
                        "Parent ID": "t1_eg4k1ki",
                        "Comment ID": "eg4k84f",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:08:28",
                        "Upvotes": 79,
                        "Text": "You can also eat a bit of salt in order to help your electrolytes. Potassium chloride will help a lot too, if you have it.\n\nI'm not sure if your timezone is EST. Are you going to sleep soon? I can stay up with you if you feel like you won't make it til morning.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kd9y": [
                        {
                            "Parent ID": "t1_eg4k84f",
                            "Comment ID": "eg4kd9y",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:10:34",
                            "Upvotes": 53,
                            "Text": "I think I'll make it, thank you so much. I'll go to sleep in a few hours, it's about 7 PM. I'm eating my apple but I don't think I'll add any salt, I feel much better. Thank you so much, you are such a great person!!! <3",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4kpsl": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4kpsl",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:15:31",
                        "Upvotes": 10,
                        "Text": "I'll check in with you tomorrow morning, okay? What time do you usually wake up?\n\nI've been where you are now, and having someone who just wanted to know that I was okay helped more than you can imagine. If I can do even a small percentage of that for you, I'm happy.\n\nAlso, if you feel like you need to talk at any point in the night, please don't hesitate to message me!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4kxxo": [
                        {
                            "Parent ID": "t1_eg4kpsl",
                            "Comment ID": "eg4kxxo",
                            "Author": "Chibi-Bunny",
                            "Date Created": "02-09-2019 19:18:40",
                            "Upvotes": 8,
                            "Text": "Thank you so much. I should be up by 10 at the latest",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4uveg": [
                [
                    {
                        "Parent ID": "t1_eg4kd9y",
                        "Comment ID": "eg4uveg",
                        "Author": "bunnyalert",
                        "Date Created": "02-09-2019 21:42:49",
                        "Upvotes": 3,
                        "Text": "Proud of you for the apple! ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eg4kzh1": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4kzh1",
                        "Author": "Chibi-Bunny",
                        "Date Created": "02-09-2019 19:19:17",
                        "Upvotes": 11,
                        "Text": "Thank you again, you have no idea how much you helped me. I honestly think you may have saved my life",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "eg4lbwg": [
                        {
                            "Parent ID": "t1_eg4kzh1",
                            "Comment ID": "eg4lbwg",
                            "Author": "bollarcones",
                            "Date Created": "02-09-2019 19:24:16",
                            "Upvotes": 11,
                            "Text": "You are loved here",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eg4l2t0": [
                [
                    {
                        "Parent ID": "t1_eg4kxxo",
                        "Comment ID": "eg4l2t0",
                        "Author": "bollarcones",
                        "Date Created": "02-09-2019 19:20:37",
                        "Upvotes": 5,
                        "Text": "You're welcome ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ]
}