{
    "ebu7idm": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebu7idm",
                "Author": "scrambledthoughts91",
                "Date Created": "12-15-2018 07:01:48",
                "Upvotes": 242,
                "Text": "That's the sad truth. People are attracted to beauty like moths to a flame. You don't even have to lift a finger. You're always special. The change in people's behaviour after you lose weight/get hot is unbelievable. \n\nBut tbh once you do get to your goal weight and see how people start treating you like a queen when they barely noticed you before, you might get turned off by their behaviour. In your heart you know that they love you only for how great you look so the connection might fizzle out. \n\n",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ebuazxe": [
                {
                    "Parent ID": "t1_ebu7idm",
                    "Comment ID": "ebuazxe",
                    "Author": "avakadava",
                    "Date Created": "12-15-2018 08:10:16",
                    "Upvotes": 49,
                    "Text": "that's fuckn sad, but that's life i guess",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ebunuja": [
                        {
                            "Parent ID": "t1_ebuazxe",
                            "Comment ID": "ebunuja",
                            "Author": "_Spicy_Lemon_",
                            "Date Created": "12-15-2018 11:13:34",
                            "Upvotes": 42,
                            "Text": "It has it perks though. The people who still treated you the same throughout weight fluctuations are golden. (Same as in always were a dope friend) ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw39mv": [
                [
                    {
                        "Parent ID": "t1_ebw214i",
                        "Comment ID": "ebw39mv",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:31:07",
                        "Upvotes": 15,
                        "Text": "> Moody, quiet, disinterested\n\nI find I tend to get an ok reaction to being my dead-pan moody self HAHA\n\nTheres so many different versions of cute. Please don't conflate being physically attractive with being skinny... if you know what I mean. That will likely just hurt you.\n\nRomantic relationships are possible for anyone who wants them.\n\n\nIt's ok to have moods and to have times when you are quiet and not cheery/popular.\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvzgo4": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebvzgo4",
                        "Author": "scrambledthoughts91",
                        "Date Created": "12-15-2018 21:28:56",
                        "Upvotes": 25,
                        "Text": "Hi, I currently live and work in India (I am Indian) but I have also worked in London and Dubai in the past 6 years and have similar experiences in all 3 countries. \n\nI work in a male dominated industry / financial sector (not my favourite job in the world but this is what I could get after my business degree) \n\nWhen I say \"don't have to lift a finger\" I don't mean I'm sitting on a throne like the queen of Sheba but what I meant is that when I'm around men or in public there are plenty of things that people offer to do to help , not just because I'm the fairer sex but because of how I look. \n\nThis isn't meant to be a brag because tbh I'm still stuck in the fat girl mindset and I get confused when people (especially men ) are too nice to me. It's an observation of what I have seen in my life. \n\nThis is also not to say that fat girls should be unhappy because even at my heaviest weight (220lbs) I had great friends, a boyfriend who adored me and a happy life. BUT after losing more than 100 lbs, everything just amplified 10 fold. \n\nI'm not saying that I love the attention but it is what it is. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0rp5": [
                        {
                            "Parent ID": "t1_ebvzgo4",
                            "Comment ID": "ebw0rp5",
                            "Author": "nodamncatnodamncradl",
                            "Date Created": "12-15-2018 21:49:30",
                            "Upvotes": 6,
                            "Text": "sorry answer only if you want to but, \nwhat specific nice things do people offer to help with in public or when you are \"around men\"? Do you feel like you can identify ways that this might be related to the  cultures  you listed or am I way off base\n\nWhat is \"being nice to you\" mean specifically, compared to how you remember being treated when you were 220?\n\nYour life sounds tremendously busy! You are a hiiiiiigh achiever and must have so much strength. I'm glad you feel like you've experienced a lot of happiness in your life.\n\nAny perspective about this is helping me understand something I don't feel like I have an awareness off\n\n",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw9kpt": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebw9kpt",
                        "Author": "bathroomhaunt",
                        "Date Created": "12-16-2018 00:30:53",
                        "Upvotes": 12,
                        "Text": "idk about treated like a queen necessarily but in the past few years ive gotten significantly more attractive and sometimes it does feel that way in comparison to me. when i was a chubby emo kid with blue hair ppl talked behind my back about how it was “nerdy” that i was a biology major. now that im a decently attractive blonde and about 50lbs lighter, when ppl talk about it im “smart” and “so determined”. dudes are A LOT nicer to me, and honestly girls want to be my friend way more often and go out of their way to do it. my classmates readily offer to help me with stuff, to study together, etc and that NEVER happened before. even my professors are nicer to me. people i went to high school with see my pics on instagram and suddenly now im worth talking to and they want to link up when im in my hometown. im sure to maintain all that i have to continue being a decently nice person lol, and i cant get away with just not doing anything bc who can but at least when it comes to this kinda stuff it definitely feels like i dont have to lift a finger anymore",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebx0x12": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebx0x12",
                        "Author": "BeginningBarnacle",
                        "Date Created": "12-16-2018 10:46:37",
                        "Upvotes": 11,
                        "Text": "Upvoting on reddit is a show of interest or support, not a ‘hey, that’s exactly me!’ \n\n(Although there are probably many pretty people here without a doubt)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvobul": [
                [
                    {
                        "Parent ID": "t1_ebvchoo",
                        "Comment ID": "ebvobul",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 18:47:14",
                        "Upvotes": 12,
                        "Text": "I don't think your comment is really downvote-worthy at all!\n\nIt's an opinion about the post and it doesn't contain anything egregiously insulting IMO\n\n I just find your opinion a tad confusing. \n\n\n\nWhat is part of the incel mindset ?\n\nWhat does \"they know they won't have to settle\" mean? (especialy the settle part, but I actually just don't understand this part at all... like what evidence about a group of people definied what \"settling\" is and then didn't do it. Is this idea based in sociology, anthropology, psychology, philosophy, or what?\n\nI DO TOTALLY agree that attractive* people in many cultures (thought cultures/world cultures/historical cultures) are treated better and have privilege. Like I said... I can see where you are getting at. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0h9f": [
                        {
                            "Parent ID": "t1_ebvobul",
                            "Comment ID": "ebw0h9f",
                            "Author": "Grellous8",
                            "Date Created": "12-15-2018 21:44:52",
                            "Upvotes": 1,
                            "Text": "> What is part of the incel mindset ?\n> \n> What does \"they know they won't have to settle\" mean?\n\nI meant settle for a less attractive partner. The incel part pertains to the idea that if one is an incel, unlike more attractive people, one would be more likely to settle for a less attractive partner (yes, I am aware that physical attraction doesn't/shouldn't make the entire relationship, but it does enhance *certain* aspects of the relationship, so understand that \"settle\" is just used for lack of a better word). I'm also willing to bet that most incels wouldn't mind being treated \"like a ~~queen~~ king\" even if \"(they) know that they love (them) only for how great (they) look so the connection might fizzle out.\" The point being that if/when girls lose weight, they can get more attention, but for guys it tends to take more than just weight loss to become more attractive to/get attention from the opposite sex.",
                            "Edited?": "12-15-2018 21:54:35",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebx0xti": [
                [
                    {
                        "Parent ID": "t1_ebvp7qj",
                        "Comment ID": "ebx0xti",
                        "Author": "LittleBookOfSorrows",
                        "Date Created": "12-16-2018 10:46:55",
                        "Upvotes": 2,
                        "Text": ">Wow what an awful way of thinking, having to put another girl down to comfort yourself.\n\nPreferable to starving yourself and getting into an ED mess to comfort yourself though.  That's a less healthy way to cope.  ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebups4y": [
                [
                    {
                        "Parent ID": "t1_ebunuja",
                        "Comment ID": "ebups4y",
                        "Author": "cherrymama",
                        "Date Created": "12-15-2018 11:37:46",
                        "Upvotes": 24,
                        "Text": "I read this like 5 times as “dope fiend” and I’m like damn yeah I’m sure addicts would treat you the same way esp if you had something on you but that doesn’t seem like the point OP is making ? 😂 \n\n\n\nPs I’m an ex addict not trying to make anyone feel bad for using or anything ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "eburgg6": [
                        {
                            "Parent ID": "t1_ebups4y",
                            "Comment ID": "eburgg6",
                            "Author": "_Spicy_Lemon_",
                            "Date Created": "12-15-2018 11:56:31",
                            "Upvotes": 10,
                            "Text": "Gurllllllllllllll😤😂🤔",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebxw1q3": [
                        {
                            "Parent ID": "t1_ebups4y",
                            "Comment ID": "ebxw1q3",
                            "Author": "Someone_Who_Isnt_You",
                            "Date Created": "12-16-2018 16:56:20",
                            "Upvotes": 5,
                            "Text": "Lol as an addict trying to stay sober I did the same thing too 😅",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebxwerh": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebxwerh",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 17:01:22",
                        "Upvotes": 10,
                        "Text": "Eh women need to do more than lose weight to get a man’s attention. It’s similar to what a guy needs to do. So yeah a girl can look good and put an makeup, but they still need to do upkeep on their bodies (most people don’t find skinny fat attractive), work on their teeth, quality of their skin, their personalities, work on their hair, and work on their social skills. This is all a given for women and most know that they can’t just be skinny to get men to like them. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebw3r44": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebw3r44",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:39:15",
                        "Upvotes": 3,
                        "Text": "I guess your perspective about what is possible in romantic relationships is different than mine, and I'm just having trouble hearing how you are explaining this.\n\nI think that women spend the most money on cosmetics and things like plastic surgeries... I'm not familiar with the statistics but I don't agree with you last sentence at all... it sounds like weird logic and I don't know what you mean when you say \"other things it tends to take.\"\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebx145p": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx145p",
                            "Author": "BeginningBarnacle",
                            "Date Created": "12-16-2018 10:49:27",
                            "Upvotes": 5,
                            "Text": "An interesting observation however, is that sure, this behaviour is seen in attractive women and attractive men, but where are the ‘incel’ women?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebx2jd8": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx2jd8",
                            "Author": "Grellous8",
                            "Date Created": "12-16-2018 11:09:49",
                            "Upvotes": -1,
                            "Text": "Being good looking may mean you wouldn't need as much cosmetics to improve looks. If a woman isn't already decent looking without makeup, she can:\n\n- Get some nice makeup \n\nand will be easily much better looking. If she wasn't getting attention from the opposite sex before, she is now.\n\nOther things it tends to take, **for men**, if they aren't already good looking:\n\n- Do gym\n\n- Improve looks (haircut, acne, skin, etc.)\n\n- Improve social skills/personality\n\n- Become very rich\n\nUpon making these **changes for the long-term**, the guy is now also competing with similar other good looking guys.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ebw214i": [
                {
                    "Parent ID": "t1_ebu7idm",
                    "Comment ID": "ebw214i",
                    "Author": "Jenny_Roberts",
                    "Date Created": "12-15-2018 22:10:33",
                    "Upvotes": 31,
                    "Text": "I think beauty is a huge advantage, but I've personally found that there's a bigger difference in how people treat me depending on my mental state. \n\nCheery, friendly, helpful me? Is always popular and makes new friends. \n\nMoody, quiet, disinterested me is almost invisible...\n\nThe caveat is that guys were more into me when I was skinny, but I don't really blame them, because I was cuter, and physical attraction is nessecary in most romantic relationships. I also want to make girls have girl crushes on me 😎💋",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ebw39mv": [
                        {
                            "Parent ID": "t1_ebw214i",
                            "Comment ID": "ebw39mv",
                            "Author": "nodamncatnodamncradl",
                            "Date Created": "12-15-2018 22:31:07",
                            "Upvotes": 15,
                            "Text": "> Moody, quiet, disinterested\n\nI find I tend to get an ok reaction to being my dead-pan moody self HAHA\n\nTheres so many different versions of cute. Please don't conflate being physically attractive with being skinny... if you know what I mean. That will likely just hurt you.\n\nRomantic relationships are possible for anyone who wants them.\n\n\nIt's ok to have moods and to have times when you are quiet and not cheery/popular.\n\n",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebunuja": [
                [
                    {
                        "Parent ID": "t1_ebuazxe",
                        "Comment ID": "ebunuja",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:13:34",
                        "Upvotes": 42,
                        "Text": "It has it perks though. The people who still treated you the same throughout weight fluctuations are golden. (Same as in always were a dope friend) ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebups4y": [
                        {
                            "Parent ID": "t1_ebunuja",
                            "Comment ID": "ebups4y",
                            "Author": "cherrymama",
                            "Date Created": "12-15-2018 11:37:46",
                            "Upvotes": 24,
                            "Text": "I read this like 5 times as “dope fiend” and I’m like damn yeah I’m sure addicts would treat you the same way esp if you had something on you but that doesn’t seem like the point OP is making ? 😂 \n\n\n\nPs I’m an ex addict not trying to make anyone feel bad for using or anything ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebvzgo4": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebvzgo4",
                        "Author": "scrambledthoughts91",
                        "Date Created": "12-15-2018 21:28:56",
                        "Upvotes": 25,
                        "Text": "Hi, I currently live and work in India (I am Indian) but I have also worked in London and Dubai in the past 6 years and have similar experiences in all 3 countries. \n\nI work in a male dominated industry / financial sector (not my favourite job in the world but this is what I could get after my business degree) \n\nWhen I say \"don't have to lift a finger\" I don't mean I'm sitting on a throne like the queen of Sheba but what I meant is that when I'm around men or in public there are plenty of things that people offer to do to help , not just because I'm the fairer sex but because of how I look. \n\nThis isn't meant to be a brag because tbh I'm still stuck in the fat girl mindset and I get confused when people (especially men ) are too nice to me. It's an observation of what I have seen in my life. \n\nThis is also not to say that fat girls should be unhappy because even at my heaviest weight (220lbs) I had great friends, a boyfriend who adored me and a happy life. BUT after losing more than 100 lbs, everything just amplified 10 fold. \n\nI'm not saying that I love the attention but it is what it is. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0rp5": [
                        {
                            "Parent ID": "t1_ebvzgo4",
                            "Comment ID": "ebw0rp5",
                            "Author": "nodamncatnodamncradl",
                            "Date Created": "12-15-2018 21:49:30",
                            "Upvotes": 6,
                            "Text": "sorry answer only if you want to but, \nwhat specific nice things do people offer to help with in public or when you are \"around men\"? Do you feel like you can identify ways that this might be related to the  cultures  you listed or am I way off base\n\nWhat is \"being nice to you\" mean specifically, compared to how you remember being treated when you were 220?\n\nYour life sounds tremendously busy! You are a hiiiiiigh achiever and must have so much strength. I'm glad you feel like you've experienced a lot of happiness in your life.\n\nAny perspective about this is helping me understand something I don't feel like I have an awareness off\n\n",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw9kpt": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebw9kpt",
                        "Author": "bathroomhaunt",
                        "Date Created": "12-16-2018 00:30:53",
                        "Upvotes": 12,
                        "Text": "idk about treated like a queen necessarily but in the past few years ive gotten significantly more attractive and sometimes it does feel that way in comparison to me. when i was a chubby emo kid with blue hair ppl talked behind my back about how it was “nerdy” that i was a biology major. now that im a decently attractive blonde and about 50lbs lighter, when ppl talk about it im “smart” and “so determined”. dudes are A LOT nicer to me, and honestly girls want to be my friend way more often and go out of their way to do it. my classmates readily offer to help me with stuff, to study together, etc and that NEVER happened before. even my professors are nicer to me. people i went to high school with see my pics on instagram and suddenly now im worth talking to and they want to link up when im in my hometown. im sure to maintain all that i have to continue being a decently nice person lol, and i cant get away with just not doing anything bc who can but at least when it comes to this kinda stuff it definitely feels like i dont have to lift a finger anymore",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebx0x12": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebx0x12",
                        "Author": "BeginningBarnacle",
                        "Date Created": "12-16-2018 10:46:37",
                        "Upvotes": 11,
                        "Text": "Upvoting on reddit is a show of interest or support, not a ‘hey, that’s exactly me!’ \n\n(Although there are probably many pretty people here without a doubt)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvobul": [
                [
                    {
                        "Parent ID": "t1_ebvchoo",
                        "Comment ID": "ebvobul",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 18:47:14",
                        "Upvotes": 12,
                        "Text": "I don't think your comment is really downvote-worthy at all!\n\nIt's an opinion about the post and it doesn't contain anything egregiously insulting IMO\n\n I just find your opinion a tad confusing. \n\n\n\nWhat is part of the incel mindset ?\n\nWhat does \"they know they won't have to settle\" mean? (especialy the settle part, but I actually just don't understand this part at all... like what evidence about a group of people definied what \"settling\" is and then didn't do it. Is this idea based in sociology, anthropology, psychology, philosophy, or what?\n\nI DO TOTALLY agree that attractive* people in many cultures (thought cultures/world cultures/historical cultures) are treated better and have privilege. Like I said... I can see where you are getting at. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0h9f": [
                        {
                            "Parent ID": "t1_ebvobul",
                            "Comment ID": "ebw0h9f",
                            "Author": "Grellous8",
                            "Date Created": "12-15-2018 21:44:52",
                            "Upvotes": 1,
                            "Text": "> What is part of the incel mindset ?\n> \n> What does \"they know they won't have to settle\" mean?\n\nI meant settle for a less attractive partner. The incel part pertains to the idea that if one is an incel, unlike more attractive people, one would be more likely to settle for a less attractive partner (yes, I am aware that physical attraction doesn't/shouldn't make the entire relationship, but it does enhance *certain* aspects of the relationship, so understand that \"settle\" is just used for lack of a better word). I'm also willing to bet that most incels wouldn't mind being treated \"like a ~~queen~~ king\" even if \"(they) know that they love (them) only for how great (they) look so the connection might fizzle out.\" The point being that if/when girls lose weight, they can get more attention, but for guys it tends to take more than just weight loss to become more attractive to/get attention from the opposite sex.",
                            "Edited?": "12-15-2018 21:54:35",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebx0xti": [
                [
                    {
                        "Parent ID": "t1_ebvp7qj",
                        "Comment ID": "ebx0xti",
                        "Author": "LittleBookOfSorrows",
                        "Date Created": "12-16-2018 10:46:55",
                        "Upvotes": 2,
                        "Text": ">Wow what an awful way of thinking, having to put another girl down to comfort yourself.\n\nPreferable to starving yourself and getting into an ED mess to comfort yourself though.  That's a less healthy way to cope.  ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eburgg6": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "eburgg6",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:56:31",
                        "Upvotes": 10,
                        "Text": "Gurllllllllllllll😤😂🤔",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxw1q3": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "ebxw1q3",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 16:56:20",
                        "Upvotes": 5,
                        "Text": "Lol as an addict trying to stay sober I did the same thing too 😅",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxwerh": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebxwerh",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 17:01:22",
                        "Upvotes": 10,
                        "Text": "Eh women need to do more than lose weight to get a man’s attention. It’s similar to what a guy needs to do. So yeah a girl can look good and put an makeup, but they still need to do upkeep on their bodies (most people don’t find skinny fat attractive), work on their teeth, quality of their skin, their personalities, work on their hair, and work on their social skills. This is all a given for women and most know that they can’t just be skinny to get men to like them. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebw3r44": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebw3r44",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:39:15",
                        "Upvotes": 3,
                        "Text": "I guess your perspective about what is possible in romantic relationships is different than mine, and I'm just having trouble hearing how you are explaining this.\n\nI think that women spend the most money on cosmetics and things like plastic surgeries... I'm not familiar with the statistics but I don't agree with you last sentence at all... it sounds like weird logic and I don't know what you mean when you say \"other things it tends to take.\"\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebx145p": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx145p",
                            "Author": "BeginningBarnacle",
                            "Date Created": "12-16-2018 10:49:27",
                            "Upvotes": 5,
                            "Text": "An interesting observation however, is that sure, this behaviour is seen in attractive women and attractive men, but where are the ‘incel’ women?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebx2jd8": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx2jd8",
                            "Author": "Grellous8",
                            "Date Created": "12-16-2018 11:09:49",
                            "Upvotes": -1,
                            "Text": "Being good looking may mean you wouldn't need as much cosmetics to improve looks. If a woman isn't already decent looking without makeup, she can:\n\n- Get some nice makeup \n\nand will be easily much better looking. If she wasn't getting attention from the opposite sex before, she is now.\n\nOther things it tends to take, **for men**, if they aren't already good looking:\n\n- Do gym\n\n- Improve looks (haircut, acne, skin, etc.)\n\n- Improve social skills/personality\n\n- Become very rich\n\nUpon making these **changes for the long-term**, the guy is now also competing with similar other good looking guys.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ebvgyet": [
                {
                    "Parent ID": "t1_ebu7idm",
                    "Comment ID": "ebvgyet",
                    "Author": "nodamncatnodamncradl",
                    "Date Created": "12-15-2018 17:16:11",
                    "Upvotes": 23,
                    "Text": "I'm really weirded out that 90 ppl upvoted this... I guess it was based on the sentence \"people are attracted to beauty\"? which i agree with... \n\nbut do 90 people/you really feel like you never have to lift a finger and are always special/treated like a queen????????????\n\nwhere do you all live???? what do you all do????",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ebvzgo4": [
                        {
                            "Parent ID": "t1_ebvgyet",
                            "Comment ID": "ebvzgo4",
                            "Author": "scrambledthoughts91",
                            "Date Created": "12-15-2018 21:28:56",
                            "Upvotes": 25,
                            "Text": "Hi, I currently live and work in India (I am Indian) but I have also worked in London and Dubai in the past 6 years and have similar experiences in all 3 countries. \n\nI work in a male dominated industry / financial sector (not my favourite job in the world but this is what I could get after my business degree) \n\nWhen I say \"don't have to lift a finger\" I don't mean I'm sitting on a throne like the queen of Sheba but what I meant is that when I'm around men or in public there are plenty of things that people offer to do to help , not just because I'm the fairer sex but because of how I look. \n\nThis isn't meant to be a brag because tbh I'm still stuck in the fat girl mindset and I get confused when people (especially men ) are too nice to me. It's an observation of what I have seen in my life. \n\nThis is also not to say that fat girls should be unhappy because even at my heaviest weight (220lbs) I had great friends, a boyfriend who adored me and a happy life. BUT after losing more than 100 lbs, everything just amplified 10 fold. \n\nI'm not saying that I love the attention but it is what it is. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebw9kpt": [
                        {
                            "Parent ID": "t1_ebvgyet",
                            "Comment ID": "ebw9kpt",
                            "Author": "bathroomhaunt",
                            "Date Created": "12-16-2018 00:30:53",
                            "Upvotes": 12,
                            "Text": "idk about treated like a queen necessarily but in the past few years ive gotten significantly more attractive and sometimes it does feel that way in comparison to me. when i was a chubby emo kid with blue hair ppl talked behind my back about how it was “nerdy” that i was a biology major. now that im a decently attractive blonde and about 50lbs lighter, when ppl talk about it im “smart” and “so determined”. dudes are A LOT nicer to me, and honestly girls want to be my friend way more often and go out of their way to do it. my classmates readily offer to help me with stuff, to study together, etc and that NEVER happened before. even my professors are nicer to me. people i went to high school with see my pics on instagram and suddenly now im worth talking to and they want to link up when im in my hometown. im sure to maintain all that i have to continue being a decently nice person lol, and i cant get away with just not doing anything bc who can but at least when it comes to this kinda stuff it definitely feels like i dont have to lift a finger anymore",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebx0x12": [
                        {
                            "Parent ID": "t1_ebvgyet",
                            "Comment ID": "ebx0x12",
                            "Author": "BeginningBarnacle",
                            "Date Created": "12-16-2018 10:46:37",
                            "Upvotes": 11,
                            "Text": "Upvoting on reddit is a show of interest or support, not a ‘hey, that’s exactly me!’ \n\n(Although there are probably many pretty people here without a doubt)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebunuja": [
                [
                    {
                        "Parent ID": "t1_ebuazxe",
                        "Comment ID": "ebunuja",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:13:34",
                        "Upvotes": 42,
                        "Text": "It has it perks though. The people who still treated you the same throughout weight fluctuations are golden. (Same as in always were a dope friend) ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebups4y": [
                        {
                            "Parent ID": "t1_ebunuja",
                            "Comment ID": "ebups4y",
                            "Author": "cherrymama",
                            "Date Created": "12-15-2018 11:37:46",
                            "Upvotes": 24,
                            "Text": "I read this like 5 times as “dope fiend” and I’m like damn yeah I’m sure addicts would treat you the same way esp if you had something on you but that doesn’t seem like the point OP is making ? 😂 \n\n\n\nPs I’m an ex addict not trying to make anyone feel bad for using or anything ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw39mv": [
                [
                    {
                        "Parent ID": "t1_ebw214i",
                        "Comment ID": "ebw39mv",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:31:07",
                        "Upvotes": 15,
                        "Text": "> Moody, quiet, disinterested\n\nI find I tend to get an ok reaction to being my dead-pan moody self HAHA\n\nTheres so many different versions of cute. Please don't conflate being physically attractive with being skinny... if you know what I mean. That will likely just hurt you.\n\nRomantic relationships are possible for anyone who wants them.\n\n\nIt's ok to have moods and to have times when you are quiet and not cheery/popular.\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvobul": [
                [
                    {
                        "Parent ID": "t1_ebvchoo",
                        "Comment ID": "ebvobul",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 18:47:14",
                        "Upvotes": 12,
                        "Text": "I don't think your comment is really downvote-worthy at all!\n\nIt's an opinion about the post and it doesn't contain anything egregiously insulting IMO\n\n I just find your opinion a tad confusing. \n\n\n\nWhat is part of the incel mindset ?\n\nWhat does \"they know they won't have to settle\" mean? (especialy the settle part, but I actually just don't understand this part at all... like what evidence about a group of people definied what \"settling\" is and then didn't do it. Is this idea based in sociology, anthropology, psychology, philosophy, or what?\n\nI DO TOTALLY agree that attractive* people in many cultures (thought cultures/world cultures/historical cultures) are treated better and have privilege. Like I said... I can see where you are getting at. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0h9f": [
                        {
                            "Parent ID": "t1_ebvobul",
                            "Comment ID": "ebw0h9f",
                            "Author": "Grellous8",
                            "Date Created": "12-15-2018 21:44:52",
                            "Upvotes": 1,
                            "Text": "> What is part of the incel mindset ?\n> \n> What does \"they know they won't have to settle\" mean?\n\nI meant settle for a less attractive partner. The incel part pertains to the idea that if one is an incel, unlike more attractive people, one would be more likely to settle for a less attractive partner (yes, I am aware that physical attraction doesn't/shouldn't make the entire relationship, but it does enhance *certain* aspects of the relationship, so understand that \"settle\" is just used for lack of a better word). I'm also willing to bet that most incels wouldn't mind being treated \"like a ~~queen~~ king\" even if \"(they) know that they love (them) only for how great (they) look so the connection might fizzle out.\" The point being that if/when girls lose weight, they can get more attention, but for guys it tends to take more than just weight loss to become more attractive to/get attention from the opposite sex.",
                            "Edited?": "12-15-2018 21:54:35",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebx0xti": [
                [
                    {
                        "Parent ID": "t1_ebvp7qj",
                        "Comment ID": "ebx0xti",
                        "Author": "LittleBookOfSorrows",
                        "Date Created": "12-16-2018 10:46:55",
                        "Upvotes": 2,
                        "Text": ">Wow what an awful way of thinking, having to put another girl down to comfort yourself.\n\nPreferable to starving yourself and getting into an ED mess to comfort yourself though.  That's a less healthy way to cope.  ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebw0rp5": [
                [
                    {
                        "Parent ID": "t1_ebvzgo4",
                        "Comment ID": "ebw0rp5",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 21:49:30",
                        "Upvotes": 6,
                        "Text": "sorry answer only if you want to but, \nwhat specific nice things do people offer to help with in public or when you are \"around men\"? Do you feel like you can identify ways that this might be related to the  cultures  you listed or am I way off base\n\nWhat is \"being nice to you\" mean specifically, compared to how you remember being treated when you were 220?\n\nYour life sounds tremendously busy! You are a hiiiiiigh achiever and must have so much strength. I'm glad you feel like you've experienced a lot of happiness in your life.\n\nAny perspective about this is helping me understand something I don't feel like I have an awareness off\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eburgg6": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "eburgg6",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:56:31",
                        "Upvotes": 10,
                        "Text": "Gurllllllllllllll😤😂🤔",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxw1q3": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "ebxw1q3",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 16:56:20",
                        "Upvotes": 5,
                        "Text": "Lol as an addict trying to stay sober I did the same thing too 😅",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxwerh": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebxwerh",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 17:01:22",
                        "Upvotes": 10,
                        "Text": "Eh women need to do more than lose weight to get a man’s attention. It’s similar to what a guy needs to do. So yeah a girl can look good and put an makeup, but they still need to do upkeep on their bodies (most people don’t find skinny fat attractive), work on their teeth, quality of their skin, their personalities, work on their hair, and work on their social skills. This is all a given for women and most know that they can’t just be skinny to get men to like them. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebw3r44": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebw3r44",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:39:15",
                        "Upvotes": 3,
                        "Text": "I guess your perspective about what is possible in romantic relationships is different than mine, and I'm just having trouble hearing how you are explaining this.\n\nI think that women spend the most money on cosmetics and things like plastic surgeries... I'm not familiar with the statistics but I don't agree with you last sentence at all... it sounds like weird logic and I don't know what you mean when you say \"other things it tends to take.\"\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebx145p": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx145p",
                            "Author": "BeginningBarnacle",
                            "Date Created": "12-16-2018 10:49:27",
                            "Upvotes": 5,
                            "Text": "An interesting observation however, is that sure, this behaviour is seen in attractive women and attractive men, but where are the ‘incel’ women?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebx2jd8": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx2jd8",
                            "Author": "Grellous8",
                            "Date Created": "12-16-2018 11:09:49",
                            "Upvotes": -1,
                            "Text": "Being good looking may mean you wouldn't need as much cosmetics to improve looks. If a woman isn't already decent looking without makeup, she can:\n\n- Get some nice makeup \n\nand will be easily much better looking. If she wasn't getting attention from the opposite sex before, she is now.\n\nOther things it tends to take, **for men**, if they aren't already good looking:\n\n- Do gym\n\n- Improve looks (haircut, acne, skin, etc.)\n\n- Improve social skills/personality\n\n- Become very rich\n\nUpon making these **changes for the long-term**, the guy is now also competing with similar other good looking guys.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ebvchoo": [
                {
                    "Parent ID": "t1_ebu7idm",
                    "Comment ID": "ebvchoo",
                    "Author": "Grellous8",
                    "Date Created": "12-15-2018 16:22:29",
                    "Upvotes": 10,
                    "Text": "> That's the sad truth. People are attracted to beauty like moths to a flame. You don't even have to lift a finger. You're always special. The change in people's behaviour after you lose weight/get hot is unbelievable.\n\nAt the risk of garnering a metric fuckton of downvotes, I'm gonna be honest with you and say this is a big part of the incel mindset; it works both ways. And to a large degree, it's true. A lot of attractive guys will only go for comparably attractive women because they know they won't have to settle. On the other hand, a lot of attractive women will only go for attractive guys because they know they won't have to settle. Obviously, this realization hurts, and it impacts everyone (not just men or just women). Again, I wasn't trying to be an ass/neckbeard, but just my thoughts...",
                    "Edited?": "12-15-2018 16:27:41",
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ebvobul": [
                        {
                            "Parent ID": "t1_ebvchoo",
                            "Comment ID": "ebvobul",
                            "Author": "nodamncatnodamncradl",
                            "Date Created": "12-15-2018 18:47:14",
                            "Upvotes": 12,
                            "Text": "I don't think your comment is really downvote-worthy at all!\n\nIt's an opinion about the post and it doesn't contain anything egregiously insulting IMO\n\n I just find your opinion a tad confusing. \n\n\n\nWhat is part of the incel mindset ?\n\nWhat does \"they know they won't have to settle\" mean? (especialy the settle part, but I actually just don't understand this part at all... like what evidence about a group of people definied what \"settling\" is and then didn't do it. Is this idea based in sociology, anthropology, psychology, philosophy, or what?\n\nI DO TOTALLY agree that attractive* people in many cultures (thought cultures/world cultures/historical cultures) are treated better and have privilege. Like I said... I can see where you are getting at. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebunuja": [
                [
                    {
                        "Parent ID": "t1_ebuazxe",
                        "Comment ID": "ebunuja",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:13:34",
                        "Upvotes": 42,
                        "Text": "It has it perks though. The people who still treated you the same throughout weight fluctuations are golden. (Same as in always were a dope friend) ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebups4y": [
                        {
                            "Parent ID": "t1_ebunuja",
                            "Comment ID": "ebups4y",
                            "Author": "cherrymama",
                            "Date Created": "12-15-2018 11:37:46",
                            "Upvotes": 24,
                            "Text": "I read this like 5 times as “dope fiend” and I’m like damn yeah I’m sure addicts would treat you the same way esp if you had something on you but that doesn’t seem like the point OP is making ? 😂 \n\n\n\nPs I’m an ex addict not trying to make anyone feel bad for using or anything ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw39mv": [
                [
                    {
                        "Parent ID": "t1_ebw214i",
                        "Comment ID": "ebw39mv",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:31:07",
                        "Upvotes": 15,
                        "Text": "> Moody, quiet, disinterested\n\nI find I tend to get an ok reaction to being my dead-pan moody self HAHA\n\nTheres so many different versions of cute. Please don't conflate being physically attractive with being skinny... if you know what I mean. That will likely just hurt you.\n\nRomantic relationships are possible for anyone who wants them.\n\n\nIt's ok to have moods and to have times when you are quiet and not cheery/popular.\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvzgo4": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebvzgo4",
                        "Author": "scrambledthoughts91",
                        "Date Created": "12-15-2018 21:28:56",
                        "Upvotes": 25,
                        "Text": "Hi, I currently live and work in India (I am Indian) but I have also worked in London and Dubai in the past 6 years and have similar experiences in all 3 countries. \n\nI work in a male dominated industry / financial sector (not my favourite job in the world but this is what I could get after my business degree) \n\nWhen I say \"don't have to lift a finger\" I don't mean I'm sitting on a throne like the queen of Sheba but what I meant is that when I'm around men or in public there are plenty of things that people offer to do to help , not just because I'm the fairer sex but because of how I look. \n\nThis isn't meant to be a brag because tbh I'm still stuck in the fat girl mindset and I get confused when people (especially men ) are too nice to me. It's an observation of what I have seen in my life. \n\nThis is also not to say that fat girls should be unhappy because even at my heaviest weight (220lbs) I had great friends, a boyfriend who adored me and a happy life. BUT after losing more than 100 lbs, everything just amplified 10 fold. \n\nI'm not saying that I love the attention but it is what it is. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0rp5": [
                        {
                            "Parent ID": "t1_ebvzgo4",
                            "Comment ID": "ebw0rp5",
                            "Author": "nodamncatnodamncradl",
                            "Date Created": "12-15-2018 21:49:30",
                            "Upvotes": 6,
                            "Text": "sorry answer only if you want to but, \nwhat specific nice things do people offer to help with in public or when you are \"around men\"? Do you feel like you can identify ways that this might be related to the  cultures  you listed or am I way off base\n\nWhat is \"being nice to you\" mean specifically, compared to how you remember being treated when you were 220?\n\nYour life sounds tremendously busy! You are a hiiiiiigh achiever and must have so much strength. I'm glad you feel like you've experienced a lot of happiness in your life.\n\nAny perspective about this is helping me understand something I don't feel like I have an awareness off\n\n",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw9kpt": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebw9kpt",
                        "Author": "bathroomhaunt",
                        "Date Created": "12-16-2018 00:30:53",
                        "Upvotes": 12,
                        "Text": "idk about treated like a queen necessarily but in the past few years ive gotten significantly more attractive and sometimes it does feel that way in comparison to me. when i was a chubby emo kid with blue hair ppl talked behind my back about how it was “nerdy” that i was a biology major. now that im a decently attractive blonde and about 50lbs lighter, when ppl talk about it im “smart” and “so determined”. dudes are A LOT nicer to me, and honestly girls want to be my friend way more often and go out of their way to do it. my classmates readily offer to help me with stuff, to study together, etc and that NEVER happened before. even my professors are nicer to me. people i went to high school with see my pics on instagram and suddenly now im worth talking to and they want to link up when im in my hometown. im sure to maintain all that i have to continue being a decently nice person lol, and i cant get away with just not doing anything bc who can but at least when it comes to this kinda stuff it definitely feels like i dont have to lift a finger anymore",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebx0x12": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebx0x12",
                        "Author": "BeginningBarnacle",
                        "Date Created": "12-16-2018 10:46:37",
                        "Upvotes": 11,
                        "Text": "Upvoting on reddit is a show of interest or support, not a ‘hey, that’s exactly me!’ \n\n(Although there are probably many pretty people here without a doubt)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebx0xti": [
                [
                    {
                        "Parent ID": "t1_ebvp7qj",
                        "Comment ID": "ebx0xti",
                        "Author": "LittleBookOfSorrows",
                        "Date Created": "12-16-2018 10:46:55",
                        "Upvotes": 2,
                        "Text": ">Wow what an awful way of thinking, having to put another girl down to comfort yourself.\n\nPreferable to starving yourself and getting into an ED mess to comfort yourself though.  That's a less healthy way to cope.  ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebw0h9f": [
                [
                    {
                        "Parent ID": "t1_ebvobul",
                        "Comment ID": "ebw0h9f",
                        "Author": "Grellous8",
                        "Date Created": "12-15-2018 21:44:52",
                        "Upvotes": 1,
                        "Text": "> What is part of the incel mindset ?\n> \n> What does \"they know they won't have to settle\" mean?\n\nI meant settle for a less attractive partner. The incel part pertains to the idea that if one is an incel, unlike more attractive people, one would be more likely to settle for a less attractive partner (yes, I am aware that physical attraction doesn't/shouldn't make the entire relationship, but it does enhance *certain* aspects of the relationship, so understand that \"settle\" is just used for lack of a better word). I'm also willing to bet that most incels wouldn't mind being treated \"like a ~~queen~~ king\" even if \"(they) know that they love (them) only for how great (they) look so the connection might fizzle out.\" The point being that if/when girls lose weight, they can get more attention, but for guys it tends to take more than just weight loss to become more attractive to/get attention from the opposite sex.",
                        "Edited?": "12-15-2018 21:54:35",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebxwerh": [
                        {
                            "Parent ID": "t1_ebw0h9f",
                            "Comment ID": "ebxwerh",
                            "Author": "Someone_Who_Isnt_You",
                            "Date Created": "12-16-2018 17:01:22",
                            "Upvotes": 10,
                            "Text": "Eh women need to do more than lose weight to get a man’s attention. It’s similar to what a guy needs to do. So yeah a girl can look good and put an makeup, but they still need to do upkeep on their bodies (most people don’t find skinny fat attractive), work on their teeth, quality of their skin, their personalities, work on their hair, and work on their social skills. This is all a given for women and most know that they can’t just be skinny to get men to like them. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebw3r44": [
                        {
                            "Parent ID": "t1_ebw0h9f",
                            "Comment ID": "ebw3r44",
                            "Author": "nodamncatnodamncradl",
                            "Date Created": "12-15-2018 22:39:15",
                            "Upvotes": 3,
                            "Text": "I guess your perspective about what is possible in romantic relationships is different than mine, and I'm just having trouble hearing how you are explaining this.\n\nI think that women spend the most money on cosmetics and things like plastic surgeries... I'm not familiar with the statistics but I don't agree with you last sentence at all... it sounds like weird logic and I don't know what you mean when you say \"other things it tends to take.\"\n\n",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eburgg6": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "eburgg6",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:56:31",
                        "Upvotes": 10,
                        "Text": "Gurllllllllllllll😤😂🤔",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxw1q3": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "ebxw1q3",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 16:56:20",
                        "Upvotes": 5,
                        "Text": "Lol as an addict trying to stay sober I did the same thing too 😅",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebx145p": [
                [
                    {
                        "Parent ID": "t1_ebw3r44",
                        "Comment ID": "ebx145p",
                        "Author": "BeginningBarnacle",
                        "Date Created": "12-16-2018 10:49:27",
                        "Upvotes": 5,
                        "Text": "An interesting observation however, is that sure, this behaviour is seen in attractive women and attractive men, but where are the ‘incel’ women?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebx2jd8": [
                [
                    {
                        "Parent ID": "t1_ebw3r44",
                        "Comment ID": "ebx2jd8",
                        "Author": "Grellous8",
                        "Date Created": "12-16-2018 11:09:49",
                        "Upvotes": -1,
                        "Text": "Being good looking may mean you wouldn't need as much cosmetics to improve looks. If a woman isn't already decent looking without makeup, she can:\n\n- Get some nice makeup \n\nand will be easily much better looking. If she wasn't getting attention from the opposite sex before, she is now.\n\nOther things it tends to take, **for men**, if they aren't already good looking:\n\n- Do gym\n\n- Improve looks (haircut, acne, skin, etc.)\n\n- Improve social skills/personality\n\n- Become very rich\n\nUpon making these **changes for the long-term**, the guy is now also competing with similar other good looking guys.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "eqype2k": [
                {
                    "Parent ID": "t1_ebu7idm",
                    "Comment ID": "eqype2k",
                    "Author": "ks788",
                    "Date Created": "06-12-2019 19:53:22",
                    "Upvotes": 1,
                    "Text": "How did you “get hot” other than weight loss?",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ebunuja": [
                [
                    {
                        "Parent ID": "t1_ebuazxe",
                        "Comment ID": "ebunuja",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:13:34",
                        "Upvotes": 42,
                        "Text": "It has it perks though. The people who still treated you the same throughout weight fluctuations are golden. (Same as in always were a dope friend) ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebups4y": [
                        {
                            "Parent ID": "t1_ebunuja",
                            "Comment ID": "ebups4y",
                            "Author": "cherrymama",
                            "Date Created": "12-15-2018 11:37:46",
                            "Upvotes": 24,
                            "Text": "I read this like 5 times as “dope fiend” and I’m like damn yeah I’m sure addicts would treat you the same way esp if you had something on you but that doesn’t seem like the point OP is making ? 😂 \n\n\n\nPs I’m an ex addict not trying to make anyone feel bad for using or anything ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw39mv": [
                [
                    {
                        "Parent ID": "t1_ebw214i",
                        "Comment ID": "ebw39mv",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:31:07",
                        "Upvotes": 15,
                        "Text": "> Moody, quiet, disinterested\n\nI find I tend to get an ok reaction to being my dead-pan moody self HAHA\n\nTheres so many different versions of cute. Please don't conflate being physically attractive with being skinny... if you know what I mean. That will likely just hurt you.\n\nRomantic relationships are possible for anyone who wants them.\n\n\nIt's ok to have moods and to have times when you are quiet and not cheery/popular.\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvzgo4": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebvzgo4",
                        "Author": "scrambledthoughts91",
                        "Date Created": "12-15-2018 21:28:56",
                        "Upvotes": 25,
                        "Text": "Hi, I currently live and work in India (I am Indian) but I have also worked in London and Dubai in the past 6 years and have similar experiences in all 3 countries. \n\nI work in a male dominated industry / financial sector (not my favourite job in the world but this is what I could get after my business degree) \n\nWhen I say \"don't have to lift a finger\" I don't mean I'm sitting on a throne like the queen of Sheba but what I meant is that when I'm around men or in public there are plenty of things that people offer to do to help , not just because I'm the fairer sex but because of how I look. \n\nThis isn't meant to be a brag because tbh I'm still stuck in the fat girl mindset and I get confused when people (especially men ) are too nice to me. It's an observation of what I have seen in my life. \n\nThis is also not to say that fat girls should be unhappy because even at my heaviest weight (220lbs) I had great friends, a boyfriend who adored me and a happy life. BUT after losing more than 100 lbs, everything just amplified 10 fold. \n\nI'm not saying that I love the attention but it is what it is. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0rp5": [
                        {
                            "Parent ID": "t1_ebvzgo4",
                            "Comment ID": "ebw0rp5",
                            "Author": "nodamncatnodamncradl",
                            "Date Created": "12-15-2018 21:49:30",
                            "Upvotes": 6,
                            "Text": "sorry answer only if you want to but, \nwhat specific nice things do people offer to help with in public or when you are \"around men\"? Do you feel like you can identify ways that this might be related to the  cultures  you listed or am I way off base\n\nWhat is \"being nice to you\" mean specifically, compared to how you remember being treated when you were 220?\n\nYour life sounds tremendously busy! You are a hiiiiiigh achiever and must have so much strength. I'm glad you feel like you've experienced a lot of happiness in your life.\n\nAny perspective about this is helping me understand something I don't feel like I have an awareness off\n\n",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw9kpt": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebw9kpt",
                        "Author": "bathroomhaunt",
                        "Date Created": "12-16-2018 00:30:53",
                        "Upvotes": 12,
                        "Text": "idk about treated like a queen necessarily but in the past few years ive gotten significantly more attractive and sometimes it does feel that way in comparison to me. when i was a chubby emo kid with blue hair ppl talked behind my back about how it was “nerdy” that i was a biology major. now that im a decently attractive blonde and about 50lbs lighter, when ppl talk about it im “smart” and “so determined”. dudes are A LOT nicer to me, and honestly girls want to be my friend way more often and go out of their way to do it. my classmates readily offer to help me with stuff, to study together, etc and that NEVER happened before. even my professors are nicer to me. people i went to high school with see my pics on instagram and suddenly now im worth talking to and they want to link up when im in my hometown. im sure to maintain all that i have to continue being a decently nice person lol, and i cant get away with just not doing anything bc who can but at least when it comes to this kinda stuff it definitely feels like i dont have to lift a finger anymore",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebx0x12": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebx0x12",
                        "Author": "BeginningBarnacle",
                        "Date Created": "12-16-2018 10:46:37",
                        "Upvotes": 11,
                        "Text": "Upvoting on reddit is a show of interest or support, not a ‘hey, that’s exactly me!’ \n\n(Although there are probably many pretty people here without a doubt)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvobul": [
                [
                    {
                        "Parent ID": "t1_ebvchoo",
                        "Comment ID": "ebvobul",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 18:47:14",
                        "Upvotes": 12,
                        "Text": "I don't think your comment is really downvote-worthy at all!\n\nIt's an opinion about the post and it doesn't contain anything egregiously insulting IMO\n\n I just find your opinion a tad confusing. \n\n\n\nWhat is part of the incel mindset ?\n\nWhat does \"they know they won't have to settle\" mean? (especialy the settle part, but I actually just don't understand this part at all... like what evidence about a group of people definied what \"settling\" is and then didn't do it. Is this idea based in sociology, anthropology, psychology, philosophy, or what?\n\nI DO TOTALLY agree that attractive* people in many cultures (thought cultures/world cultures/historical cultures) are treated better and have privilege. Like I said... I can see where you are getting at. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0h9f": [
                        {
                            "Parent ID": "t1_ebvobul",
                            "Comment ID": "ebw0h9f",
                            "Author": "Grellous8",
                            "Date Created": "12-15-2018 21:44:52",
                            "Upvotes": 1,
                            "Text": "> What is part of the incel mindset ?\n> \n> What does \"they know they won't have to settle\" mean?\n\nI meant settle for a less attractive partner. The incel part pertains to the idea that if one is an incel, unlike more attractive people, one would be more likely to settle for a less attractive partner (yes, I am aware that physical attraction doesn't/shouldn't make the entire relationship, but it does enhance *certain* aspects of the relationship, so understand that \"settle\" is just used for lack of a better word). I'm also willing to bet that most incels wouldn't mind being treated \"like a ~~queen~~ king\" even if \"(they) know that they love (them) only for how great (they) look so the connection might fizzle out.\" The point being that if/when girls lose weight, they can get more attention, but for guys it tends to take more than just weight loss to become more attractive to/get attention from the opposite sex.",
                            "Edited?": "12-15-2018 21:54:35",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebx0xti": [
                [
                    {
                        "Parent ID": "t1_ebvp7qj",
                        "Comment ID": "ebx0xti",
                        "Author": "LittleBookOfSorrows",
                        "Date Created": "12-16-2018 10:46:55",
                        "Upvotes": 2,
                        "Text": ">Wow what an awful way of thinking, having to put another girl down to comfort yourself.\n\nPreferable to starving yourself and getting into an ED mess to comfort yourself though.  That's a less healthy way to cope.  ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "eburgg6": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "eburgg6",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:56:31",
                        "Upvotes": 10,
                        "Text": "Gurllllllllllllll😤😂🤔",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxw1q3": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "ebxw1q3",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 16:56:20",
                        "Upvotes": 5,
                        "Text": "Lol as an addict trying to stay sober I did the same thing too 😅",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxwerh": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebxwerh",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 17:01:22",
                        "Upvotes": 10,
                        "Text": "Eh women need to do more than lose weight to get a man’s attention. It’s similar to what a guy needs to do. So yeah a girl can look good and put an makeup, but they still need to do upkeep on their bodies (most people don’t find skinny fat attractive), work on their teeth, quality of their skin, their personalities, work on their hair, and work on their social skills. This is all a given for women and most know that they can’t just be skinny to get men to like them. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebw3r44": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebw3r44",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:39:15",
                        "Upvotes": 3,
                        "Text": "I guess your perspective about what is possible in romantic relationships is different than mine, and I'm just having trouble hearing how you are explaining this.\n\nI think that women spend the most money on cosmetics and things like plastic surgeries... I'm not familiar with the statistics but I don't agree with you last sentence at all... it sounds like weird logic and I don't know what you mean when you say \"other things it tends to take.\"\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebx145p": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx145p",
                            "Author": "BeginningBarnacle",
                            "Date Created": "12-16-2018 10:49:27",
                            "Upvotes": 5,
                            "Text": "An interesting observation however, is that sure, this behaviour is seen in attractive women and attractive men, but where are the ‘incel’ women?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebx2jd8": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx2jd8",
                            "Author": "Grellous8",
                            "Date Created": "12-16-2018 11:09:49",
                            "Upvotes": -1,
                            "Text": "Being good looking may mean you wouldn't need as much cosmetics to improve looks. If a woman isn't already decent looking without makeup, she can:\n\n- Get some nice makeup \n\nand will be easily much better looking. If she wasn't getting attention from the opposite sex before, she is now.\n\nOther things it tends to take, **for men**, if they aren't already good looking:\n\n- Do gym\n\n- Improve looks (haircut, acne, skin, etc.)\n\n- Improve social skills/personality\n\n- Become very rich\n\nUpon making these **changes for the long-term**, the guy is now also competing with similar other good looking guys.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ebtyty1": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebtyty1",
                "Author": "socioanxiety",
                "Date Created": "12-15-2018 02:44:43",
                "Upvotes": 123,
                "Text": "I feel this in my soul",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebu4n5q": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebu4n5q",
                "Author": "[deleted]",
                "Date Created": "12-15-2018 05:34:55",
                "Upvotes": 54,
                "Text": "this is so sad because of how relatable this is.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebu94ly": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebu94ly",
                "Author": "harambelol",
                "Date Created": "12-15-2018 07:37:38",
                "Upvotes": 52,
                "Text": "Same but I didn't win the genetic lottery so I'll be the ugly one at any size",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebtzsjb": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebtzsjb",
                "Author": "smittenkitt3n",
                "Date Created": "12-15-2018 03:10:11",
                "Upvotes": 100,
                "Text": "omfg idek this girl or what she looks like but i’m jealous hahahha\n\nidk how to make myself prettier besides losing weight. i cant really do much in terms w makeup & clothes cuz i’ve exhausted all possibilities so i know what i look decent in, so i guess the only thing left for me to do is starve until i’m skinny 😭😭😭\n\nhope you had fun at the social, OP! ❤️ i haven’t hung out w anyone in like a month so i feel ya",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebupg7q": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebupg7q",
                "Author": "[deleted]",
                "Date Created": "12-15-2018 11:33:58",
                "Upvotes": 24,
                "Text": "I would give anything for a life like those girls. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebu78qp": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebu78qp",
                "Author": "crystaldeluge",
                "Date Created": "12-15-2018 06:55:06",
                "Upvotes": 23,
                "Text": "This is so relatable it hurts",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebug1ld": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebug1ld",
                "Author": "deepdiccpizza",
                "Date Created": "12-15-2018 09:29:04",
                "Upvotes": 20,
                "Text": "Damn this is the motivation I needed to workout 😭 thank you lol\nBut seriously, I feel this so much, pretty girls and their impact on others is such a fascinating thing to see, as creepy as that sounds.. 💀",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebuxgpl": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebuxgpl",
                "Author": "cdg2m4nrsvp",
                "Date Created": "12-15-2018 13:07:17",
                "Upvotes": 19,
                "Text": "I was about to go eat lunch but this inspired me. I will be a Pretty Girl™️",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebvbzim": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebvbzim",
                "Author": "nodamncatnodamncradl",
                "Date Created": "12-15-2018 16:16:16",
                "Upvotes": 17,
                "Text": "EDIT: Sorry as usual my huge reply is really only tangentially related to your post oops. Anyway I appreciated the way you phrased things in your post OP. \n\nWell described! when I notice ppl/interations like this I usually am simultaneously crushing on/attracted to/ am objectifying... the joys of my closeted sexuality BAHAH. anyway now I have the hots for the girl you described XD\n\n-------\n\nI'm a pretty thin tall and \"fashionable\". I do feel people looking at me and enjoying looking at me and talking to me... especially when I am wearing revealing clothes and/or heavy makeup.  I do feel like I get attention and privilege because of it, however I don't really get a lot of \"extra's\"... in general most people avoid approaching me (intimidated/not into my personality? I'm not sure)... I don't usually have anyone (except people I am on dates with) buy me drinks or approach me randomly (a pick-up) etc. etc. despite being out and about in a major city for ~10 years. \nI do feel like a have a bit of an edge in conversations. It's a bit of a buffer to know that if I didn't manage to be charming at least I might have managed to be pretty. \n\nbut I also feel a lot of weird dislike and jealousy/derision.... quite a bit of it. IDK if it's envy or ppl assuming I'm vapid, I'm not quite sure. IDK I also struggle a lot with my own urge to be presentable so maybe I'm projecting ",
                "Edited?": "12-15-2018 16:21:15",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebukdzf": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebukdzf",
                "Author": "162decreasing",
                "Date Created": "12-15-2018 10:30:35",
                "Upvotes": 10,
                "Text": "Geez good luck\nI hope you achieve your goal\nI want to be one too :,)\n“Model thin” is what I always say ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebuyn7c": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebuyn7c",
                "Author": "[deleted]",
                "Date Created": "12-15-2018 13:21:48",
                "Upvotes": 29,
                "Text": "oof this thread is a mess",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebvmrd6": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebvmrd6",
                "Author": "incognitomiscreant",
                "Date Created": "12-15-2018 18:27:06",
                "Upvotes": 9,
                "Text": "is no one else still ugly and shitty to be around when they're skinny or just me haha",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebw0wxa": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebw0wxa",
                "Author": "hamaesa",
                "Date Created": "12-15-2018 21:51:52",
                "Upvotes": 8,
                "Text": "My face is so ugly this will never be me no matter how thin i get :((",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebwoz5r": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebwoz5r",
                "Author": "fuckinhelpmehdhd",
                "Date Created": "12-16-2018 07:20:23",
                "Upvotes": 5,
                "Text": "I feel this so much. I'm going to become an aesthetic twink, who needs food hahahaha",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebvfzqv": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebvfzqv",
                "Author": "Jmcdermott40",
                "Date Created": "12-15-2018 17:04:41",
                "Upvotes": 7,
                "Text": "If people don’t recognize how beautiful and amazing you are then fuck them. They’re not worth it. Any guy would be lucky to be with you and having a lot of people to hang out with doesn’t make them “friends”. You’re awesome and don’t waste time waiting for life wanting to be different because trust me the grass always looks greener from the other side.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "efu7a28": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "efu7a28",
                "Author": "ThroeAwaymeron",
                "Date Created": "02-05-2019 19:33:44",
                "Upvotes": 2,
                "Text": "I felt this so long and now I'm too old for anybody to particularly care even if I hit my goal weight. Womp womp.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ebvb6ir": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "ebvb6ir",
                "Author": "LittleBookOfSorrows",
                "Date Created": "12-15-2018 16:06:04",
                "Upvotes": 6,
                "Text": "\"  She barely said anything, just laughed along to other people’s jokes and yet somehow she was still the center of every conversation? \"\n\n&#x200B;\n\nDoesn't have much of a personality then?  Her looks won't last and then what?  With an eating disorder you won't even have friends because going out to eat is what people do to socialise and you won't be able to.  Your personality shines through with your words.  You'll still be more interesting when she loses her looks. Who knows, maybe she's not happy with herself in some way.  It's like when I see what I think is a perfect face yet the face owner goes and gets some cosmetic surgery.  I don't even know if anyone's happy with how they look.  Don't compare yourself to someone else, it really gets you nowhere and whatever you think, there's going to be something about you that somebody else envies. x",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ebvp7qj": [
                {
                    "Parent ID": "t1_ebvb6ir",
                    "Comment ID": "ebvp7qj",
                    "Author": "readmytealeaves",
                    "Date Created": "12-15-2018 18:59:46",
                    "Upvotes": 42,
                    "Text": "Wow what an awful way of thinking, having to put another girl down to comfort yourself. \n\n\"Doesn't have much of a personality\" uh maybe she's shy? Or she's quiet? Or y'know she's new, so it makes sense she isn't super social in the group yet. \n\nAnd you even say she'll go on to lose her looks lol.  Like all this was unnecessary and it ain't a healthy way to cope.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ebx0xti": [
                        {
                            "Parent ID": "t1_ebvp7qj",
                            "Comment ID": "ebx0xti",
                            "Author": "LittleBookOfSorrows",
                            "Date Created": "12-16-2018 10:46:55",
                            "Upvotes": 2,
                            "Text": ">Wow what an awful way of thinking, having to put another girl down to comfort yourself.\n\nPreferable to starving yourself and getting into an ED mess to comfort yourself though.  That's a less healthy way to cope.  ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebunuja": [
                [
                    {
                        "Parent ID": "t1_ebuazxe",
                        "Comment ID": "ebunuja",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:13:34",
                        "Upvotes": 42,
                        "Text": "It has it perks though. The people who still treated you the same throughout weight fluctuations are golden. (Same as in always were a dope friend) ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebups4y": [
                        {
                            "Parent ID": "t1_ebunuja",
                            "Comment ID": "ebups4y",
                            "Author": "cherrymama",
                            "Date Created": "12-15-2018 11:37:46",
                            "Upvotes": 24,
                            "Text": "I read this like 5 times as “dope fiend” and I’m like damn yeah I’m sure addicts would treat you the same way esp if you had something on you but that doesn’t seem like the point OP is making ? 😂 \n\n\n\nPs I’m an ex addict not trying to make anyone feel bad for using or anything ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw39mv": [
                [
                    {
                        "Parent ID": "t1_ebw214i",
                        "Comment ID": "ebw39mv",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:31:07",
                        "Upvotes": 15,
                        "Text": "> Moody, quiet, disinterested\n\nI find I tend to get an ok reaction to being my dead-pan moody self HAHA\n\nTheres so many different versions of cute. Please don't conflate being physically attractive with being skinny... if you know what I mean. That will likely just hurt you.\n\nRomantic relationships are possible for anyone who wants them.\n\n\nIt's ok to have moods and to have times when you are quiet and not cheery/popular.\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvzgo4": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebvzgo4",
                        "Author": "scrambledthoughts91",
                        "Date Created": "12-15-2018 21:28:56",
                        "Upvotes": 25,
                        "Text": "Hi, I currently live and work in India (I am Indian) but I have also worked in London and Dubai in the past 6 years and have similar experiences in all 3 countries. \n\nI work in a male dominated industry / financial sector (not my favourite job in the world but this is what I could get after my business degree) \n\nWhen I say \"don't have to lift a finger\" I don't mean I'm sitting on a throne like the queen of Sheba but what I meant is that when I'm around men or in public there are plenty of things that people offer to do to help , not just because I'm the fairer sex but because of how I look. \n\nThis isn't meant to be a brag because tbh I'm still stuck in the fat girl mindset and I get confused when people (especially men ) are too nice to me. It's an observation of what I have seen in my life. \n\nThis is also not to say that fat girls should be unhappy because even at my heaviest weight (220lbs) I had great friends, a boyfriend who adored me and a happy life. BUT after losing more than 100 lbs, everything just amplified 10 fold. \n\nI'm not saying that I love the attention but it is what it is. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0rp5": [
                        {
                            "Parent ID": "t1_ebvzgo4",
                            "Comment ID": "ebw0rp5",
                            "Author": "nodamncatnodamncradl",
                            "Date Created": "12-15-2018 21:49:30",
                            "Upvotes": 6,
                            "Text": "sorry answer only if you want to but, \nwhat specific nice things do people offer to help with in public or when you are \"around men\"? Do you feel like you can identify ways that this might be related to the  cultures  you listed or am I way off base\n\nWhat is \"being nice to you\" mean specifically, compared to how you remember being treated when you were 220?\n\nYour life sounds tremendously busy! You are a hiiiiiigh achiever and must have so much strength. I'm glad you feel like you've experienced a lot of happiness in your life.\n\nAny perspective about this is helping me understand something I don't feel like I have an awareness off\n\n",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ebw9kpt": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebw9kpt",
                        "Author": "bathroomhaunt",
                        "Date Created": "12-16-2018 00:30:53",
                        "Upvotes": 12,
                        "Text": "idk about treated like a queen necessarily but in the past few years ive gotten significantly more attractive and sometimes it does feel that way in comparison to me. when i was a chubby emo kid with blue hair ppl talked behind my back about how it was “nerdy” that i was a biology major. now that im a decently attractive blonde and about 50lbs lighter, when ppl talk about it im “smart” and “so determined”. dudes are A LOT nicer to me, and honestly girls want to be my friend way more often and go out of their way to do it. my classmates readily offer to help me with stuff, to study together, etc and that NEVER happened before. even my professors are nicer to me. people i went to high school with see my pics on instagram and suddenly now im worth talking to and they want to link up when im in my hometown. im sure to maintain all that i have to continue being a decently nice person lol, and i cant get away with just not doing anything bc who can but at least when it comes to this kinda stuff it definitely feels like i dont have to lift a finger anymore",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebx0x12": [
                [
                    {
                        "Parent ID": "t1_ebvgyet",
                        "Comment ID": "ebx0x12",
                        "Author": "BeginningBarnacle",
                        "Date Created": "12-16-2018 10:46:37",
                        "Upvotes": 11,
                        "Text": "Upvoting on reddit is a show of interest or support, not a ‘hey, that’s exactly me!’ \n\n(Although there are probably many pretty people here without a doubt)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebvobul": [
                [
                    {
                        "Parent ID": "t1_ebvchoo",
                        "Comment ID": "ebvobul",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 18:47:14",
                        "Upvotes": 12,
                        "Text": "I don't think your comment is really downvote-worthy at all!\n\nIt's an opinion about the post and it doesn't contain anything egregiously insulting IMO\n\n I just find your opinion a tad confusing. \n\n\n\nWhat is part of the incel mindset ?\n\nWhat does \"they know they won't have to settle\" mean? (especialy the settle part, but I actually just don't understand this part at all... like what evidence about a group of people definied what \"settling\" is and then didn't do it. Is this idea based in sociology, anthropology, psychology, philosophy, or what?\n\nI DO TOTALLY agree that attractive* people in many cultures (thought cultures/world cultures/historical cultures) are treated better and have privilege. Like I said... I can see where you are getting at. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebw0h9f": [
                        {
                            "Parent ID": "t1_ebvobul",
                            "Comment ID": "ebw0h9f",
                            "Author": "Grellous8",
                            "Date Created": "12-15-2018 21:44:52",
                            "Upvotes": 1,
                            "Text": "> What is part of the incel mindset ?\n> \n> What does \"they know they won't have to settle\" mean?\n\nI meant settle for a less attractive partner. The incel part pertains to the idea that if one is an incel, unlike more attractive people, one would be more likely to settle for a less attractive partner (yes, I am aware that physical attraction doesn't/shouldn't make the entire relationship, but it does enhance *certain* aspects of the relationship, so understand that \"settle\" is just used for lack of a better word). I'm also willing to bet that most incels wouldn't mind being treated \"like a ~~queen~~ king\" even if \"(they) know that they love (them) only for how great (they) look so the connection might fizzle out.\" The point being that if/when girls lose weight, they can get more attention, but for guys it tends to take more than just weight loss to become more attractive to/get attention from the opposite sex.",
                            "Edited?": "12-15-2018 21:54:35",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "eburgg6": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "eburgg6",
                        "Author": "_Spicy_Lemon_",
                        "Date Created": "12-15-2018 11:56:31",
                        "Upvotes": 10,
                        "Text": "Gurllllllllllllll😤😂🤔",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxw1q3": [
                [
                    {
                        "Parent ID": "t1_ebups4y",
                        "Comment ID": "ebxw1q3",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 16:56:20",
                        "Upvotes": 5,
                        "Text": "Lol as an addict trying to stay sober I did the same thing too 😅",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebxwerh": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebxwerh",
                        "Author": "Someone_Who_Isnt_You",
                        "Date Created": "12-16-2018 17:01:22",
                        "Upvotes": 10,
                        "Text": "Eh women need to do more than lose weight to get a man’s attention. It’s similar to what a guy needs to do. So yeah a girl can look good and put an makeup, but they still need to do upkeep on their bodies (most people don’t find skinny fat attractive), work on their teeth, quality of their skin, their personalities, work on their hair, and work on their social skills. This is all a given for women and most know that they can’t just be skinny to get men to like them. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ebw3r44": [
                [
                    {
                        "Parent ID": "t1_ebw0h9f",
                        "Comment ID": "ebw3r44",
                        "Author": "nodamncatnodamncradl",
                        "Date Created": "12-15-2018 22:39:15",
                        "Upvotes": 3,
                        "Text": "I guess your perspective about what is possible in romantic relationships is different than mine, and I'm just having trouble hearing how you are explaining this.\n\nI think that women spend the most money on cosmetics and things like plastic surgeries... I'm not familiar with the statistics but I don't agree with you last sentence at all... it sounds like weird logic and I don't know what you mean when you say \"other things it tends to take.\"\n\n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ebx145p": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx145p",
                            "Author": "BeginningBarnacle",
                            "Date Created": "12-16-2018 10:49:27",
                            "Upvotes": 5,
                            "Text": "An interesting observation however, is that sure, this behaviour is seen in attractive women and attractive men, but where are the ‘incel’ women?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ebx2jd8": [
                        {
                            "Parent ID": "t1_ebw3r44",
                            "Comment ID": "ebx2jd8",
                            "Author": "Grellous8",
                            "Date Created": "12-16-2018 11:09:49",
                            "Upvotes": -1,
                            "Text": "Being good looking may mean you wouldn't need as much cosmetics to improve looks. If a woman isn't already decent looking without makeup, she can:\n\n- Get some nice makeup \n\nand will be easily much better looking. If she wasn't getting attention from the opposite sex before, she is now.\n\nOther things it tends to take, **for men**, if they aren't already good looking:\n\n- Do gym\n\n- Improve looks (haircut, acne, skin, etc.)\n\n- Improve social skills/personality\n\n- Become very rich\n\nUpon making these **changes for the long-term**, the guy is now also competing with similar other good looking guys.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "eqxw21o": [
        [
            {
                "Parent ID": "t3_a6depr",
                "Comment ID": "eqxw21o",
                "Author": "ks788",
                "Date Created": "06-12-2019 16:22:55",
                "Upvotes": 1,
                "Text": "It’s sad but there’s nothing I want more than to be that girl.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}