{
    "ell7fit": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "ell7fit",
                "Author": "linedryonly",
                "Date Created": "04-23-2019 12:31:53",
                "Upvotes": 27,
                "Text": "I agree that projection is a habit of mine and many on this sub. I'm trying to avoid making categorical \"disordered\" or \"non-disordered\" judgements. Ultimately, it's none of my business to assume either way. It's hard to change my mindset but unless someone appears to be in immediate mortal danger, I try to avoid giving too much attention to their eating habits.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elkvjuw": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "elkvjuw",
                "Author": "[deleted]",
                "Date Created": "04-23-2019 10:30:00",
                "Upvotes": 94,
                "Text": "[deleted]",
                "Edited?": "05-23-2019 10:24:46",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ell00i1": [
                {
                    "Parent ID": "t1_elkvjuw",
                    "Comment ID": "ell00i1",
                    "Author": "GenericName72",
                    "Date Created": "04-23-2019 11:15:58",
                    "Upvotes": 51,
                    "Text": "That's not on us to diagnose them or judge them for whatever mental conditions they may or may not have. The line isn't for us to draw.\n\nI see it as the same difference between partying occasionally and binge drinking and alcoholism. One is socially acceptable and normal, one is concerning and may point to issues, and one is a diagnosed psychological condition. The lines are blurry and it's ridiculous that we keep pointing fingers and saying \"THEY have the same problem as me, in my opinion. judge THEM and not ME because at least I admit it\".",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "ellzdcu": [
                        {
                            "Parent ID": "t1_ell00i1",
                            "Comment ID": "ellzdcu",
                            "Author": "waystosaygoodbye33",
                            "Date Created": "04-23-2019 17:27:24",
                            "Upvotes": 5,
                            "Text": "AMEN.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ell05xr": [
                        {
                            "Parent ID": "t1_ell00i1",
                            "Comment ID": "ell05xr",
                            "Author": "[deleted]",
                            "Date Created": "04-23-2019 11:17:26",
                            "Upvotes": 18,
                            "Text": "[deleted]",
                            "Edited?": "05-23-2019 10:24:42",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elld38r": [
                [
                    {
                        "Parent ID": "t1_ell5bw9",
                        "Comment ID": "elld38r",
                        "Author": "WearyBumblebee",
                        "Date Created": "04-23-2019 13:31:43",
                        "Upvotes": -10,
                        "Text": "lol exactly how many of your friends from college went onto become alcoholics? The behavior isn’t healthy and in some it could develop into a real problem but for the vast majority of people it remains an occasional unhealthy habit. In the case of American drinking culture, for many it remains a “phase” in college \n\nI like ur fertilizer analogy and agree but the topic at hand is diagnosing other people. I don’t think it’s right to see other people with a few of our habits and slam them with a disorder title, acting as if we know them better than they know themselves. i never said they aren’t contributing to an environment that could foster an ED in people with the potential to develop one. I just said we shouldn’t be saying that they have one ourselves. I’ve seen too many girls on YouTube or on twitter have to show pictures of their parents or them as a kid or otherwise explain why they are thin bc people keep harassing them and there are plenty of people that do a juice cleanse bc of Beyoncé or whatever and then just go back to normal.\n\nI’m glad u like my analogy and I like where u ran with it but u definitely misinterpreted a lot of what I was trying to say lmao. You’re reading into things and putting words into my mouth friend",
                        "Edited?": "04-23-2019 13:39:34",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "elldtwz": [
                        {
                            "Parent ID": "t1_elld38r",
                            "Comment ID": "elldtwz",
                            "Author": "PM_ME_YER_SHIBA_INUS",
                            "Date Created": "04-23-2019 13:39:25",
                            "Upvotes": 18,
                            "Text": "> lol exactly how many of your friends from college went onto become alcoholics? \n\nMan, you don't want me to answer that.\n\nThat kinda helps the analogy from this side too. Most people I know who're into fitness don't have EDs (afaik), but out of the people that come clean to me, every single one had that \"fitness stage\". Find me an alcoholic who went to college, and they drank too. Not every bug's an insect, but if you catch a bunch of bugs, you'll get a whole lot of insects. It's hardly \"projection\" to start suspecting that insects that act like bugs may be bugs.",
                            "Edited?": "04-23-2019 13:55:14",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ell0urh": [
                [
                    {
                        "Parent ID": "t1_ell05xr",
                        "Comment ID": "ell0urh",
                        "Author": "GenericName72",
                        "Date Created": "04-23-2019 11:24:15",
                        "Upvotes": 35,
                        "Text": "Of course. A diagnosis from a doctor will usually be accurate since they have the diagnostic criteria, but family saying \"omg you're eating at 1200/day, you're anorexic\" isn't a diagnosis. Not everybody on this sub has an eating disorder. It's a support group for disordered thoughts.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "ell15p2": [
                        {
                            "Parent ID": "t1_ell0urh",
                            "Comment ID": "ell15p2",
                            "Author": "[deleted]",
                            "Date Created": "04-23-2019 11:27:21",
                            "Upvotes": 12,
                            "Text": "[deleted]",
                            "Edited?": "05-23-2019 10:24:40",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elle0wf": [
                [
                    {
                        "Parent ID": "t1_elldtwz",
                        "Comment ID": "elle0wf",
                        "Author": "WearyBumblebee",
                        "Date Created": "04-23-2019 13:41:24",
                        "Upvotes": -4,
                        "Text": "Ok then I guess we can all just speak from our personal experiences. The analogy made sense to me because none of mine (nor I) did🤷‍♀️.\n\nEdit: ok u added more to ur comment so I’ll respond to that. Yeah once again I’m not disagreeing with you. My point remains that we don’t know enough to be diagnosing other people so we shouldn’t. Just because such behavior indicates a higher potential for whatever disease is in question doesn’t mean we should assume everyone with the behavior has the issue at hand",
                        "Edited?": "04-23-2019 13:45:06",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellfp56": [
                        {
                            "Parent ID": "t1_elle0wf",
                            "Comment ID": "ellfp56",
                            "Author": "PM_ME_YER_SHIBA_INUS",
                            "Date Created": "04-23-2019 13:58:20",
                            "Upvotes": 8,
                            "Text": "> My point remains that we don’t know enough to be diagnosing other people so we shouldn’t.\n\nOh okay, sorry, I thought you were trying to say that it's as dumb to worry about EDs in fitness culture circles as it would be to worry about alcoholism on college campuses.\n\nI was just like **wait no, PLEASE worry about budding alcoholism on college campuses!!**, and then I just kinda kept thinking about the analogy.\n\n> My point remains that we don’t know enough to be diagnosing other people so we shouldn’t.\n\nI complete agree with this in general tbh, and really like seeing subreddits that have \"we can't diagnose you\" in the sidebar to discourage it. It's one thing to worry about someone, but it's a whole other thing to diagnose people from across a keyboard. That's just invasive even if the diagnosis is right, let alone if it's wrong.\n\nMost people online aren't even qualified to diagnose illnesses in the first place. God knows some doctors shouldn't be either, but at least they have access to more info about the full story.\n\nThanks for clarifying! And yeah, oops, I usually end up editing posts a lot and just kinda...hope the other person doesn't check their notifications too fast.",
                            "Edited?": "04-23-2019 14:27:34",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellehur": [
                [
                    {
                        "Parent ID": "t1_ell15p2",
                        "Comment ID": "ellehur",
                        "Author": "synedchdochee",
                        "Date Created": "04-23-2019 13:46:21",
                        "Upvotes": 26,
                        "Text": "Yo I'm not a doctor, but seeing some of your posts before, you definitely have some disordered habits / thoughts lmao \"21 BMI is huge on my frame\" yeah... non-disordered people don't think like that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "elleod1": [
                        {
                            "Parent ID": "t1_ellehur",
                            "Comment ID": "elleod1",
                            "Author": "[deleted]",
                            "Date Created": "04-23-2019 13:48:07",
                            "Upvotes": -14,
                            "Text": "[deleted]",
                            "Edited?": "05-23-2019 10:24:28",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellmcu5": [
                [
                    {
                        "Parent ID": "t1_elleod1",
                        "Comment ID": "ellmcu5",
                        "Author": "smittenkitt3n",
                        "Date Created": "04-23-2019 15:06:12",
                        "Upvotes": 16,
                        "Text": "a 20 BMI is **not** “fat”. if you think it is, then what bmi is good enough? 18.5-19.5? is it even reasonable to think that people can only be “healthy” in that tiny bmi range???? \n\nit’s fine to think you look better at a lower weight. that’s just an opinion. but to think you look shitty and wanting to restrict, even at a healthy weight, and “mourning” your skinny body *is* disordered. (checked your post history) people get diagnosed with eating disorders because of the way they *think* and *act* about/around food.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellmgqd": [
                        {
                            "Parent ID": "t1_ellmcu5",
                            "Comment ID": "ellmgqd",
                            "Author": "[deleted]",
                            "Date Created": "04-23-2019 15:07:19",
                            "Upvotes": -12,
                            "Text": "[deleted]",
                            "Edited?": "05-23-2019 10:24:19",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellg9wr": [
                [
                    {
                        "Parent ID": "t1_elleod1",
                        "Comment ID": "ellg9wr",
                        "Author": "ifuckpineapples",
                        "Date Created": "04-23-2019 14:04:13",
                        "Upvotes": 5,
                        "Text": "im just gonna say im with you on this one. obvi being 'big boned' isnt real but some people have smaller or larger frames. im short already but my frame is so small that my own family was telling me to go to the gym when i hit a bmi of 21.  sure it was objectively still healthy, but i wasnt working out or anything so it just looked bad on me. maybe if that was a bmi of 21 but with mostly muscles, it would look good. anyways, i get it it isnt disordered to think you dont look good at a healthy weight. bmi 24 is healthy but its on the high end, most people probably look a bit thick on that end even though its healthy anyways",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellssp9": [
                        {
                            "Parent ID": "t1_ellg9wr",
                            "Comment ID": "ellssp9",
                            "Author": "oenone_",
                            "Date Created": "04-23-2019 16:12:30",
                            "Upvotes": 2,
                            "Text": "Wow this has made things click for me! It sounds dumb, but I always thought that having a small frame would be an advantage, but then not understand why I looked so fat at the high end of a healthy weight when bigger boned friends looked slimmer at the same or even a higher weight. Of course, height is a factor too, and at 5'1 I really do feel I've lost the genetic lottery... it's like I only look good when my weight is at the low end of healthy. Otherwise I literally look a bit chubby even right in the middle of a healthy weight.\n\n\nEdit: a small frame other than my childbearing hips and big knees. What's especially disappointing is that my big hips can make people think I'm thicc... then I turn to the side and have no butt and it's like nvm, just cursed with somehow looking too fat and too skinny at the same time.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ellghbo": [
                        {
                            "Parent ID": "t1_ellg9wr",
                            "Comment ID": "ellghbo",
                            "Author": "[deleted]",
                            "Date Created": "04-23-2019 14:06:21",
                            "Upvotes": -8,
                            "Text": "[deleted]",
                            "Edited?": "05-23-2019 10:24:25",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellnp2c": [
                [
                    {
                        "Parent ID": "t1_ellmgqd",
                        "Comment ID": "ellnp2c",
                        "Author": "smittenkitt3n",
                        "Date Created": "04-23-2019 15:19:48",
                        "Upvotes": 24,
                        "Text": "what the fuck lol\n\ni’m 5’4 and looked great at 125 lbs....\n\nthere’s nothinf wrong with weighing 110 lbs at that height, bc it’s still at a healthy weight, but if you think you look **disgusting** at 125 pounds, then you’re disordered as fuck and in denial\n\nedit: eating 2-3 times a day + snacking is NORMAL! and you enjoy food? wow how dare you enjoy doing something that normal humans like and have built cultures around.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ellmofp": [
                [
                    {
                        "Parent ID": "t1_ellmgqd",
                        "Comment ID": "ellmofp",
                        "Author": "synedchdochee",
                        "Date Created": "04-23-2019 15:09:31",
                        "Upvotes": 18,
                        "Text": "(you think this way because you have an eating disorder)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellmvn5": [
                        {
                            "Parent ID": "t1_ellmofp",
                            "Comment ID": "ellmvn5",
                            "Author": "[deleted]",
                            "Date Created": "04-23-2019 15:11:34",
                            "Upvotes": -11,
                            "Text": "[deleted]",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elm3wzc": [
                [
                    {
                        "Parent ID": "t1_ellmgqd",
                        "Comment ID": "elm3wzc",
                        "Author": "molotov-cocktail",
                        "Date Created": "04-23-2019 18:22:57",
                        "Upvotes": 7,
                        "Text": "how can you see certain habits or a demeanours as fat without a level of disordered thinking? fat is the storage of excess energy on your body. it isn't a personality trait or set of behaviours.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "elm6brl": [
                [
                    {
                        "Parent ID": "t1_ellssp9",
                        "Comment ID": "elm6brl",
                        "Author": "ifuckpineapples",
                        "Date Created": "04-23-2019 18:51:59",
                        "Upvotes": 1,
                        "Text": "im also pear shaped and 5'3, so i feel your pain. i know its not an exact science but ever since they included the [IBW](http://www.nafwa.org/hamwi.php) calculation on justcico.com, ive felt fully justified in knowing im *supposed* to be near underweight with my frame. I seriously look normal at their small frame estimate for my height and its what i feel comfortable around",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ellgp70": [
                [
                    {
                        "Parent ID": "t1_ellghbo",
                        "Comment ID": "ellgp70",
                        "Author": "ifuckpineapples",
                        "Date Created": "04-23-2019 14:08:36",
                        "Upvotes": -8,
                        "Text": "im 100% with you. if people didnt get so salty about losing weight and didnt spread so many misconceptions and fatlogic everywhere, i probably couldve just lost to a healthy weight and been mentally fine. but even restricting to 1200 cals i have to hide it from my family or theyll flip. cause they dont understand basic healthy eating. it sucks",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellgv8q": [
                        {
                            "Parent ID": "t1_ellgp70",
                            "Comment ID": "ellgv8q",
                            "Author": "[deleted]",
                            "Date Created": "04-23-2019 14:10:18",
                            "Upvotes": -6,
                            "Text": "[deleted]",
                            "Edited?": "05-23-2019 10:24:24",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellthsg": [
                [
                    {
                        "Parent ID": "t1_ellmvn5",
                        "Comment ID": "ellthsg",
                        "Author": "PhoneWalletSanity",
                        "Date Created": "04-23-2019 16:20:03",
                        "Upvotes": 3,
                        "Text": "You are if you think people can only be healthy in a tiny, low BMI range. A BMI of 21 is not chunky and it's toxic to both yourself and others to say so. Eating and enjoying food is *healthy* and eating sugar and \"junk\" food is also *healthy* in *moderation*.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ellj35m": [
                [
                    {
                        "Parent ID": "t1_ellgv8q",
                        "Comment ID": "ellj35m",
                        "Author": "ifuckpineapples",
                        "Date Created": "04-23-2019 14:33:34",
                        "Upvotes": -10,
                        "Text": "lmaaoo good I'm sorry but you're right and it's funny and sad. I wish I could review the recovery process as a whole and give it one star. tbh it barely seems to work for fucking anyone and all they do is treat the symptoms and not the problem. imagine if we treating arachnophobia by forcing you to hold a spider in your hand every day and maybe at the end of the week a therapist asks you if you feel better about it yet. also the spider is venomous. it's real stupid",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ellf1ow": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "ellf1ow",
                "Author": "yerererh45y4",
                "Date Created": "04-23-2019 13:51:49",
                "Upvotes": 15,
                "Text": "Yeah, I always think it's quite annoying when people call out those who fast or whatever because it's \"obviously ED behaviour\" or something. I get that it comes from a place of experience where we would just starve ourselves for days and claim it was fasting, but starving and fasting are very different.\n\nThe average person engaging in discussion on a fasting-specific board or something will almost certainly know how to safely and appropriately do it - and that goes for any specialised diet. I just think it's a little harsh to throw the \"mentally ill\" label at people, especially when it's coming from a place of ignorance and in actuality they know far better about the subject.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elld4ed": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "elld4ed",
                "Author": "synedchdochee",
                "Date Created": "04-23-2019 13:32:03",
                "Upvotes": 49,
                "Text": "\"Crash diets aren't indicative of a problem\" uhh. Starving yourself for weeks, denying yourself any pleasure, and other such crash diet parameters are, in fact, a problem. Diet culture is a huge problem in the world today. \n\nI don't think dieting to lose weight is unhealthy, on the the contrary, losing weight for health is a great thing! But once you get into the self-loathing mindset and start pushing yourself too hard, which is very easy for dieters to spiral into, well, that's when it gets unhealthy. A lot of people who practice disordered eating start off as healthy dieters but fuck up their relationship with food, and start relying on the praise they got from weight loss, not realizing how far they slip until it's too late. And this isn't me projecting- the NEDA reports that about a quarter of all \"normal dieters\" develop an eating disorder. And in a culture that praises unhealthy thinness and there's whole diet sub-cultures of putting food into \"bad\" categories, you'd be surprised at the amount of  disordered eating habits that start becoming normalized- and even praised. Eating disorders are INCREDIBLY common, chances are you know quite a few people who struggle, just like you or me. \n\nSo if someone, especially someone very thin, is showing signs of disordered eating, people reaching out showing concern isn't a problem, it's being careful in this culture that villifies anyone who isn't thin.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ellehf2": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "ellehf2",
                "Author": "lileruneal",
                "Date Created": "04-23-2019 13:46:14",
                "Upvotes": 30,
                "Text": "Arnold Anderson a researcher who studied eating disorders identified intense \"wilfull dieting\" as the first stage to anorexia. While not everyone will move from that to full blown eating disorder which he defines as a second stage where there is an intense fear of weight gain and fat, people can absolutely be on that precipice. I don't believe long term fasting (unless maybe for religious purposes??) is healthy. I know there are health benefits, but it can be a trigger that moves someone to disordered eating. Likewise, some of the posts on 1200isplenty are absolutely triggering and clearly represent some issues with food. \n\nWhile I agree we can't be armchair psychologists and diagnose others, diet culture normalizes unhealthy relationships with food. People can have disordered eating but label it a \"diet\". It's not. And it's important to call that shit out.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ell53iq": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "ell53iq",
                "Author": "PM_ME_YER_SHIBA_INUS",
                "Date Created": "04-23-2019 12:07:44",
                "Upvotes": 33,
                "Text": "> Can I just give a friendly reminder that crash diets have always existed and aren’t indicative of a problem? \n\nLol. Can I give a friendly reminder that even if they currently lack a raging eating disorder, for people who haven't been disordered for as long as they can remember, pre-disorder crash-dieting is almost a rule more than an exception?\n\nNot sure the most frequent problem with fitness culture is people assuming that diets *are* unhealthy. More like \"assuming that everyone is Just Fine as long as they don't say the d word, even if they brag about not eating for nearly a month, or overexercise to purge oops meals a-la lesser-known bulimia, or...\".\n\nI'm not saying everyone with dubious public habits has an ED, but man, everyone who goes \"wow, that seems disordered but ok\" isn't just \"\"\"\"projecting\"\"\"\".\n\nAnd it feels an awful lot like saying (or implying?) so is weaponizing peoples' disorders to override their viewpoints in a way that bypasses the real crux of whether their suspicions are actually well-founded.",
                "Edited?": "04-23-2019 15:45:34",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ellbovb": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "ellbovb",
                "Author": "lavenderelf",
                "Date Created": "04-23-2019 13:17:03",
                "Upvotes": 11,
                "Text": "ultimately people want to relate to others",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ellw59p": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "ellw59p",
                "Author": "princess-kitty-belle",
                "Date Created": "04-23-2019 16:49:14",
                "Upvotes": 11,
                "Text": "I don't necessarily think they have eating disorders, but I think a lot of youtubers do promote an unhealthy relationship with food. Avoiding certain food groups out of fear or classifying food as \"good\" or \"bad \"is hugely problematic.\n\n&#x200B;\n\nAlso, diet culture is extremely problematic and crash dieting in itself is a problem and often results in binge eating and the indvidual blaming themselves when this happens rather than viewing it as a failure of the diet. Something like 95-98% of diet result in failure. Just because those things have existed for a while doesn't make them not harmful.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elm006w": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "elm006w",
                "Author": "waystosaygoodbye33",
                "Date Created": "04-23-2019 17:35:03",
                "Upvotes": 2,
                "Text": "It’s a spectrum and I think a lot of posta here seem to forget that; on one end is binge eating, in the middle is a normal diet, the other end restrictive eating disorders. Somewhere between normal eating and dieting exists dieting, crash dieting, etc. they are disordered behaviors but not inherently an eating disorder. Most people throughout their life, especially if they have a health crisis or attempt to find that healthy medium with eating, end up under-eating for a bit. It’s a journey to find a dietary pattern that works for you. \n\nDiets are becoming more and more common, as are as campaigns trying to profit off of insecurity and being body conscious- id argue that having self esteem and body image issues are the norm now in society. \n\nWhen these things become pathologies is when they begin to risk somebody’s health/wellbeing, impact their ability to function, or impact their ability to have normal stable reactions. So as online users we cannot alone determine if somebody underweight and dieting has an eating disorder, no more than we can determine if somebody who we see have a drink in a bar is a alcoholic. \n\nYes - sometimes it’s most likely beyond a reasonable doubt somebody with an eating disorder in denial - I’ve thought that about many girls I’ve seen post online. But does that they (1) surely have an ED or (2) that it’s my place to say something? No. Because it’s none of my business unless they want to talk about it, and it’s very easy to simply take a diet too far. \n\nI’ve commented before about this, as every time a celebrity talks about having body image issues and dieting people here assume that it’s an ED. Could it be? Yes. Is there a high probability l that it’s an ED? Yes. Should we assume it’s one because of that information alone? No. \n\nThere definitely is an element of projection, but I also think that being forced to be hyper aware of food, we also become hyper aware of others intakes, the things society suggests, and the ways in which dieting occurs. I think being sensitive is a more accurate description but merely my experience. :)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elm44ab": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "elm44ab",
                "Author": "AmbiguousCat",
                "Date Created": "04-23-2019 18:25:26",
                "Upvotes": 2,
                "Text": "I think I want to assume both yaknow? Talk to people in a kind and considerate manor like they might be struggling as you are as to not make them feel more self conscious. But EDs come in all body types so not assuming that because someone is skinnier they must have an issue.\n\nEven if they DO have an ED. How would you feel if someone pointed it out. It’s awkward and uncomfortable. I imagine it’s offensive and hurtful for those who don’t have one or maybe even are self conscious of being too skinny.\n\nI think a majority of people have some form of self conscious feelings and it’s best to avoid comments that are negative in general. \n\nThat being said, you are right. Plenty of diets and fasting and such are perfectly safe and normal when done by the right person. I think we are the extreme in terms of ‘dieting’ and plenty of people don’t cross the unhealthy or dangerous threshold.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elkvn09": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "elkvn09",
                "Author": "WearyBumblebee",
                "Date Created": "04-23-2019 10:30:56",
                "Upvotes": 4,
                "Text": "yes this is so frustrating. i don't understand the witch hunting of people on other subs and just on twitter in general. you can have disordered eating and not have an eating disorder. everyone has bad behaviors. like if i applied this kind of logic to college, my entire campus would suffer from alcoholism lol",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ell5bw9": [
                {
                    "Parent ID": "t1_elkvn09",
                    "Comment ID": "ell5bw9",
                    "Author": "PM_ME_YER_SHIBA_INUS",
                    "Date Created": "04-23-2019 12:10:12",
                    "Upvotes": 36,
                    "Text": "> like if i applied this kind of logic to college, my entire campus would suffer from alcoholism lol\n\nYou mean, college would have a widespread problem with a culture of binge-drinking that normalizes and catalyzes alcoholism? Whoa, that's so far removed from reality. What a strange hypothetical situation.\n\nSure, fast-n-restrict crash dieting fitness isn't inherently a disorder, just like alcohol abuse isn't the same as alcoholism...but #1 is fertilizer for #2, marinating in the environment will help bolster symptoms as those symptoms are encouraged, and the audience overlaps by a mile.\n\nOne culture praises being able to never eat, or \"eat anything and never gain weight\", as long as nobody asks and nobody tells about how that skill was cultivated. The other praises being able to always drink, or drink a lot, as long as nobody asks and nobody tells about how that skill was cultivated.\n\nNot linking fitness culture with eating disorders, or college binge-drinking with alcoholism, is being more willfully blind than if we claimed they were synonymous.\n\nActually, this is a really good analogy, the more I think about it. Just not even remotely how it was intended.",
                    "Edited?": "04-23-2019 15:00:16",
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "elld38r": [
                        {
                            "Parent ID": "t1_ell5bw9",
                            "Comment ID": "elld38r",
                            "Author": "WearyBumblebee",
                            "Date Created": "04-23-2019 13:31:43",
                            "Upvotes": -10,
                            "Text": "lol exactly how many of your friends from college went onto become alcoholics? The behavior isn’t healthy and in some it could develop into a real problem but for the vast majority of people it remains an occasional unhealthy habit. In the case of American drinking culture, for many it remains a “phase” in college \n\nI like ur fertilizer analogy and agree but the topic at hand is diagnosing other people. I don’t think it’s right to see other people with a few of our habits and slam them with a disorder title, acting as if we know them better than they know themselves. i never said they aren’t contributing to an environment that could foster an ED in people with the potential to develop one. I just said we shouldn’t be saying that they have one ourselves. I’ve seen too many girls on YouTube or on twitter have to show pictures of their parents or them as a kid or otherwise explain why they are thin bc people keep harassing them and there are plenty of people that do a juice cleanse bc of Beyoncé or whatever and then just go back to normal.\n\nI’m glad u like my analogy and I like where u ran with it but u definitely misinterpreted a lot of what I was trying to say lmao. You’re reading into things and putting words into my mouth friend",
                            "Edited?": "04-23-2019 13:39:34",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellzdcu": [
                [
                    {
                        "Parent ID": "t1_ell00i1",
                        "Comment ID": "ellzdcu",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "04-23-2019 17:27:24",
                        "Upvotes": 5,
                        "Text": "AMEN.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ell05xr": [
                [
                    {
                        "Parent ID": "t1_ell00i1",
                        "Comment ID": "ell05xr",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 11:17:26",
                        "Upvotes": 18,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:42",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ell0urh": [
                        {
                            "Parent ID": "t1_ell05xr",
                            "Comment ID": "ell0urh",
                            "Author": "GenericName72",
                            "Date Created": "04-23-2019 11:24:15",
                            "Upvotes": 35,
                            "Text": "Of course. A diagnosis from a doctor will usually be accurate since they have the diagnostic criteria, but family saying \"omg you're eating at 1200/day, you're anorexic\" isn't a diagnosis. Not everybody on this sub has an eating disorder. It's a support group for disordered thoughts.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elldtwz": [
                [
                    {
                        "Parent ID": "t1_elld38r",
                        "Comment ID": "elldtwz",
                        "Author": "PM_ME_YER_SHIBA_INUS",
                        "Date Created": "04-23-2019 13:39:25",
                        "Upvotes": 18,
                        "Text": "> lol exactly how many of your friends from college went onto become alcoholics? \n\nMan, you don't want me to answer that.\n\nThat kinda helps the analogy from this side too. Most people I know who're into fitness don't have EDs (afaik), but out of the people that come clean to me, every single one had that \"fitness stage\". Find me an alcoholic who went to college, and they drank too. Not every bug's an insect, but if you catch a bunch of bugs, you'll get a whole lot of insects. It's hardly \"projection\" to start suspecting that insects that act like bugs may be bugs.",
                        "Edited?": "04-23-2019 13:55:14",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "elle0wf": [
                        {
                            "Parent ID": "t1_elldtwz",
                            "Comment ID": "elle0wf",
                            "Author": "WearyBumblebee",
                            "Date Created": "04-23-2019 13:41:24",
                            "Upvotes": -4,
                            "Text": "Ok then I guess we can all just speak from our personal experiences. The analogy made sense to me because none of mine (nor I) did🤷‍♀️.\n\nEdit: ok u added more to ur comment so I’ll respond to that. Yeah once again I’m not disagreeing with you. My point remains that we don’t know enough to be diagnosing other people so we shouldn’t. Just because such behavior indicates a higher potential for whatever disease is in question doesn’t mean we should assume everyone with the behavior has the issue at hand",
                            "Edited?": "04-23-2019 13:45:06",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ell15p2": [
                [
                    {
                        "Parent ID": "t1_ell0urh",
                        "Comment ID": "ell15p2",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 11:27:21",
                        "Upvotes": 12,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:40",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellehur": [
                        {
                            "Parent ID": "t1_ell15p2",
                            "Comment ID": "ellehur",
                            "Author": "synedchdochee",
                            "Date Created": "04-23-2019 13:46:21",
                            "Upvotes": 26,
                            "Text": "Yo I'm not a doctor, but seeing some of your posts before, you definitely have some disordered habits / thoughts lmao \"21 BMI is huge on my frame\" yeah... non-disordered people don't think like that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellfp56": [
                [
                    {
                        "Parent ID": "t1_elle0wf",
                        "Comment ID": "ellfp56",
                        "Author": "PM_ME_YER_SHIBA_INUS",
                        "Date Created": "04-23-2019 13:58:20",
                        "Upvotes": 8,
                        "Text": "> My point remains that we don’t know enough to be diagnosing other people so we shouldn’t.\n\nOh okay, sorry, I thought you were trying to say that it's as dumb to worry about EDs in fitness culture circles as it would be to worry about alcoholism on college campuses.\n\nI was just like **wait no, PLEASE worry about budding alcoholism on college campuses!!**, and then I just kinda kept thinking about the analogy.\n\n> My point remains that we don’t know enough to be diagnosing other people so we shouldn’t.\n\nI complete agree with this in general tbh, and really like seeing subreddits that have \"we can't diagnose you\" in the sidebar to discourage it. It's one thing to worry about someone, but it's a whole other thing to diagnose people from across a keyboard. That's just invasive even if the diagnosis is right, let alone if it's wrong.\n\nMost people online aren't even qualified to diagnose illnesses in the first place. God knows some doctors shouldn't be either, but at least they have access to more info about the full story.\n\nThanks for clarifying! And yeah, oops, I usually end up editing posts a lot and just kinda...hope the other person doesn't check their notifications too fast.",
                        "Edited?": "04-23-2019 14:27:34",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "elleod1": [
                [
                    {
                        "Parent ID": "t1_ellehur",
                        "Comment ID": "elleod1",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 13:48:07",
                        "Upvotes": -14,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:28",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellmcu5": [
                        {
                            "Parent ID": "t1_elleod1",
                            "Comment ID": "ellmcu5",
                            "Author": "smittenkitt3n",
                            "Date Created": "04-23-2019 15:06:12",
                            "Upvotes": 16,
                            "Text": "a 20 BMI is **not** “fat”. if you think it is, then what bmi is good enough? 18.5-19.5? is it even reasonable to think that people can only be “healthy” in that tiny bmi range???? \n\nit’s fine to think you look better at a lower weight. that’s just an opinion. but to think you look shitty and wanting to restrict, even at a healthy weight, and “mourning” your skinny body *is* disordered. (checked your post history) people get diagnosed with eating disorders because of the way they *think* and *act* about/around food.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ellg9wr": [
                        {
                            "Parent ID": "t1_elleod1",
                            "Comment ID": "ellg9wr",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:04:13",
                            "Upvotes": 5,
                            "Text": "im just gonna say im with you on this one. obvi being 'big boned' isnt real but some people have smaller or larger frames. im short already but my frame is so small that my own family was telling me to go to the gym when i hit a bmi of 21.  sure it was objectively still healthy, but i wasnt working out or anything so it just looked bad on me. maybe if that was a bmi of 21 but with mostly muscles, it would look good. anyways, i get it it isnt disordered to think you dont look good at a healthy weight. bmi 24 is healthy but its on the high end, most people probably look a bit thick on that end even though its healthy anyways",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellmgqd": [
                [
                    {
                        "Parent ID": "t1_ellmcu5",
                        "Comment ID": "ellmgqd",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 15:07:19",
                        "Upvotes": -12,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:19",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellnp2c": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "ellnp2c",
                            "Author": "smittenkitt3n",
                            "Date Created": "04-23-2019 15:19:48",
                            "Upvotes": 24,
                            "Text": "what the fuck lol\n\ni’m 5’4 and looked great at 125 lbs....\n\nthere’s nothinf wrong with weighing 110 lbs at that height, bc it’s still at a healthy weight, but if you think you look **disgusting** at 125 pounds, then you’re disordered as fuck and in denial\n\nedit: eating 2-3 times a day + snacking is NORMAL! and you enjoy food? wow how dare you enjoy doing something that normal humans like and have built cultures around.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ellmofp": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "ellmofp",
                            "Author": "synedchdochee",
                            "Date Created": "04-23-2019 15:09:31",
                            "Upvotes": 18,
                            "Text": "(you think this way because you have an eating disorder)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "elm3wzc": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "elm3wzc",
                            "Author": "molotov-cocktail",
                            "Date Created": "04-23-2019 18:22:57",
                            "Upvotes": 7,
                            "Text": "how can you see certain habits or a demeanours as fat without a level of disordered thinking? fat is the storage of excess energy on your body. it isn't a personality trait or set of behaviours.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellssp9": [
                [
                    {
                        "Parent ID": "t1_ellg9wr",
                        "Comment ID": "ellssp9",
                        "Author": "oenone_",
                        "Date Created": "04-23-2019 16:12:30",
                        "Upvotes": 2,
                        "Text": "Wow this has made things click for me! It sounds dumb, but I always thought that having a small frame would be an advantage, but then not understand why I looked so fat at the high end of a healthy weight when bigger boned friends looked slimmer at the same or even a higher weight. Of course, height is a factor too, and at 5'1 I really do feel I've lost the genetic lottery... it's like I only look good when my weight is at the low end of healthy. Otherwise I literally look a bit chubby even right in the middle of a healthy weight.\n\n\nEdit: a small frame other than my childbearing hips and big knees. What's especially disappointing is that my big hips can make people think I'm thicc... then I turn to the side and have no butt and it's like nvm, just cursed with somehow looking too fat and too skinny at the same time.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "elm6brl": [
                        {
                            "Parent ID": "t1_ellssp9",
                            "Comment ID": "elm6brl",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 18:51:59",
                            "Upvotes": 1,
                            "Text": "im also pear shaped and 5'3, so i feel your pain. i know its not an exact science but ever since they included the [IBW](http://www.nafwa.org/hamwi.php) calculation on justcico.com, ive felt fully justified in knowing im *supposed* to be near underweight with my frame. I seriously look normal at their small frame estimate for my height and its what i feel comfortable around",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellghbo": [
                [
                    {
                        "Parent ID": "t1_ellg9wr",
                        "Comment ID": "ellghbo",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 14:06:21",
                        "Upvotes": -8,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:25",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellgp70": [
                        {
                            "Parent ID": "t1_ellghbo",
                            "Comment ID": "ellgp70",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:08:36",
                            "Upvotes": -8,
                            "Text": "im 100% with you. if people didnt get so salty about losing weight and didnt spread so many misconceptions and fatlogic everywhere, i probably couldve just lost to a healthy weight and been mentally fine. but even restricting to 1200 cals i have to hide it from my family or theyll flip. cause they dont understand basic healthy eating. it sucks",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellmvn5": [
                [
                    {
                        "Parent ID": "t1_ellmofp",
                        "Comment ID": "ellmvn5",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 15:11:34",
                        "Upvotes": -11,
                        "Text": "[deleted]",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellthsg": [
                        {
                            "Parent ID": "t1_ellmvn5",
                            "Comment ID": "ellthsg",
                            "Author": "PhoneWalletSanity",
                            "Date Created": "04-23-2019 16:20:03",
                            "Upvotes": 3,
                            "Text": "You are if you think people can only be healthy in a tiny, low BMI range. A BMI of 21 is not chunky and it's toxic to both yourself and others to say so. Eating and enjoying food is *healthy* and eating sugar and \"junk\" food is also *healthy* in *moderation*.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellgv8q": [
                [
                    {
                        "Parent ID": "t1_ellgp70",
                        "Comment ID": "ellgv8q",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 14:10:18",
                        "Upvotes": -6,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:24",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellj35m": [
                        {
                            "Parent ID": "t1_ellgv8q",
                            "Comment ID": "ellj35m",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:33:34",
                            "Upvotes": -10,
                            "Text": "lmaaoo good I'm sorry but you're right and it's funny and sad. I wish I could review the recovery process as a whole and give it one star. tbh it barely seems to work for fucking anyone and all they do is treat the symptoms and not the problem. imagine if we treating arachnophobia by forcing you to hold a spider in your hand every day and maybe at the end of the week a therapist asks you if you feel better about it yet. also the spider is venomous. it's real stupid",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ellqar7": [
                {
                    "Parent ID": "t1_elkvn09",
                    "Comment ID": "ellqar7",
                    "Author": "Cashmeresweateryay",
                    "Date Created": "04-23-2019 15:45:55",
                    "Upvotes": -4,
                    "Text": "Exactly. Camping isn’t the same thing as homelessness for the same reason: because it’s a short-term choice. \n\nAnd where do you draw the line, and with what behaviors? Never talk to a member of the opposite gender bc that’s how 100% of affairs begin? \n\nJust let people do their thing. You can’t police what everyone eats.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ellzdcu": [
                [
                    {
                        "Parent ID": "t1_ell00i1",
                        "Comment ID": "ellzdcu",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "04-23-2019 17:27:24",
                        "Upvotes": 5,
                        "Text": "AMEN.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ell05xr": [
                [
                    {
                        "Parent ID": "t1_ell00i1",
                        "Comment ID": "ell05xr",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 11:17:26",
                        "Upvotes": 18,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:42",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ell0urh": [
                        {
                            "Parent ID": "t1_ell05xr",
                            "Comment ID": "ell0urh",
                            "Author": "GenericName72",
                            "Date Created": "04-23-2019 11:24:15",
                            "Upvotes": 35,
                            "Text": "Of course. A diagnosis from a doctor will usually be accurate since they have the diagnostic criteria, but family saying \"omg you're eating at 1200/day, you're anorexic\" isn't a diagnosis. Not everybody on this sub has an eating disorder. It's a support group for disordered thoughts.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elld38r": [
                [
                    {
                        "Parent ID": "t1_ell5bw9",
                        "Comment ID": "elld38r",
                        "Author": "WearyBumblebee",
                        "Date Created": "04-23-2019 13:31:43",
                        "Upvotes": -10,
                        "Text": "lol exactly how many of your friends from college went onto become alcoholics? The behavior isn’t healthy and in some it could develop into a real problem but for the vast majority of people it remains an occasional unhealthy habit. In the case of American drinking culture, for many it remains a “phase” in college \n\nI like ur fertilizer analogy and agree but the topic at hand is diagnosing other people. I don’t think it’s right to see other people with a few of our habits and slam them with a disorder title, acting as if we know them better than they know themselves. i never said they aren’t contributing to an environment that could foster an ED in people with the potential to develop one. I just said we shouldn’t be saying that they have one ourselves. I’ve seen too many girls on YouTube or on twitter have to show pictures of their parents or them as a kid or otherwise explain why they are thin bc people keep harassing them and there are plenty of people that do a juice cleanse bc of Beyoncé or whatever and then just go back to normal.\n\nI’m glad u like my analogy and I like where u ran with it but u definitely misinterpreted a lot of what I was trying to say lmao. You’re reading into things and putting words into my mouth friend",
                        "Edited?": "04-23-2019 13:39:34",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "elldtwz": [
                        {
                            "Parent ID": "t1_elld38r",
                            "Comment ID": "elldtwz",
                            "Author": "PM_ME_YER_SHIBA_INUS",
                            "Date Created": "04-23-2019 13:39:25",
                            "Upvotes": 18,
                            "Text": "> lol exactly how many of your friends from college went onto become alcoholics? \n\nMan, you don't want me to answer that.\n\nThat kinda helps the analogy from this side too. Most people I know who're into fitness don't have EDs (afaik), but out of the people that come clean to me, every single one had that \"fitness stage\". Find me an alcoholic who went to college, and they drank too. Not every bug's an insect, but if you catch a bunch of bugs, you'll get a whole lot of insects. It's hardly \"projection\" to start suspecting that insects that act like bugs may be bugs.",
                            "Edited?": "04-23-2019 13:55:14",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ell15p2": [
                [
                    {
                        "Parent ID": "t1_ell0urh",
                        "Comment ID": "ell15p2",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 11:27:21",
                        "Upvotes": 12,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:40",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellehur": [
                        {
                            "Parent ID": "t1_ell15p2",
                            "Comment ID": "ellehur",
                            "Author": "synedchdochee",
                            "Date Created": "04-23-2019 13:46:21",
                            "Upvotes": 26,
                            "Text": "Yo I'm not a doctor, but seeing some of your posts before, you definitely have some disordered habits / thoughts lmao \"21 BMI is huge on my frame\" yeah... non-disordered people don't think like that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elle0wf": [
                [
                    {
                        "Parent ID": "t1_elldtwz",
                        "Comment ID": "elle0wf",
                        "Author": "WearyBumblebee",
                        "Date Created": "04-23-2019 13:41:24",
                        "Upvotes": -4,
                        "Text": "Ok then I guess we can all just speak from our personal experiences. The analogy made sense to me because none of mine (nor I) did🤷‍♀️.\n\nEdit: ok u added more to ur comment so I’ll respond to that. Yeah once again I’m not disagreeing with you. My point remains that we don’t know enough to be diagnosing other people so we shouldn’t. Just because such behavior indicates a higher potential for whatever disease is in question doesn’t mean we should assume everyone with the behavior has the issue at hand",
                        "Edited?": "04-23-2019 13:45:06",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellfp56": [
                        {
                            "Parent ID": "t1_elle0wf",
                            "Comment ID": "ellfp56",
                            "Author": "PM_ME_YER_SHIBA_INUS",
                            "Date Created": "04-23-2019 13:58:20",
                            "Upvotes": 8,
                            "Text": "> My point remains that we don’t know enough to be diagnosing other people so we shouldn’t.\n\nOh okay, sorry, I thought you were trying to say that it's as dumb to worry about EDs in fitness culture circles as it would be to worry about alcoholism on college campuses.\n\nI was just like **wait no, PLEASE worry about budding alcoholism on college campuses!!**, and then I just kinda kept thinking about the analogy.\n\n> My point remains that we don’t know enough to be diagnosing other people so we shouldn’t.\n\nI complete agree with this in general tbh, and really like seeing subreddits that have \"we can't diagnose you\" in the sidebar to discourage it. It's one thing to worry about someone, but it's a whole other thing to diagnose people from across a keyboard. That's just invasive even if the diagnosis is right, let alone if it's wrong.\n\nMost people online aren't even qualified to diagnose illnesses in the first place. God knows some doctors shouldn't be either, but at least they have access to more info about the full story.\n\nThanks for clarifying! And yeah, oops, I usually end up editing posts a lot and just kinda...hope the other person doesn't check their notifications too fast.",
                            "Edited?": "04-23-2019 14:27:34",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elleod1": [
                [
                    {
                        "Parent ID": "t1_ellehur",
                        "Comment ID": "elleod1",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 13:48:07",
                        "Upvotes": -14,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:28",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellmcu5": [
                        {
                            "Parent ID": "t1_elleod1",
                            "Comment ID": "ellmcu5",
                            "Author": "smittenkitt3n",
                            "Date Created": "04-23-2019 15:06:12",
                            "Upvotes": 16,
                            "Text": "a 20 BMI is **not** “fat”. if you think it is, then what bmi is good enough? 18.5-19.5? is it even reasonable to think that people can only be “healthy” in that tiny bmi range???? \n\nit’s fine to think you look better at a lower weight. that’s just an opinion. but to think you look shitty and wanting to restrict, even at a healthy weight, and “mourning” your skinny body *is* disordered. (checked your post history) people get diagnosed with eating disorders because of the way they *think* and *act* about/around food.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ellg9wr": [
                        {
                            "Parent ID": "t1_elleod1",
                            "Comment ID": "ellg9wr",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:04:13",
                            "Upvotes": 5,
                            "Text": "im just gonna say im with you on this one. obvi being 'big boned' isnt real but some people have smaller or larger frames. im short already but my frame is so small that my own family was telling me to go to the gym when i hit a bmi of 21.  sure it was objectively still healthy, but i wasnt working out or anything so it just looked bad on me. maybe if that was a bmi of 21 but with mostly muscles, it would look good. anyways, i get it it isnt disordered to think you dont look good at a healthy weight. bmi 24 is healthy but its on the high end, most people probably look a bit thick on that end even though its healthy anyways",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellmgqd": [
                [
                    {
                        "Parent ID": "t1_ellmcu5",
                        "Comment ID": "ellmgqd",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 15:07:19",
                        "Upvotes": -12,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:19",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellnp2c": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "ellnp2c",
                            "Author": "smittenkitt3n",
                            "Date Created": "04-23-2019 15:19:48",
                            "Upvotes": 24,
                            "Text": "what the fuck lol\n\ni’m 5’4 and looked great at 125 lbs....\n\nthere’s nothinf wrong with weighing 110 lbs at that height, bc it’s still at a healthy weight, but if you think you look **disgusting** at 125 pounds, then you’re disordered as fuck and in denial\n\nedit: eating 2-3 times a day + snacking is NORMAL! and you enjoy food? wow how dare you enjoy doing something that normal humans like and have built cultures around.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ellmofp": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "ellmofp",
                            "Author": "synedchdochee",
                            "Date Created": "04-23-2019 15:09:31",
                            "Upvotes": 18,
                            "Text": "(you think this way because you have an eating disorder)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "elm3wzc": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "elm3wzc",
                            "Author": "molotov-cocktail",
                            "Date Created": "04-23-2019 18:22:57",
                            "Upvotes": 7,
                            "Text": "how can you see certain habits or a demeanours as fat without a level of disordered thinking? fat is the storage of excess energy on your body. it isn't a personality trait or set of behaviours.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellssp9": [
                [
                    {
                        "Parent ID": "t1_ellg9wr",
                        "Comment ID": "ellssp9",
                        "Author": "oenone_",
                        "Date Created": "04-23-2019 16:12:30",
                        "Upvotes": 2,
                        "Text": "Wow this has made things click for me! It sounds dumb, but I always thought that having a small frame would be an advantage, but then not understand why I looked so fat at the high end of a healthy weight when bigger boned friends looked slimmer at the same or even a higher weight. Of course, height is a factor too, and at 5'1 I really do feel I've lost the genetic lottery... it's like I only look good when my weight is at the low end of healthy. Otherwise I literally look a bit chubby even right in the middle of a healthy weight.\n\n\nEdit: a small frame other than my childbearing hips and big knees. What's especially disappointing is that my big hips can make people think I'm thicc... then I turn to the side and have no butt and it's like nvm, just cursed with somehow looking too fat and too skinny at the same time.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "elm6brl": [
                        {
                            "Parent ID": "t1_ellssp9",
                            "Comment ID": "elm6brl",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 18:51:59",
                            "Upvotes": 1,
                            "Text": "im also pear shaped and 5'3, so i feel your pain. i know its not an exact science but ever since they included the [IBW](http://www.nafwa.org/hamwi.php) calculation on justcico.com, ive felt fully justified in knowing im *supposed* to be near underweight with my frame. I seriously look normal at their small frame estimate for my height and its what i feel comfortable around",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellghbo": [
                [
                    {
                        "Parent ID": "t1_ellg9wr",
                        "Comment ID": "ellghbo",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 14:06:21",
                        "Upvotes": -8,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:25",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellgp70": [
                        {
                            "Parent ID": "t1_ellghbo",
                            "Comment ID": "ellgp70",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:08:36",
                            "Upvotes": -8,
                            "Text": "im 100% with you. if people didnt get so salty about losing weight and didnt spread so many misconceptions and fatlogic everywhere, i probably couldve just lost to a healthy weight and been mentally fine. but even restricting to 1200 cals i have to hide it from my family or theyll flip. cause they dont understand basic healthy eating. it sucks",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellmvn5": [
                [
                    {
                        "Parent ID": "t1_ellmofp",
                        "Comment ID": "ellmvn5",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 15:11:34",
                        "Upvotes": -11,
                        "Text": "[deleted]",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellthsg": [
                        {
                            "Parent ID": "t1_ellmvn5",
                            "Comment ID": "ellthsg",
                            "Author": "PhoneWalletSanity",
                            "Date Created": "04-23-2019 16:20:03",
                            "Upvotes": 3,
                            "Text": "You are if you think people can only be healthy in a tiny, low BMI range. A BMI of 21 is not chunky and it's toxic to both yourself and others to say so. Eating and enjoying food is *healthy* and eating sugar and \"junk\" food is also *healthy* in *moderation*.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellgv8q": [
                [
                    {
                        "Parent ID": "t1_ellgp70",
                        "Comment ID": "ellgv8q",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 14:10:18",
                        "Upvotes": -6,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:24",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellj35m": [
                        {
                            "Parent ID": "t1_ellgv8q",
                            "Comment ID": "ellj35m",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:33:34",
                            "Upvotes": -10,
                            "Text": "lmaaoo good I'm sorry but you're right and it's funny and sad. I wish I could review the recovery process as a whole and give it one star. tbh it barely seems to work for fucking anyone and all they do is treat the symptoms and not the problem. imagine if we treating arachnophobia by forcing you to hold a spider in your hand every day and maybe at the end of the week a therapist asks you if you feel better about it yet. also the spider is venomous. it's real stupid",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ellqjk5": [
                {
                    "Parent ID": "t1_elkvn09",
                    "Comment ID": "ellqjk5",
                    "Author": "Cashmeresweateryay",
                    "Date Created": "04-23-2019 15:48:26",
                    "Upvotes": -6,
                    "Text": "Exactly. And people who go camping would be “dabbling in homelessness.” Lol. \n\nAnd where do you draw the line, and with what behaviors? Never talk to a member of the opposite gender (or whoever you’re into) bc that’s how 100% of affairs begin? \n\nJust let people do their thing. You can’t police what everyone eats.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ellzdcu": [
                [
                    {
                        "Parent ID": "t1_ell00i1",
                        "Comment ID": "ellzdcu",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "04-23-2019 17:27:24",
                        "Upvotes": 5,
                        "Text": "AMEN.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ell05xr": [
                [
                    {
                        "Parent ID": "t1_ell00i1",
                        "Comment ID": "ell05xr",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 11:17:26",
                        "Upvotes": 18,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:42",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ell0urh": [
                        {
                            "Parent ID": "t1_ell05xr",
                            "Comment ID": "ell0urh",
                            "Author": "GenericName72",
                            "Date Created": "04-23-2019 11:24:15",
                            "Upvotes": 35,
                            "Text": "Of course. A diagnosis from a doctor will usually be accurate since they have the diagnostic criteria, but family saying \"omg you're eating at 1200/day, you're anorexic\" isn't a diagnosis. Not everybody on this sub has an eating disorder. It's a support group for disordered thoughts.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elld38r": [
                [
                    {
                        "Parent ID": "t1_ell5bw9",
                        "Comment ID": "elld38r",
                        "Author": "WearyBumblebee",
                        "Date Created": "04-23-2019 13:31:43",
                        "Upvotes": -10,
                        "Text": "lol exactly how many of your friends from college went onto become alcoholics? The behavior isn’t healthy and in some it could develop into a real problem but for the vast majority of people it remains an occasional unhealthy habit. In the case of American drinking culture, for many it remains a “phase” in college \n\nI like ur fertilizer analogy and agree but the topic at hand is diagnosing other people. I don’t think it’s right to see other people with a few of our habits and slam them with a disorder title, acting as if we know them better than they know themselves. i never said they aren’t contributing to an environment that could foster an ED in people with the potential to develop one. I just said we shouldn’t be saying that they have one ourselves. I’ve seen too many girls on YouTube or on twitter have to show pictures of their parents or them as a kid or otherwise explain why they are thin bc people keep harassing them and there are plenty of people that do a juice cleanse bc of Beyoncé or whatever and then just go back to normal.\n\nI’m glad u like my analogy and I like where u ran with it but u definitely misinterpreted a lot of what I was trying to say lmao. You’re reading into things and putting words into my mouth friend",
                        "Edited?": "04-23-2019 13:39:34",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "elldtwz": [
                        {
                            "Parent ID": "t1_elld38r",
                            "Comment ID": "elldtwz",
                            "Author": "PM_ME_YER_SHIBA_INUS",
                            "Date Created": "04-23-2019 13:39:25",
                            "Upvotes": 18,
                            "Text": "> lol exactly how many of your friends from college went onto become alcoholics? \n\nMan, you don't want me to answer that.\n\nThat kinda helps the analogy from this side too. Most people I know who're into fitness don't have EDs (afaik), but out of the people that come clean to me, every single one had that \"fitness stage\". Find me an alcoholic who went to college, and they drank too. Not every bug's an insect, but if you catch a bunch of bugs, you'll get a whole lot of insects. It's hardly \"projection\" to start suspecting that insects that act like bugs may be bugs.",
                            "Edited?": "04-23-2019 13:55:14",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ell15p2": [
                [
                    {
                        "Parent ID": "t1_ell0urh",
                        "Comment ID": "ell15p2",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 11:27:21",
                        "Upvotes": 12,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:40",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellehur": [
                        {
                            "Parent ID": "t1_ell15p2",
                            "Comment ID": "ellehur",
                            "Author": "synedchdochee",
                            "Date Created": "04-23-2019 13:46:21",
                            "Upvotes": 26,
                            "Text": "Yo I'm not a doctor, but seeing some of your posts before, you definitely have some disordered habits / thoughts lmao \"21 BMI is huge on my frame\" yeah... non-disordered people don't think like that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elle0wf": [
                [
                    {
                        "Parent ID": "t1_elldtwz",
                        "Comment ID": "elle0wf",
                        "Author": "WearyBumblebee",
                        "Date Created": "04-23-2019 13:41:24",
                        "Upvotes": -4,
                        "Text": "Ok then I guess we can all just speak from our personal experiences. The analogy made sense to me because none of mine (nor I) did🤷‍♀️.\n\nEdit: ok u added more to ur comment so I’ll respond to that. Yeah once again I’m not disagreeing with you. My point remains that we don’t know enough to be diagnosing other people so we shouldn’t. Just because such behavior indicates a higher potential for whatever disease is in question doesn’t mean we should assume everyone with the behavior has the issue at hand",
                        "Edited?": "04-23-2019 13:45:06",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellfp56": [
                        {
                            "Parent ID": "t1_elle0wf",
                            "Comment ID": "ellfp56",
                            "Author": "PM_ME_YER_SHIBA_INUS",
                            "Date Created": "04-23-2019 13:58:20",
                            "Upvotes": 8,
                            "Text": "> My point remains that we don’t know enough to be diagnosing other people so we shouldn’t.\n\nOh okay, sorry, I thought you were trying to say that it's as dumb to worry about EDs in fitness culture circles as it would be to worry about alcoholism on college campuses.\n\nI was just like **wait no, PLEASE worry about budding alcoholism on college campuses!!**, and then I just kinda kept thinking about the analogy.\n\n> My point remains that we don’t know enough to be diagnosing other people so we shouldn’t.\n\nI complete agree with this in general tbh, and really like seeing subreddits that have \"we can't diagnose you\" in the sidebar to discourage it. It's one thing to worry about someone, but it's a whole other thing to diagnose people from across a keyboard. That's just invasive even if the diagnosis is right, let alone if it's wrong.\n\nMost people online aren't even qualified to diagnose illnesses in the first place. God knows some doctors shouldn't be either, but at least they have access to more info about the full story.\n\nThanks for clarifying! And yeah, oops, I usually end up editing posts a lot and just kinda...hope the other person doesn't check their notifications too fast.",
                            "Edited?": "04-23-2019 14:27:34",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "elleod1": [
                [
                    {
                        "Parent ID": "t1_ellehur",
                        "Comment ID": "elleod1",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 13:48:07",
                        "Upvotes": -14,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:28",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellmcu5": [
                        {
                            "Parent ID": "t1_elleod1",
                            "Comment ID": "ellmcu5",
                            "Author": "smittenkitt3n",
                            "Date Created": "04-23-2019 15:06:12",
                            "Upvotes": 16,
                            "Text": "a 20 BMI is **not** “fat”. if you think it is, then what bmi is good enough? 18.5-19.5? is it even reasonable to think that people can only be “healthy” in that tiny bmi range???? \n\nit’s fine to think you look better at a lower weight. that’s just an opinion. but to think you look shitty and wanting to restrict, even at a healthy weight, and “mourning” your skinny body *is* disordered. (checked your post history) people get diagnosed with eating disorders because of the way they *think* and *act* about/around food.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ellg9wr": [
                        {
                            "Parent ID": "t1_elleod1",
                            "Comment ID": "ellg9wr",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:04:13",
                            "Upvotes": 5,
                            "Text": "im just gonna say im with you on this one. obvi being 'big boned' isnt real but some people have smaller or larger frames. im short already but my frame is so small that my own family was telling me to go to the gym when i hit a bmi of 21.  sure it was objectively still healthy, but i wasnt working out or anything so it just looked bad on me. maybe if that was a bmi of 21 but with mostly muscles, it would look good. anyways, i get it it isnt disordered to think you dont look good at a healthy weight. bmi 24 is healthy but its on the high end, most people probably look a bit thick on that end even though its healthy anyways",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellmgqd": [
                [
                    {
                        "Parent ID": "t1_ellmcu5",
                        "Comment ID": "ellmgqd",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 15:07:19",
                        "Upvotes": -12,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:19",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellnp2c": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "ellnp2c",
                            "Author": "smittenkitt3n",
                            "Date Created": "04-23-2019 15:19:48",
                            "Upvotes": 24,
                            "Text": "what the fuck lol\n\ni’m 5’4 and looked great at 125 lbs....\n\nthere’s nothinf wrong with weighing 110 lbs at that height, bc it’s still at a healthy weight, but if you think you look **disgusting** at 125 pounds, then you’re disordered as fuck and in denial\n\nedit: eating 2-3 times a day + snacking is NORMAL! and you enjoy food? wow how dare you enjoy doing something that normal humans like and have built cultures around.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "ellmofp": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "ellmofp",
                            "Author": "synedchdochee",
                            "Date Created": "04-23-2019 15:09:31",
                            "Upvotes": 18,
                            "Text": "(you think this way because you have an eating disorder)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "elm3wzc": [
                        {
                            "Parent ID": "t1_ellmgqd",
                            "Comment ID": "elm3wzc",
                            "Author": "molotov-cocktail",
                            "Date Created": "04-23-2019 18:22:57",
                            "Upvotes": 7,
                            "Text": "how can you see certain habits or a demeanours as fat without a level of disordered thinking? fat is the storage of excess energy on your body. it isn't a personality trait or set of behaviours.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellssp9": [
                [
                    {
                        "Parent ID": "t1_ellg9wr",
                        "Comment ID": "ellssp9",
                        "Author": "oenone_",
                        "Date Created": "04-23-2019 16:12:30",
                        "Upvotes": 2,
                        "Text": "Wow this has made things click for me! It sounds dumb, but I always thought that having a small frame would be an advantage, but then not understand why I looked so fat at the high end of a healthy weight when bigger boned friends looked slimmer at the same or even a higher weight. Of course, height is a factor too, and at 5'1 I really do feel I've lost the genetic lottery... it's like I only look good when my weight is at the low end of healthy. Otherwise I literally look a bit chubby even right in the middle of a healthy weight.\n\n\nEdit: a small frame other than my childbearing hips and big knees. What's especially disappointing is that my big hips can make people think I'm thicc... then I turn to the side and have no butt and it's like nvm, just cursed with somehow looking too fat and too skinny at the same time.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "elm6brl": [
                        {
                            "Parent ID": "t1_ellssp9",
                            "Comment ID": "elm6brl",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 18:51:59",
                            "Upvotes": 1,
                            "Text": "im also pear shaped and 5'3, so i feel your pain. i know its not an exact science but ever since they included the [IBW](http://www.nafwa.org/hamwi.php) calculation on justcico.com, ive felt fully justified in knowing im *supposed* to be near underweight with my frame. I seriously look normal at their small frame estimate for my height and its what i feel comfortable around",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellghbo": [
                [
                    {
                        "Parent ID": "t1_ellg9wr",
                        "Comment ID": "ellghbo",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 14:06:21",
                        "Upvotes": -8,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:25",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellgp70": [
                        {
                            "Parent ID": "t1_ellghbo",
                            "Comment ID": "ellgp70",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:08:36",
                            "Upvotes": -8,
                            "Text": "im 100% with you. if people didnt get so salty about losing weight and didnt spread so many misconceptions and fatlogic everywhere, i probably couldve just lost to a healthy weight and been mentally fine. but even restricting to 1200 cals i have to hide it from my family or theyll flip. cause they dont understand basic healthy eating. it sucks",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellmvn5": [
                [
                    {
                        "Parent ID": "t1_ellmofp",
                        "Comment ID": "ellmvn5",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 15:11:34",
                        "Upvotes": -11,
                        "Text": "[deleted]",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellthsg": [
                        {
                            "Parent ID": "t1_ellmvn5",
                            "Comment ID": "ellthsg",
                            "Author": "PhoneWalletSanity",
                            "Date Created": "04-23-2019 16:20:03",
                            "Upvotes": 3,
                            "Text": "You are if you think people can only be healthy in a tiny, low BMI range. A BMI of 21 is not chunky and it's toxic to both yourself and others to say so. Eating and enjoying food is *healthy* and eating sugar and \"junk\" food is also *healthy* in *moderation*.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ellgv8q": [
                [
                    {
                        "Parent ID": "t1_ellgp70",
                        "Comment ID": "ellgv8q",
                        "Author": "[deleted]",
                        "Date Created": "04-23-2019 14:10:18",
                        "Upvotes": -6,
                        "Text": "[deleted]",
                        "Edited?": "05-23-2019 10:24:24",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ellj35m": [
                        {
                            "Parent ID": "t1_ellgv8q",
                            "Comment ID": "ellj35m",
                            "Author": "ifuckpineapples",
                            "Date Created": "04-23-2019 14:33:34",
                            "Upvotes": -10,
                            "Text": "lmaaoo good I'm sorry but you're right and it's funny and sad. I wish I could review the recovery process as a whole and give it one star. tbh it barely seems to work for fucking anyone and all they do is treat the symptoms and not the problem. imagine if we treating arachnophobia by forcing you to hold a spider in your hand every day and maybe at the end of the week a therapist asks you if you feel better about it yet. also the spider is venomous. it's real stupid",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "elnc04e": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "elnc04e",
                "Author": "miamyamae",
                "Date Created": "04-24-2019 06:28:49",
                "Upvotes": 1,
                "Text": "I hate how the media is focused on “exposing” celebrities with eating disorders. It’s an illness and not like they committed a crime or anything ? It’s like saying “celebrity name is EXPOSED for having celiac disease !1!1!11!1!”... it just sounds strange and aggressive",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "elmdcdt": [
        [
            {
                "Parent ID": "t3_bghb76",
                "Comment ID": "elmdcdt",
                "Author": "Rickticia",
                "Date Created": "04-23-2019 20:15:55",
                "Upvotes": 0,
                "Text": "I’m so glad you said this. I’m so tired of the posts subtly not subtly trying to shade other subs, especially the 1200 sub. Like damn, I’d hate for them to come in here and talk shit, yet that’s what many of us do. I’ve already mentioned that it makes us come off as judgmental, petty, and almost jealous, and there’s no need to witch hunt everything that reminds us of our disorders.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}