{
    "fa4g11w": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa4g11w",
                "Author": "0applecrumble",
                "Date Created": "12-08-2019 05:26:17",
                "Upvotes": 416,
                "Text": "I hope he’s about to be your ex boyfriend.\n\nOP I’m so sorry. I know I’m making a judgement on only a small amount of information, but he doesn’t sound like a supportive OR helpful person to have around.\n\nHave you had a chat to him about your eating disorder before and explained to him what kind of comments are unhelpful?",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa4qqu7": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa4qqu7",
                "Author": "spicychicknnugget",
                "Date Created": "12-08-2019 06:16:04",
                "Upvotes": 241,
                "Text": "OK so this is not OK. At all. Your bf shouldn't be saying that bulimia isn't the worst to deal with. He should be concerned that he is triggering/encouraging behavior that is harmful to yourself.\n\n\nWhen I told my Bf he was concerned. When I accidentally make ed jokes to him without thinking he's concerned. When I actively am debating foods or am triggered over something he's concerned. Literally the only OK response to your talking to him should be concerned.\n\n\nDon't fuck with someone who is fucking with you.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fa5bmfl": [
                {
                    "Parent ID": "t1_fa4qqu7",
                    "Comment ID": "fa5bmfl",
                    "Author": "galacticshock",
                    "Date Created": "12-08-2019 08:00:02",
                    "Upvotes": 49,
                    "Text": "Seconding this. \nMy boyfriend has nothing but concern. He understands how much these diseases rot my brain and my logic. When he knows I’m restricting or body checking too much, he hides the scales and lets me have them once every three days. \n\nHe knows nothing about this disease but he knows I and my mind need support to get rid of the illogical infection. \n\nOP, I’m so sorry your bf has said this. You are absolutely right to feel so hurt. He said something hurtful.  We are just internet strangers, it’s difficult for us to fully assess your relationship, only you can do that. \n\nIf this was my relationship (which is pretty solid after a few years) I’d be having a discussion to ask him his understanding of this disease. That it’s of the mind, not just the food, and how his words played into that as well as were just hurtful body shaming comments that I don’t agree with.  If he loves me and supports me then that includes my mind when it is sick and my body when it changes. \n\nIf you can’t even have that conversation or something like it, it sounds like you are walking on eggshells. That is a red flag, so figure out a plan to love yourself.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "fa4rj2m": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa4rj2m",
                "Author": "hammerprice",
                "Date Created": "12-08-2019 06:21:16",
                "Upvotes": 198,
                "Text": ">he also said that “bulimia is not the worst thing to deal with”. \n\nHUH????????\n\nHe NEEDS to be GONE. These two comments together are EXTREMELY worrying for me. Was this something he'd said already at some other time, or did he say this in response to you trying to talk to him just now!? Either way, having a boyfriend who tells you that any eating disorder isn't really a big deal (which is already bad) and THEN goes on to make disparaging comments about how your body looks is a BIG! RED! FLAG!\n\nSpeaking of red flags, this:\n\n>promise \\[you\\] won’t take it personally \n\n... is like Manipulation 101. I'm not saying your boyfriend is definitely manipulating you, or abusive, but this train of \"logic\" - telling you something upsetting, but also making you promise you won't get upset, so that they can basically insult you without repercussions and chip away at your self-esteem or make you look irrational/unfair if you DO get upset by the upsetting thing they said - is certainly a tactic used by many abusive partners. It's often them \"testing the waters\", so to speak. If you let them get away with brazenly insulting you and undermining you to your face simply because they told you that you had to, then they'll know they can get away with more in the future. Soon, they won't even make you promise not to get upset before they insult you, they'll just insult you, because they already know you won't get upset.\n\nAgain. Not saying your bf is 100% for-sure trying intentionally to manipulate you this way because that gets thrown around a lot on this website. But it is a red flag and you shouldn't have to put up with someone who makes you feel like this.\n\nAlso I bet you look amazing in crop tops, just saying.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fa5qped": [
                {
                    "Parent ID": "t1_fa4rj2m",
                    "Comment ID": "fa5qped",
                    "Author": "p0m0sapien",
                    "Date Created": "12-08-2019 09:05:49",
                    "Upvotes": 35,
                    "Text": "This is so well said. \n\nAlarm bells ringing so loud because the abusive control is only going to get worse. I dont know you or your relationship but i cannot conceive of any reality where this isn't him testing the waters to see how far he can fuck with you. You desreve better.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "fa5qqye": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5qqye",
                "Author": "xianwolf",
                "Date Created": "12-08-2019 09:06:02",
                "Upvotes": 65,
                "Text": "Throw the whole man away.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fa6mass": [
                {
                    "Parent ID": "t1_fa5qqye",
                    "Comment ID": "fa6mass",
                    "Author": "xP628sLh",
                    "Date Created": "12-08-2019 11:28:16",
                    "Upvotes": 19,
                    "Text": "This whole comments section votes to throw him in the dumpster. OP HE’S TOXIC WASTE.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "fa5ab5m": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5ab5m",
                "Author": "[deleted]",
                "Date Created": "12-08-2019 07:52:15",
                "Upvotes": 72,
                "Text": "I won't thread with caution like other comments did: your boyfriend is trying to manipulate you into getting to look like what he feels is skinny enough despite knowing you have an ED. And he thinks he's being slick too by posing it \"sweetly\". This is ED-chaser trash tier behaviour. Dump him immediately",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5bxol": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5bxol",
                "Author": "fruit2go10",
                "Date Created": "12-08-2019 08:01:35",
                "Upvotes": 25,
                "Text": "Nah that’s some genuinely unhealthy shit that will only progress into something worse later on. No ones boyfriend should EVER say that let alone THINK that....the fact that he’s fixated on such an insignificant part of you is sad and if I were you, I would give him a serious talk after this and completely leave him if ever another comment.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa619cn": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa619cn",
                "Author": "frostfromfire",
                "Date Created": "12-08-2019 09:46:47",
                "Upvotes": 27,
                "Text": "The comment about your clothes could’ve been rude but harmless (there are certain clothes that I know don’t look great with my body shape and my husband agrees with me when I choose not to wear a style) but that other comment?  Saying that having an ED is not a problem and tying it into how you look and dress?  **Fuck that.** Your BF is deliberately trying to get you to relapse.  Think long and hard about whether you want those kinds of comments flying at you more and more often as time goes on.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5ni5z": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5ni5z",
                "Author": "raccoonliner",
                "Date Created": "12-08-2019 08:51:22",
                "Upvotes": 23,
                "Text": "i personally believe that you need to break up with him. he didn’t take your very serious (and deadly) problem seriously and it’s not his place to tell you not to wear something especially for a bs reason like it’s “unflattering.” and if you are uncomfortable having sex with him, don’t force yourself to. it will only make you feel more uncomfortable. he should be making you feel beautiful and help ease your body dysmorphia, and from the sounds of it he’s just making it worse. \ni’m so sorry he said this to you and you deserve so much better. i hope that you’re able to stay strong,",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5qhio": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5qhio",
                "Author": "coloraturing",
                "Date Created": "12-08-2019 09:04:45",
                "Upvotes": 20,
                "Text": "I’ll just leave [this](https://m.youtube.com/watch?v=r8kiYkjbGew) here. I’m sorry you had to deal with that bullshit. Whatever the reason behind it, you shouldn’t have to  hear anything like that, ever. You are beautiful and important.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fa6v99c": [
                {
                    "Parent ID": "t1_fa5qhio",
                    "Comment ID": "fa6v99c",
                    "Author": "61114311536123511",
                    "Date Created": "12-08-2019 12:14:12",
                    "Upvotes": 6,
                    "Text": "Fucking iconic video",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "fa5ylpy": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5ylpy",
                "Author": "[deleted]",
                "Date Created": "12-08-2019 09:37:05",
                "Upvotes": 18,
                "Text": "I'm really sorry. But your boyfriend is trying to get you to relapse so you fit his unreachable 'skinny' image. The way he looks at bulimia proves it. Don't fall for it, break up with him, put yourself first and rock those crop tops because you DO look good in those and fuck what he thinks.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5d3d5": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5d3d5",
                "Author": "lunarspice",
                "Date Created": "12-08-2019 08:06:09",
                "Upvotes": 19,
                "Text": "I just... have no idea how some of you all stay with men like this, how horrible :(( I personally would yeet anyone who ever said something like that to me out of my life before they knew what was happening, obviously it’s up to you and I know it’s not that simple but I’d be shocked if this was the first time he’s said something like that, and you do have to consider whether a relationship is something that benefits you, or if it’s unhealthy and tearing you down. Regardless, I’m super sorry you had to deal with that :(",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fa5ugmh": [
                {
                    "Parent ID": "t1_fa5d3d5",
                    "Comment ID": "fa5ugmh",
                    "Author": "p0m0sapien",
                    "Date Created": "12-08-2019 09:20:17",
                    "Upvotes": 28,
                    "Text": "Just jumping in to say: It comes on slow and by the time they tip their hand we've had our sense of self thoroughly erroded and made emotional and quite often financial commitments. It's not like I offered myself up to my abuser and I utterly despised them for at least 2 years before I could escape. It's just a long slow process in a lot of cases. Looking back, I have no idea why I missed the early warning signs but somehow I got myself trapped.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "fa5we3f": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5we3f",
                "Author": "beautifulchaos22",
                "Date Created": "12-08-2019 09:27:39",
                "Upvotes": 13,
                "Text": "The only thing that's unflattering is his fucking attitude. I'm so sorry, OP. It's scary how a completely unsolicited, inappropriate comment can do so much damage. \n\nIt's tempting for me to say to just dump him and all that, but I know that relationships are so complex, and even though something might be a deal-breaker, there are so many feelings and emotions flying around. \n\nI just wanted to say that I'm in your corner, even though I don't know you. \n\n&#x200B;\n\nIt can hurt like a ton of bricks to the head when someone you love and care about says things that go against your image of who they are. \n\n&#x200B;\n\nYou know what I can see, just from your post? Someone who realizes they are in a tough situation, and that ED symptoms/behaviours might get stronger, but you RECOGNIZE THAT. You have the self-awareness to realize that you're having trouble because of this unfortunate conversation with your partner. Being aware, even if you still find yourself struggling with the ED behaviours, is HUUUGE, especially in an emotionally charged situation. \n\n&#x200B;\n\nI hope you're able to find someone close and trusting to talk to, but thank you for your strength to share here. \n\n&#x200B;\n\nI'm sending you lots of support, and I'm always available to chat.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6620o": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6620o",
                "Author": "nikolas-heck",
                "Date Created": "12-08-2019 10:09:03",
                "Upvotes": 12,
                "Text": "op I say this with as much kindness as possible but throw the whole boyfriend away. commenting negatively on your body is not something he or anyone should do, and discounting bulimia as being not that bad is too. I hope you're okay ♥️",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5kz39": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5kz39",
                "Author": "jamesjoycethecat",
                "Date Created": "12-08-2019 08:39:25",
                "Upvotes": 10,
                "Text": "DTMF. You deserve so much better than this.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5qvvx": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5qvvx",
                "Author": "ninecher",
                "Date Created": "12-08-2019 09:06:38",
                "Upvotes": 11,
                "Text": "He sounds like a douchebag. Sorry for making judgment but those comments are not supportive at all. And \"Bulimia is not the worst thing to deal with\"? Yikes.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6qm5g": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6qm5g",
                "Author": "scarlettbutlerO",
                "Date Created": "12-08-2019 11:52:19",
                "Upvotes": 4,
                "Text": "Dump",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6aw67": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6aw67",
                "Author": "oooortcloud",
                "Date Created": "12-08-2019 10:33:46",
                "Upvotes": 8,
                "Text": "At best, he’s a vacant, selfish, shallow man child with no grasp on the impact his actions can have; at worst, he is an emotionally abusive predator who is grooming you into being his next victim by whittling away at your self-esteem while making you promise not to hate him for it. Run away from this man, and any man who makes you feel that bad with no remorse.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa66ib5": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa66ib5",
                "Author": "sowachowski",
                "Date Created": "12-08-2019 10:12:42",
                "Upvotes": 7,
                "Text": "As someone who has been there: LEAVE. HIM. You don’t need that in your life and taking up space in your heart. It will hurt and I’m sorry it will hurt but you need to separate yourself from him so that you can heal.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6zdwp": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6zdwp",
                "Author": "3flowerchilde",
                "Date Created": "12-08-2019 12:32:46",
                "Upvotes": 3,
                "Text": "Dump his ass! \"Bulimia is not the worst thing to deal with,\" obviously he doesn't understand what you went through and doesn't want to understand. I get why it can be hard to break up with someone you've been with for over a year, but he is most definitely not worth it if he's saying things like that to you. \n\nOf course I don't know anything else about your relationship, however, if he knows that ED was apart, or still is apart of your life, then he should know better, as someone close to you what is triggering and offensive.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa66xwr": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa66xwr",
                "Author": "flamingtrashmonster",
                "Date Created": "12-08-2019 10:14:39",
                "Upvotes": 9,
                "Text": "What he said is absolutely awful and unacceptable. How else does he treat you? While not a super long time, a year is a significant amount of time to be with a person and get to know them. Do you think he’s just ignorant, or could there be something else going on? \n\nIf you think he’s ignorant but would be willing to hear you out, I would suggest having a very long and open talk with him about the unacceptable ways he treats you. If that’s unsuccessful, I’d either take it further and see a couples therapist, if he seems willing and sorry but genuinely having a difficult time understanding my point of view, or I’d break up with him.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa698wu": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa698wu",
                "Author": "imaginativeintellect",
                "Date Created": "12-08-2019 10:25:26",
                "Upvotes": 5,
                "Text": "Do not stay with him. I’m telling you now, I stayed after my first boyfriend said I was “embarrassing” and fat (he explicitly said this) and he triggered the ED I’ve been struggling with for years now. He egged me on to fast for days at a time, to completely stop eating for weeks. He encouraged it even as I passed out and was in generally awful health. Do not stay with him, I regret ever staying another second with the asshole who called me fat. More nightmares were in our future and he would get more and more abusive as time went on.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa69xc7": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa69xc7",
                "Author": "anteater_ghost",
                "Date Created": "12-08-2019 10:29:56",
                "Upvotes": 4,
                "Text": "Not to be overdramatic but he’s a little bitch & doesn’t deserve you",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6gfca": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6gfca",
                "Author": "novakayne96",
                "Date Created": "12-08-2019 11:00:57",
                "Upvotes": 6,
                "Text": "Okay cool, cool, cool. You're about to drop a bunch of weight. By dropping his ass. He knew he shouldn't have said and he said it anyway. He doesn't take a mental illness seriously, and sis,bro, he sounds like a fucking dick.  There are people out there who will think the sun shines out of your ass. Don't settle for this fucking man child.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6h9j1": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6h9j1",
                "Author": "Marianne22222",
                "Date Created": "12-08-2019 11:04:10",
                "Upvotes": 6,
                "Text": "Dump his ass",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5v1hl": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5v1hl",
                "Author": "pokeupokeu",
                "Date Created": "12-08-2019 09:22:21",
                "Upvotes": 9,
                "Text": "I was going to recommend talking it over with bim but then i saw you did and it still went poorly which is very upsetting. This is pretth concerning since he doesnt seem to understand if you say something that upsets someone it does t matter how you meant it you upset them therefore you should apologize for your actions hurting them. And if you dk r understand why this is a time for a conversation and it seems like he doesnt get it. Id keep your eyes peeled for similar behavior in the futurr",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6nqyd": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6nqyd",
                "Author": "crazyauntkanye",
                "Date Created": "12-08-2019 11:36:40",
                "Upvotes": 3,
                "Text": "You can lose weight by cutting him out of your life. He’s a shit human by thinking it was okay to tell you that. Who cares if he thinks crop tops are unflattering if you enjoy wearing them?! \n\nWowww I’m so angry for you. You deserve someone who doesn’t care what you look like and cares more about how you feel and what you do to make the world a better place.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6xjj9": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6xjj9",
                "Author": "FeatherWorld",
                "Date Created": "12-08-2019 12:25:27",
                "Upvotes": 3,
                "Text": "He doesn't care about your eating disorder and you having a healthy mind and self image. He just wants to get his dick wet and wants arm candy regardless of how low self esteem you get from his comments. It's all about how others perceive you and his image, not your feelings and need to be desired. And commenting on your eating disorder like that shows how selfish and superficial he is. He doesn't deserve you nor does he have much concern about your well being and your daily struggles. My SO is always concerned and even when I gain weight he tells me that I am beautiful and smiles when I wear anything. I'm not even skinny yet, but he always finds something to compliment. Your boyfriend is a huge asshole that takes you for granted and just expects that you will stick around. He is testing the waters to see how much cruely and bullying you will take. How much manipulation. Please see your self worth. You have gone through so much struggle and deserve to find someone truly respectful and nurturing. <3",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa7tbp4": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa7tbp4",
                "Author": "_vindication",
                "Date Created": "12-08-2019 14:45:42",
                "Upvotes": 3,
                "Text": "This is your chance. This is the sign. This is it. Dont waste any more time. Please. Hes showing you. You know. I know you know. Please. You are worth more. You ARE worth more.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa82mk7": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa82mk7",
                "Author": "xopaulajay",
                "Date Created": "12-08-2019 15:28:24",
                "Upvotes": 3,
                "Text": "Dump him. \n\nThere are women bigger than you who put up with less. Remember that.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5y4hs": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5y4hs",
                "Author": "fullerleo",
                "Date Created": "12-08-2019 09:34:38",
                "Upvotes": 5,
                "Text": "I hate to sound like the typical reddit user that always immediately jumps to \"dump him!!!\" but...\n\ndump him!!!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5y66n": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5y66n",
                "Author": "p0m0sapien",
                "Date Created": "12-08-2019 09:34:52",
                "Upvotes": 6,
                "Text": "I'm so sorry for you. You should not have to deal with this. Drop him ASAP. You and your recovery is worth so much more than someone who says things like that.\n\nI was thinking sometimes people minimise destructive behaviour like bulimia because they want to minimise their own issues...BUT, I really don't feel, from what you've posted, that's what was happening in this case. He's pushing to see what he can get away with and there is no way to live with someone who does that. He is only going to escalate his nastiness.\n\nSometimes people make thoughtless comments in relationships and you can tell them it's Not Ok, and they understand and everyone moves on and it's cool...i don't feel this is one of those situations.\n\nI really hope you feel better soon and your self esteem recovers from this knock. Take care. 🌻",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa68eni": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa68eni",
                "Author": "namjoon1994",
                "Date Created": "12-08-2019 10:22:01",
                "Upvotes": 5,
                "Text": "Get out of that relationship immediately",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa699c8": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa699c8",
                "Author": "naomii_love",
                "Date Created": "12-08-2019 10:25:31",
                "Upvotes": 6,
                "Text": "He sounds like a horrible person, you don't need somebody like that in your life, he's supposed to support you not insult your way into a relapse, that's not a person you'd want to spend more time with",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa5u182": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa5u182",
                "Author": "ellesknits",
                "Date Created": "12-08-2019 09:19:30",
                "Upvotes": 5,
                "Text": "Dump 👏🏻 him 👏🏻",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6gyhe": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6gyhe",
                "Author": "Pootties",
                "Date Created": "12-08-2019 11:03:10",
                "Upvotes": 2,
                "Text": "Holy shit fuck that guy. I hate people who can't/won't put themselves in another's shoes, especially someone close to you. Don't let him gaslight you and don't waste your time trying to explain why you're hurt. It's very obvious why those were shitty things to say and believe, he's just an asshole.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6heiu": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6heiu",
                "Author": "browntiddies",
                "Date Created": "12-08-2019 11:05:10",
                "Upvotes": 5,
                "Text": "what the fuck",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6r1xy": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6r1xy",
                "Author": "rainbowharmony",
                "Date Created": "12-08-2019 11:55:15",
                "Upvotes": 2,
                "Text": "I hope he won’t be your boyfriend for long! A loving and supportive bf would never tell you you shouldn’t wear something because it’s “unflattering”. Not to mention he wouldn’t say something like “bulimia isn’t the worst thing to deal with”. The guy really sounds like a pos to me. I’m so sorry, I can’t even imagine how much it must have hurt to hear that. Sending hugs your way <3",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6yi50": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6yi50",
                "Author": "piizza",
                "Date Created": "12-08-2019 12:29:00",
                "Upvotes": 2,
                "Text": "You deserve to be treated with kindness, respect, and consideration. \n\nYou deserve to wear whatever you like. \n\nYou deserve to feel uninhibited when you choose to have sex with someone. \n\nYou deserve to be free of another person’s instructions to control your body. \n\nYou deserve better.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa70ho7": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa70ho7",
                "Author": "Brief_Somewhere",
                "Date Created": "12-08-2019 12:37:10",
                "Upvotes": 2,
                "Text": "He needs to revel in how healthy you are. He needs to adore your body at all stages not just what he sees on the street one day. \nI understand how our brains go from 0-100 in minutes but...\n\nPlease don't let your self fall back into bulimia. You are so SO. SO. SO perfect how you are. You deserve to wear what you are comfortable in. \nIf a dude is trying to tell you how to dress...theres an issue.\n(editing because there is a diff between saying \"Hey your outfit doesnt go together\"  and \"You shouldn't wear that on your body.\"  one is advice the other is unhealthy control)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa91axo": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa91axo",
                "Author": "[deleted]",
                "Date Created": "12-08-2019 20:51:04",
                "Upvotes": 2,
                "Text": ":c what. I’m so sorry. This breaks my heart. Nobody should ever say that to you. You’re beautiful, don’t change who you are or your style.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa9ipzm": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa9ipzm",
                "Author": "couldbefatter",
                "Date Created": "12-09-2019 01:08:40",
                "Upvotes": 2,
                "Text": "Please take to heart that every single response here is telling you how bad this is. This isn’t a guy who cares or respects you. \n\nDon’t waste another 3 years of your life like I did after the point you’re in now hoping it will change. It won’t. Get. Out.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa9rypf": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa9rypf",
                "Author": "JinxyBellRIP",
                "Date Created": "12-09-2019 04:53:43",
                "Upvotes": 2,
                "Text": "wowee ima get my tired ass over to your place and lift that man child into the bin for u xox",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa6navt": [
        [
            {
                "Parent ID": "t3_e7snd6",
                "Comment ID": "fa6navt",
                "Author": "FnckTheDnck",
                "Date Created": "12-08-2019 11:33:17",
                "Upvotes": 2,
                "Text": "Girl, say good bye to your now-ex bf! You deserve better!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}