{
    "ems126n": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "ems126n",
                "Author": "itsmarta",
                "Date Created": "05-07-2019 17:14:55",
                "Upvotes": 107,
                "Text": "Congratulations!! i’m extremely happy for you!! maybe this i’ll motivate you to recover! this is great and i’m sure you’ll be a great mum! congrats again! kisses :))",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ems571r": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "ems571r",
                "Author": "fattieater",
                "Date Created": "05-07-2019 17:57:19",
                "Upvotes": 94,
                "Text": "Congrats!! I'm 5 months pregnant and it's been a breeze so far (symptom wise.) The hardest part has been the eating. I've gained about 13 pounds so far which is normal I guess but still scary even though it's all in my belly and boobs.\n\nThe first trimester I actually lost some weight and couldn't work out due to being exhausted but now I'm working out and eating anywhere from 2000 calories (I'm tall) to sometimes almost 3k which is awful and scary but it's only when I go to parties or like Easter. It's hard to not starve myself the next day to compensate for days like this and constipation sucks but overall I think it's been good for my mindset and it feels nice to know that my life is a lot bigger than just me now. I feel blessed to know I didn't screw my body up permanently and I'm excited to do things better than my parents (mom unintentionally screwed me up with body image and weight)\n\nEmotions are a whole nother story but I'm so glad to hear your happily married. The support from my husband means the world to me and it sounds like yours will be amazing too. Message me anytime and hope I didn't trigger you with numbers. I've never been diagnosed with anything but this sub is my home away from home.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ems6v5t": [
                {
                    "Parent ID": "t1_ems571r",
                    "Comment ID": "ems6v5t",
                    "Author": "MrsTofuScramble",
                    "Date Created": "05-07-2019 18:14:34",
                    "Upvotes": 34,
                    "Text": "I'm not pregnant, nor are we planning to be anytime soon but your message made me so warm and happy inside. I've irrationally been nervous about getting pregnant in the future (thanks anxiety) because of the weight gain, but it's really nice to read your comment and see that you're getting more comfortable with things. \n\nIt sounds like you guys are going to make fantastic parents, I hope the rest of your pregnancy goes smoothly and your little nugget is happy and healthy.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "emvaovt": [
                [
                    {
                        "Parent ID": "t1_emtygqh",
                        "Comment ID": "emvaovt",
                        "Author": "LilTricky420",
                        "Date Created": "05-08-2019 16:52:45",
                        "Upvotes": 2,
                        "Text": "Thank you so much ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "emtyv1z": [
                {
                    "Parent ID": "t1_ems571r",
                    "Comment ID": "emtyv1z",
                    "Author": "sisterberlin",
                    "Date Created": "05-08-2019 09:29:13",
                    "Upvotes": 5,
                    "Text": "Congrats to you too!! I’m gonna try to keep exercising when I can so I can try to keep a lot of the weight gain in my belly and boobs like you said. Although I’m not very stoked to get even bigger titties than I already have 😐\n\nThanks for the consolation mama!!",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "emvaovt": [
                [
                    {
                        "Parent ID": "t1_emtygqh",
                        "Comment ID": "emvaovt",
                        "Author": "LilTricky420",
                        "Date Created": "05-08-2019 16:52:45",
                        "Upvotes": 2,
                        "Text": "Thank you so much ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "emsioi1": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsioi1",
                "Author": "RiidoDorito",
                "Date Created": "05-07-2019 20:28:31",
                "Upvotes": 39,
                "Text": "As others have said already, youre not required to continue the pregnancy if you don't want to. Whatever you do, I hope it's what makes you happy.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ems55cj": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "ems55cj",
                "Author": "LilTricky420",
                "Date Created": "05-07-2019 17:56:50",
                "Upvotes": 52,
                "Text": "CONGRATULATIONS!!! 💛 My mom was a teen mom (17 when she found out she was pregnant, 18 when I was born) and she suffered from bulimia for the majority of her adolescence. She’s  told me multiple times that I literally saved her life. This is a blessing and a new start for you 💛",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "emtygqh": [
                {
                    "Parent ID": "t1_ems55cj",
                    "Comment ID": "emtygqh",
                    "Author": "sisterberlin",
                    "Date Created": "05-08-2019 09:25:45",
                    "Upvotes": 7,
                    "Text": "Teen moms are both crazy and amazing!! I’m in my late 20’s and I still feel like a kid sometimes, so I can’t imagine being strong enough to raise a kid when I was a teen. Your mom sounds awesome, and an Internet stranger feels proud of her for overcoming those difficulties for you ☺️",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "emvaovt": [
                        {
                            "Parent ID": "t1_emtygqh",
                            "Comment ID": "emvaovt",
                            "Author": "LilTricky420",
                            "Date Created": "05-08-2019 16:52:45",
                            "Upvotes": 2,
                            "Text": "Thank you so much ❤️",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ems9wol": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "ems9wol",
                "Author": "sleepybear7",
                "Date Created": "05-07-2019 18:47:01",
                "Upvotes": 42,
                "Text": "Mom here chiming in. :) being pregnant was the only time I’ve ever really liked my body and a time I felt permission to eat what I wanted. And then when I was breastfeeding I felt like I saw and appreciated my body in a new way. I’m not going to pretend everything is or was rainbows and perfect, and obviously the body image stuff slid back (or I wouldn’t be here on this subreddit). But having my daughter is still the best thing that’s ever happened to me. You can do this. ❤️",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsnshm": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsnshm",
                "Author": "frostfromfire",
                "Date Created": "05-07-2019 21:30:04",
                "Upvotes": 8,
                "Text": "Pregnancy is scary but it helps you realize that body image isn’t as important as you thought it was.  I suffered from AN prior to trying to get pregnant and around the time I started to “show” most of the thoughts about my body were gone and I was constantly thinking about my little one’s body and health and growth and what I could eat to make my baby as smart as possible.  The ED slowly came back about a year after giving birth, but during pregnancy it wasn’t a blip on the radar.  And those 9 months FLY so even if they suck (mine did, I was involuntarily puking all the way to the end) it’s over pretty fast.\n\nI want to address the freedom aspect too.  Make time for yourself and your husband.  It’s imperative.  The first 6 months are crazy because baby will likely cluster feed and won’t sleep more than 2-3 hours at a time (you’ll be so sleep deprived you’ll barely remember it) but after that you and your husband can switch off watching the baby and hire an occasional babysitter to get out of the house.  You won’t have *as much* freedom but you will still have it if you discuss when you want time for yourself.  Thankfully if you already have a stellar marriage then the baby creates a new thing to bond over and love immensely.  It’s primarily when a marriage/relationship is on the rocks when a baby creates more tension and serious problems.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ems6fz1": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "ems6fz1",
                "Author": "Swanabe",
                "Date Created": "05-07-2019 18:10:10",
                "Upvotes": 62,
                "Text": "You don’t have to have it. Just throwing that out there. If you’re not ready to be a mother, you have other options. It’s your choice.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "emty6d4": [
                {
                    "Parent ID": "t1_ems6fz1",
                    "Comment ID": "emty6d4",
                    "Author": "sisterberlin",
                    "Date Created": "05-08-2019 09:23:16",
                    "Upvotes": 7,
                    "Text": "Thank you for stating so! I’m very pro choice and if I wasn’t with my partner, this would be a different story. I love him, we have a very solid relationship, and I think this will be an experience that’ll enrich both our lives in the long run. It was just such a shock to me!!",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "emvaovt": [
                [
                    {
                        "Parent ID": "t1_emtygqh",
                        "Comment ID": "emvaovt",
                        "Author": "LilTricky420",
                        "Date Created": "05-08-2019 16:52:45",
                        "Upvotes": 2,
                        "Text": "Thank you so much ❤️",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ems8d4b": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "ems8d4b",
                "Author": "[deleted]",
                "Date Created": "05-07-2019 18:31:00",
                "Upvotes": 24,
                "Text": "Your gonna be fine! Hugs from across the internet.  You will find that in an experience like this you will find strength you didn't even know you had. \n\nBut please   please   please   keep your dr informed of your ED",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsejpp": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsejpp",
                "Author": "Myrrsha",
                "Date Created": "05-07-2019 19:39:57",
                "Upvotes": 47,
                "Text": "Everyone here is saying congratulations and such, but I feel it's important to say *you do not have to have this child*. Honestly you don't seem happy from the way you talked. Having a child will 100% absolutely change your life forever. Do not do it if you're unhappy with this. If you're ready, then go for it. If you're not, then think it over.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsl5lv": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsl5lv",
                "Author": "bingeyboa",
                "Date Created": "05-07-2019 20:58:08",
                "Upvotes": 15,
                "Text": "First of all, no matter what you do going forward, know it's all right and that you deserve happiness and fulfillment! Regardless of how you choose to proceed, maybe see this as your body reminding you of all the wonderful things it's capable of. Even if you choose to wait, a moment like this really does show how incredible and intricate our bodies are, and how deserving every body is of respect for the truly mind blowing things we are. Like, wow, we can make a tiny screaming, emotion-feeling super computer?! Crazy. \n\nBut of course, this is a big decision! Definitely discuss it with your spouse, and know that there's nothing wrong with pressing pause on this if you don't feel ready, and there's nothing wrong with going forward, even if it seems scary. It's a life changing decision for sure, but it doesn't have to be life changing in a bad way. Consider going to a counselor so you can get an objective perspective on the changes you'll have if you go forward.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsuk8c": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsuk8c",
                "Author": "XiuCyx",
                "Date Created": "05-07-2019 22:58:13",
                "Upvotes": 7,
                "Text": "Here’s how my disordered brain got through pregnancy: nursing burns 1.5x’s the calories...",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emswz1b": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emswz1b",
                "Author": "[deleted]",
                "Date Created": "05-07-2019 23:32:25",
                "Upvotes": 8,
                "Text": "I just wanna let you know that I was 160 before I got pregnant (which was a lot but that b/p life ya know?). 7 days exactly after I had my baby I was 160.7. I got over 200lbs and 7 days later it was gone. My skin took a while to “bounce back”. I expected to be 200lbs forever afterwards. Xoxo \nCongratulations on your baby though! Motherhood is a wild ride. 🥰",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsxuww": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsxuww",
                "Author": "brokenchalkboard",
                "Date Created": "05-07-2019 23:44:17",
                "Upvotes": 7,
                "Text": "I had a horrible stint of my eating disorder before I found out I was pregnant (My ED comes in cycles). Becoming pregnant has been a struggle with my body image, but my want to be a Mom is more important than a want to be thin. \n\nJust remind yourself that you don’t need to eat a bajilion more calories. In reality, you need only 200-300 more. The content of what your eating is most important. Reminding yourself that this is for the baby, makes it easier to stomach a bit more food. \n\nIf you’re happy to be a Mom, embrace the changes you’ll have as necessary for your baby to get the best head start. You can return to a smaller size after birth, but for now, you’re growing someone. Someone you want the best for, and that requires sacrifices.\n\nI know it might be scary, and I’m sorry for that. But you can do this. It’s for them now, and they need you. \n\nCongratulations my dear.",
                "Edited?": "05-08-2019 09:29:28",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsf7qe": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsf7qe",
                "Author": "SleepyCatMom_",
                "Date Created": "05-07-2019 19:47:36",
                "Upvotes": 29,
                "Text": "You...don't sound like you want this kid. The loss of freedom comment is what concerns me.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsoc6n": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsoc6n",
                "Author": "Incndnz",
                "Date Created": "05-07-2019 21:36:53",
                "Upvotes": 6,
                "Text": "Being pregnant was the only time in my whole life I’ve felt actually good about my body. I hope you can try to help your body do it’s job for this time, and come away feeling better about it. ❤️❤️❤️",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ems34bt": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "ems34bt",
                "Author": "invincibletitan33",
                "Date Created": "05-07-2019 17:35:59",
                "Upvotes": 23,
                "Text": "Oh wow congratulations!! Huggggs! Ik it must be scary, but maybe this is a good thing to help recovery...you have something (someone!) to eat for now. Wishing you all the best!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emt1k55": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emt1k55",
                "Author": "[deleted]",
                "Date Created": "05-08-2019 00:40:32",
                "Upvotes": 6,
                "Text": "i got pregnant a few months ago. it made me hungrier but i didnt want to start eating more. lost the pregnancy very quickly. \n\nbut this is nice to hear. i know how scary it may be to know you have to eat more now, eating disorders are especially tough during pregnancy.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emt33cv": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emt33cv",
                "Author": "xxmybrokendreamsxx",
                "Date Created": "05-08-2019 01:05:28",
                "Upvotes": 5,
                "Text": "My mum gave birth and came out a smaller weight if that helps\n\nEdit: she stayed healthy during pregnancy",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emt790c": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emt790c",
                "Author": "dortuh",
                "Date Created": "05-08-2019 02:21:21",
                "Upvotes": 4,
                "Text": "It was horrible for me for sure. I gained 50 lbs and could not believe how big I was. But I lost all the weight breastfeeding and then some! Just persist on that boob and you will be fine. I didnt even have to diet. I ate tons and tons. It did take a couple years, but I didn't work for it. You will be ok!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsaz5q": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsaz5q",
                "Author": "AnasFlowers",
                "Date Created": "05-07-2019 18:58:57",
                "Upvotes": 12,
                "Text": "Congrats! Pregnancy is awesome and having a baby [or 2] [[or 3...]] is an adventure. Make sure you take your prenatal vitamins. And please dont fast.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsd71r": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsd71r",
                "Author": "[deleted]",
                "Date Created": "05-07-2019 19:24:25",
                "Upvotes": 7,
                "Text": "this is honestly my greatest pregnancy fear besides being so bad that i hurt the baby or have a miscarriage. thank god me and my fiancé don’t want kids for another decade at least. i hope i can get better before then.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsakmd": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsakmd",
                "Author": "peafowlontheprowl",
                "Date Created": "05-07-2019 18:54:20",
                "Upvotes": 7,
                "Text": "Congrats!!!  So exciting!!!!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emtda40": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emtda40",
                "Author": "Demona666",
                "Date Created": "05-08-2019 04:24:47",
                "Upvotes": 3,
                "Text": "Congrats!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsb2ua": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsb2ua",
                "Author": "BroItsJesus",
                "Date Created": "05-07-2019 19:00:07",
                "Upvotes": 6,
                "Text": "At least no one will be a cunt to you for eating. Congrats",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsgjks": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsgjks",
                "Author": "marshmallowwsx",
                "Date Created": "05-07-2019 20:03:26",
                "Upvotes": 7,
                "Text": "I hate to be a downer but my nausea when I got pregnant is what started my B/P. I’d get so angry at feeling sick that I’d make myself eat a ton in hopes something would stay down for the baby’s sake. \n\nBUT, I finally figured out that eating small amounts of nutritious food would stay somewhat settled and now I’m not only in the best shape of my life (at 36!), but have an awesome son as well- win/win for sure!\n\n\nCongrats!!!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsfdyv": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsfdyv",
                "Author": "tulipsandmothballs",
                "Date Created": "05-07-2019 19:49:40",
                "Upvotes": 5,
                "Text": "Pregnancy was one of the best things that happened to me. Congrats ❤️ and sending all the love",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emshx39": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emshx39",
                "Author": "r2jlew",
                "Date Created": "05-07-2019 20:19:24",
                "Upvotes": 5,
                "Text": "i'm pregnant too and the weight gain/ being basically forced to eat is scary but i love this little creature in me more than i thought i would and it's helping me deal with the anxiety. only 5 more months for me, you can do it! <3",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emt14a3": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emt14a3",
                "Author": "nosleeptill8",
                "Date Created": "05-08-2019 00:32:57",
                "Upvotes": 2,
                "Text": "Congratulations 💕",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsgb05": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsgb05",
                "Author": "barbieprivilege",
                "Date Created": "05-07-2019 20:00:31",
                "Upvotes": 4,
                "Text": "I LOVED being pregnant! Both pregnancies were so lovey for me. My OB knew about my ED and monitored to make sure I gained enough. It really does change your life. You relationship with yourself and your spouse will change SO much. \n\n\n\n\nI love my babies so so much that I think they are worth it. Congrats to you!!!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "emsq18h": [
        [
            {
                "Parent ID": "t3_blwc84",
                "Comment ID": "emsq18h",
                "Author": "Inky-flower-",
                "Date Created": "05-07-2019 21:58:01",
                "Upvotes": 3,
                "Text": "congrats!!! im only 15 but i've always been excited at the thought of having kids someday\n\nit does sound scary, but it sounds like this baby will be a great thing for you and your husband. maybe this could become a step towards recovery?",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}