{
    "fa9x6az": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "fa9x6az",
                "Author": "[deleted]",
                "Date Created": "12-09-2019 06:43:46",
                "Upvotes": 144,
                "Text": "[deleted]",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "faa1uqg": [
                {
                    "Parent ID": "t1_fa9x6az",
                    "Comment ID": "faa1uqg",
                    "Author": "traumabroccoli",
                    "Date Created": "12-09-2019 07:57:16",
                    "Upvotes": 66,
                    "Text": "Oh god I feel your pain i have to do the same thing in a couple weeks and idk what to do like I can’t be honest and show -1030 calorie days with a couple of +5820 days throw in the mix\n\nI hope the rest of your degree isn’t triggering in this way :/",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "faabhug": [
                        {
                            "Parent ID": "t1_faa1uqg",
                            "Comment ID": "faabhug",
                            "Author": "tseokii",
                            "Date Created": "12-09-2019 09:48:48",
                            "Upvotes": 63,
                            "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "faagsri": [
                        {
                            "Parent ID": "t1_faa1uqg",
                            "Comment ID": "faagsri",
                            "Author": "_bnorm",
                            "Date Created": "12-09-2019 10:23:29",
                            "Upvotes": 17,
                            "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fabvxdo": [
                [
                    {
                        "Parent ID": "t1_faabhug",
                        "Comment ID": "fabvxdo",
                        "Author": "ellesknits",
                        "Date Created": "12-09-2019 16:14:38",
                        "Upvotes": 2,
                        "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fac05ti": [
                        {
                            "Parent ID": "t1_fabvxdo",
                            "Comment ID": "fac05ti",
                            "Author": "tseokii",
                            "Date Created": "12-09-2019 16:44:59",
                            "Upvotes": 4,
                            "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "faa7sta": [
                {
                    "Parent ID": "t1_fa9x6az",
                    "Comment ID": "faa7sta",
                    "Author": "5mokahontas",
                    "Date Created": "12-09-2019 09:13:02",
                    "Upvotes": 13,
                    "Text": "i faked it tbh",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "fa9zupl": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "fa9zupl",
                "Author": "backatmybsagain",
                "Date Created": "12-09-2019 07:27:58",
                "Upvotes": 94,
                "Text": "I feel you. I'm a nutrition major and definitely found that most people in the program have EDs and that's why they chose it. Myself, my professors, and even people in research were like 80% disordered at minimum. It was super triggering and I had to put my degree on hold because it was hard being around so many people who were disordered and didn't realize it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "faa2b4j": [
                {
                    "Parent ID": "t1_fa9zupl",
                    "Comment ID": "faa2b4j",
                    "Author": "traumabroccoli",
                    "Date Created": "12-09-2019 08:03:38",
                    "Upvotes": 27,
                    "Text": "it’s kinda sad but I get it like I can’t imagine understanding or being interested in nutrition pre-ed like food was just food leavE it AlOne\n\nbut yeah I don’t think I could be in that environment either that’d be so... exhausting to say the least",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "faatfy5": [
                {
                    "Parent ID": "t1_fa9zupl",
                    "Comment ID": "faatfy5",
                    "Author": "mangganese",
                    "Date Created": "12-09-2019 11:41:47",
                    "Upvotes": 12,
                    "Text": "Woah, this is super interesting to me, can you expand on this? That association never occurred to me, I’m super curious",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "fab7zvv": [
                        {
                            "Parent ID": "t1_faatfy5",
                            "Comment ID": "fab7zvv",
                            "Author": "backatmybsagain",
                            "Date Created": "12-09-2019 13:19:03",
                            "Upvotes": 15,
                            "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "fac3y6m": [
                {
                    "Parent ID": "t1_fa9zupl",
                    "Comment ID": "fac3y6m",
                    "Author": "goldenmantella",
                    "Date Created": "12-09-2019 17:12:46",
                    "Upvotes": 2,
                    "Text": "Just out of curiosity, what school do you go to?",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "facahmu": [
                        {
                            "Parent ID": "t1_fac3y6m",
                            "Comment ID": "facahmu",
                            "Author": "backatmybsagain",
                            "Date Created": "12-09-2019 18:01:32",
                            "Upvotes": 3,
                            "Text": "Asu",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "faa2xqx": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "faa2xqx",
                "Author": "little-pinkie",
                "Date Created": "12-09-2019 08:12:21",
                "Upvotes": 44,
                "Text": "Excuse me.. did you say CALORIE RESTRICTION DOESN’T WORK?",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "faa5r4f": [
                {
                    "Parent ID": "t1_faa2xqx",
                    "Comment ID": "faa5r4f",
                    "Author": "traumabroccoli",
                    "Date Created": "12-09-2019 08:48:22",
                    "Upvotes": 28,
                    "Text": "yeah ik right?? technically not true but I guess contextually true in that most healthy ppl will not stick to a prescribed calorie restricted diet bUt this is what messes w my head oh my god",
                    "Edited?": "12-09-2019 08:53:27",
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "faa964x": [
                        {
                            "Parent ID": "t1_faa5r4f",
                            "Comment ID": "faa964x",
                            "Author": "forgetremembering",
                            "Date Created": "12-09-2019 09:28:37",
                            "Upvotes": 24,
                            "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "faa3on1": [
                {
                    "Parent ID": "t1_faa2xqx",
                    "Comment ID": "faa3on1",
                    "Author": "annaliseilheia",
                    "Date Created": "12-09-2019 08:22:17",
                    "Upvotes": 12,
                    "Text": "I know, pop quiz! What does that mean? Haha Answer due NOW please? 😳😳",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "fabd2ve": [
                {
                    "Parent ID": "t1_faa2xqx",
                    "Comment ID": "fabd2ve",
                    "Author": "goldenmantella",
                    "Date Created": "12-09-2019 13:56:14",
                    "Upvotes": 7,
                    "Text": "Well, eating disorders aren't really discussed or studied much at the undergrad level. The curriculum focuses on general populations. Those who want to work as dietitians with a specialty in say, eating disorders treatment, would focus on behavioral health nutrition in grad school.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "faa1gry": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "faa1gry",
                "Author": "esberanza",
                "Date Created": "12-09-2019 07:51:49",
                "Upvotes": 43,
                "Text": "I feel you. I haven't studied nutrition, but I had an appointment with a nutritional therapist. She made it sound like I would LITERALLY FUCKING DIE if I didn't eat a slice of bread with every meal... I don't get it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "faainjp": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "faainjp",
                "Author": "LilBpixi3",
                "Date Created": "12-09-2019 10:35:14",
                "Upvotes": 14,
                "Text": "*Me eating the same frozen low calorie meal from dollartree everyday* Nutrition? Never heard of her",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "faa6u83": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "faa6u83",
                "Author": "stefanica",
                "Date Created": "12-09-2019 09:01:40",
                "Upvotes": 18,
                "Text": "I don't blame you! I'd go nuts if I had to take a class like that now. No wonder (many) dieticians are off their rockers. I had one when I was pregnant and they thought I might have gestational diabetes, tell me I needed to eat way more carbs and use margarine not butter. Also she had a bmi of at least 40. I actually did follow her diet for about 6 weeks and gained 15 lbs.\n\nAnyway, just remember that, although the scientific method is what we aspire to use perfectly to find truths about our world, a science textbook is just written by a guy or two who had strong enough feelings about a subject to write a book about it. And nutrition is a very young and imperfect science. It's not just chemistry or thermodynamics where you can exclude all the conflicting variables and say definitively that a gram of carbon is this many atoms.\n\n We are, for instance, just starting to put 2 and 2 together about how your gut bacteria affects your weight, health, and even mental health. People who studied that 30 years ago were snickered at for being old fashioned or a little bit whackjob. \n\nMy advice is to focus on the core science in the book (as much as it has lol) for yourself and research further from the bibliography. And for the rest, figure out what your prof  wants to hear for the exams... 🙄",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "faa7i41": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "faa7i41",
                "Author": "5mokahontas",
                "Date Created": "12-09-2019 09:09:37",
                "Upvotes": 18,
                "Text": "are you kidding, I'm about to graduate and I fuggin love being a nutrition major. i love being vegan and a studying dietitian cause i fucking KNOW MY SHIT and so many people don't. so many of my \"ED fears\" have been scientifically disproven and it's really helped me understand that my body is not just skin, bone, and fat. i need nourishment. \n\nPS, I'm not a health bitch in the slightest but actual nutrition education has helped me pick and choose the foods i put into my body by macro and micronutrients, not just choosing \"low cal\" or \"low fat\" things.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fac9gxa": [
                {
                    "Parent ID": "t1_faa7i41",
                    "Comment ID": "fac9gxa",
                    "Author": "cygetsfit",
                    "Date Created": "12-09-2019 17:53:52",
                    "Upvotes": 5,
                    "Text": "Please don't feel pressure to respond if it triggers you- but I'm super curious about what sort of \"ED fears\" you were able to scientifically disprove because I tend to have a lot of those too...",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "fabcaz6": [
                {
                    "Parent ID": "t1_faa7i41",
                    "Comment ID": "fabcaz6",
                    "Author": "goldenmantella",
                    "Date Created": "12-09-2019 13:50:33",
                    "Upvotes": 4,
                    "Text": "Relatable. I consider myself nearly fully recovered from EDs and I graduated with my B.S. in nutrition a year ago. It transformed my obsessive, irrational and rigid mindset to one of sound logic and reason. Learning about how to verify scientific information quieted disordered thoughts. \nI'm in the military now (yeah, I joined, I'm perfectly healthy now and the past is in the past) and I'm planning on earning a post-bacc in either ecology or conservation biology after my next army training school. I want to go to grad school for the coordinated program in dietetics with a community nutrition concentration- MPH at Indiana State. I ultimately want to research correlations between sustainable ecosystems and human health.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "fabm4l3": [
                {
                    "Parent ID": "t1_faa7i41",
                    "Comment ID": "fabm4l3",
                    "Author": "PwincessStepford",
                    "Date Created": "12-09-2019 15:01:42",
                    "Upvotes": 4,
                    "Text": "Same..do you ever feel like you know more than your fellow dietetics majors?",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "fac2pg1": [
                        {
                            "Parent ID": "t1_fabm4l3",
                            "Comment ID": "fac2pg1",
                            "Author": "goldenmantella",
                            "Date Created": "12-09-2019 17:03:35",
                            "Upvotes": 6,
                            "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fac9kll": [
                        {
                            "Parent ID": "t1_fabm4l3",
                            "Comment ID": "fac9kll",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 17:54:39",
                            "Upvotes": 2,
                            "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "fabpf6z": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "fabpf6z",
                "Author": "Grellous8",
                "Date Created": "12-09-2019 15:25:33",
                "Upvotes": 6,
                "Text": "> “Exercise causes oxidative stress and free radicals, which contributes to the ageing process and cellular death or damage”\n\nhaha u wot m8\n\n>“Most people eat when they are not hungry”\n\nGot damn is that ever a personal attack if I ever saw one myself",
                "Edited?": "12-09-2019 15:44:52",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "facriwh": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "facriwh",
                "Author": "tigerchik",
                "Date Created": "12-09-2019 20:35:37",
                "Upvotes": 3,
                "Text": "It might be \"simply a mathematical equation\" but it's a MULTIVARIABLE equation (source: BS in exercise phys, phd in math)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fablt0g": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "fablt0g",
                "Author": "PwincessStepford",
                "Date Created": "12-09-2019 14:59:19",
                "Upvotes": 5,
                "Text": "Unlike most people here, I’m in dietetics, and I honestly can’t find people in my program with overt ED’s. They’re all pretty healthy, but I’m the ONLY one who doesn’t try the foods in my foods labs.\n\nNow, of course, I’m certain that there is at least one other person in the room I’m not seeing, but I definitely thought it would be easier to spot.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "fac33pj": [
                {
                    "Parent ID": "t1_fablt0g",
                    "Comment ID": "fac33pj",
                    "Author": "[deleted]",
                    "Date Created": "12-09-2019 17:06:29",
                    "Upvotes": 2,
                    "Text": "[deleted]",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "fac6dpt": [
                        {
                            "Parent ID": "t1_fac33pj",
                            "Comment ID": "fac6dpt",
                            "Author": "PwincessStepford",
                            "Date Created": "12-09-2019 17:30:49",
                            "Upvotes": 3,
                            "Text": "Hence my second paragraph in my comment :)",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "fadar6v": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "fadar6v",
                "Author": "owntheh3at18",
                "Date Created": "12-10-2019 01:14:58",
                "Upvotes": 2,
                "Text": "So this is why the internet can’t decide on the best weight loss methods. Apparently neither can science.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "faachnq": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "faachnq",
                "Author": "jakeysnakey83",
                "Date Created": "12-09-2019 09:55:18",
                "Upvotes": -4,
                "Text": "And I’m just going to kindly point out that the number of downvotes on my comment encouraging people to explore avenues that work for people outside of the traditional guidelines… This proves what is wrong with the nutritional guidelines and the people who promote them.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "fa9ymua": [
        [
            {
                "Parent ID": "t3_e8866o",
                "Comment ID": "fa9ymua",
                "Author": "jakeysnakey83",
                "Date Created": "12-09-2019 07:08:34",
                "Upvotes": -43,
                "Text": "All nutrition science is highly flawed. It’s all funded by sugar and grain and agriculture industries.  Almost literally all studies are epidemiological, which is useless. \n\nIf you wanna see something that flies in the face of all nutrition science, google Mikhaila Peterson. She 100% healed her severe autoimmune conditions (having had ankle and hip replaced by 17), and crippling depression and anxiety (on both SSRIs and stimulants since being less than ten) by changing her diet to something unconventional. \n\nBy traditional dietary standards, she should be dead eating this diet. And she’s thriving. \n\nMy point here is that conventional nutrition is false. \n\nI mention it because learning that is one of the things that helped me overcome my own ED. It made me very angry at the government and at science in general (I’m a biochemist), but I guess that was part of the process.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "faa6cd3": [
                {
                    "Parent ID": "t1_fa9ymua",
                    "Comment ID": "faa6cd3",
                    "Author": "frostfromfire",
                    "Date Created": "12-09-2019 08:55:39",
                    "Upvotes": 17,
                    "Text": "I just checked out her IG.  So she’s on a low carb diet that doesn’t include low calorie/carb veggies or berries?  I can’t say I understand the reasoning behind excluding low cal, high fiber foods that will allow her to defecate much more easily.  There was also a post on her IG about having c diff out of nowhere when she said people on carnivorous diets shouldn’t be afflicted by that.  And she still does multi day fasts regularly to get the results she wants.  It doesn’t sound like her diet is all that great and she’d probably benefit much more from a keto diet.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "faagjoa": [
                        {
                            "Parent ID": "t1_faa6cd3",
                            "Comment ID": "faagjoa",
                            "Author": "jakeysnakey83",
                            "Date Created": "12-09-2019 10:21:51",
                            "Upvotes": -1,
                            "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa0oup": [
                [
                    {
                        "Parent ID": "t1_fa9zzk3",
                        "Comment ID": "faa0oup",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 07:40:32",
                        "Upvotes": -28,
                        "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faa7rig": [
                        {
                            "Parent ID": "t1_faa0oup",
                            "Comment ID": "faa7rig",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 09:12:38",
                            "Upvotes": 14,
                            "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faazzs4": [
                [
                    {
                        "Parent ID": "t1_faagjoa",
                        "Comment ID": "faazzs4",
                        "Author": "dietthrowaway55",
                        "Date Created": "12-09-2019 12:24:40",
                        "Upvotes": 8,
                        "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaa5eh": [
                [
                    {
                        "Parent ID": "t1_faa7rig",
                        "Comment ID": "faaa5eh",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 09:38:18",
                        "Upvotes": -9,
                        "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaeeax": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "faaeeax",
                            "Author": "5mokahontas",
                            "Date Created": "12-09-2019 10:08:07",
                            "Upvotes": 11,
                            "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "fab48z3": [
                        {
                            "Parent ID": "t1_faaa5eh",
                            "Comment ID": "fab48z3",
                            "Author": "Pretty_strong_friend",
                            "Date Created": "12-09-2019 12:52:15",
                            "Upvotes": 10,
                            "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                            "Edited?": "12-09-2019 17:27:12",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faai45m": [
                [
                    {
                        "Parent ID": "t1_faaeeax",
                        "Comment ID": "faai45m",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:31:52",
                        "Upvotes": 2,
                        "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "fa9zzk3": [
                {
                    "Parent ID": "t1_fa9ymua",
                    "Comment ID": "fa9zzk3",
                    "Author": "hollysees",
                    "Date Created": "12-09-2019 07:30:04",
                    "Upvotes": 32,
                    "Text": "mikhaila peterson just wants to profit off of other peoples sickness",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "faa0oup": [
                        {
                            "Parent ID": "t1_fa9zzk3",
                            "Comment ID": "faa0oup",
                            "Author": "jakeysnakey83",
                            "Date Created": "12-09-2019 07:40:32",
                            "Upvotes": -28,
                            "Text": "If you knew anything about her story you’d see that she cured herself.  There’s nothing wrong with health coaching when you’ve figured out something that works. \n\nShe should literally be dead by our conventional nutrition guidelines. I don’t know how anyone could not be fascinated by that.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faabhug": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faabhug",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 09:48:48",
                        "Upvotes": 63,
                        "Text": "just fake it lol. you've been blessed with the knowledge of how normal people eat, now go pretend you're one of them! 😂\n\nnah but I faked my calorie tracking assignment too. no one is gonna know so don't stress it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "fabvxdo": [
                        {
                            "Parent ID": "t1_faabhug",
                            "Comment ID": "fabvxdo",
                            "Author": "ellesknits",
                            "Date Created": "12-09-2019 16:14:38",
                            "Upvotes": 2,
                            "Text": "Or you could use the opportunity to try and make healthy choices since you're learning what a body needs. 👌🏻",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faagsri": [
                [
                    {
                        "Parent ID": "t1_faa1uqg",
                        "Comment ID": "faagsri",
                        "Author": "_bnorm",
                        "Date Created": "12-09-2019 10:23:29",
                        "Upvotes": 17,
                        "Text": "A friend of mine was in the same class through a regional campus and we \"worked together\" on it.  So basically I copied hers because she eats like a normal person and I was surviving off of microwaveable mashed potatoes.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fab7zvv": [
                [
                    {
                        "Parent ID": "t1_faatfy5",
                        "Comment ID": "fab7zvv",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 13:19:03",
                        "Upvotes": 15,
                        "Text": "Yeah for sure! My ED first came when I was a sophomore in high school and it hit pretty hard as restrictive orthorexia. I ended up figuring out that I might be disordered and went to my parents about it and they did I didn't have an ED because I wasn't too skinny... I was already underweight. So because I felt that it wasn't a safe space to get therapy I chose nutrition as major going into college because I was really interested in overcoming my ED with knowledge and possibly helping other people with EDs after I got registered.\n\nJokes on me though because I didn't know I had orthorexia and more knowledge about food just made me spiral even more. As I learned more, I restricted more. And the worst part of it was that I knew what I was doing 100%, so it was just super confusing and conflicting. \n\nI only have a couple credits left in my degree so I spent a lot of time there and after talking my peers it became really obvious that the vast majority were disordered and also totally in denial about it. It was really similar to social media influencers that are all #recovery but actually they are just raw vegans or some crap and have just found a different way to restrict while being \"healthy\". \n\nNothing against raw vegans but it was like most of these girls (we only had like 2 guys in our program) had no idea that they were in the depths of their disorder still so they would go around and try to convince people in their lives to eat like them. Idk I probably sound super bitchy but i think I just feel guilty because I did that exact thing to my mom. I was super restrictive and only ate a handful of safe foods (kale, egg whites, chickpeas lol) and didn't know yet that I wasn't actually being healthy, but that I had orthorexia. I ended up convincing her to eat the same way without knowing that she also had a history of disordered eating (go figure) and she still is really affected by that. So yeah. It's a weird dynamic in the nutrition arena. Take everything with a grain of salt (lol)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "facahmu": [
                [
                    {
                        "Parent ID": "t1_fac3y6m",
                        "Comment ID": "facahmu",
                        "Author": "backatmybsagain",
                        "Date Created": "12-09-2019 18:01:32",
                        "Upvotes": 3,
                        "Text": "Asu",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faa964x": [
                [
                    {
                        "Parent ID": "t1_faa5r4f",
                        "Comment ID": "faa964x",
                        "Author": "forgetremembering",
                        "Date Created": "12-09-2019 09:28:37",
                        "Upvotes": 24,
                        "Text": "Textbooks and professors arent always right. For instance you also have the statement that fasting reduces BMR. Most research has been pointing to the opposite until you crest the 72 hour mark.\n\nAnother easily debatable statement is how it was said that dietary fat is easily transformed into body fat. Its not as easy as turning carbohydrates into body fat, but by easy we really mean biologically preferred. Triglycerides enter cells by being transported by micelles and apoprotein capped carriers. Cells often refuse entrance of these. Beyond that, the enzymes that make the body fat from triglycerides have higher activation costs than the competing enzymes that turn carbs into fat. Because lipids have more energy density the barrier can be overcome, but higher activation costs do lower how biologically preferred the reactions are.\n\nOne of the more interesting things to me that i made a big deal about in class was that metabolizing from glycogen took one less glucose input than metabolizing from dietary glucose. My professor couldnt understand why i so persistent on clarifying that.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac2pg1": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac2pg1",
                        "Author": "goldenmantella",
                        "Date Created": "12-09-2019 17:03:35",
                        "Upvotes": 6,
                        "Text": "No, I never felt like I knew more than my classmates. I thought I knew everything about nutrition before college. While I actually was right about a lot of things, I soon realized that the obsessive nature of my EDs distorted the facts and made a lot of different health claims far more exaggerated. I would cling to and fixate on the tiniest bits of insignificant evidence because it satisfied my obsessive compulsive tendencies and rituals. I suppose the silver lining in having experienced this is that I can understand the psychology of consumer-driven behavior in diet and exercise marketing, and why it can be so hard to accept professional advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac9kll": [
                [
                    {
                        "Parent ID": "t1_fabm4l3",
                        "Comment ID": "fac9kll",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 17:54:39",
                        "Upvotes": 2,
                        "Text": "I did during our eating disorder modules during my communication course and medical nutrition therapy course. mostly cause we go over causes, symptoms, and signs and I’m siting there like “ha ha I do that”",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "fac6dpt": [
                [
                    {
                        "Parent ID": "t1_fac33pj",
                        "Comment ID": "fac6dpt",
                        "Author": "PwincessStepford",
                        "Date Created": "12-09-2019 17:30:49",
                        "Upvotes": 3,
                        "Text": "Hence my second paragraph in my comment :)",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faagjoa": [
                [
                    {
                        "Parent ID": "t1_faa6cd3",
                        "Comment ID": "faagjoa",
                        "Author": "jakeysnakey83",
                        "Date Created": "12-09-2019 10:21:51",
                        "Upvotes": -1,
                        "Text": "You gotta read / research the whole story. I simply put it out there as an n=1 example that disproves most conventional nutritional advice. \n\nIf you really want to have your mind blown, check out www.meatheals.com\n\nI’m not suggesting of meat only diet. But the fact that you don’t die on it, and actually thrive… Defies all conventional nutrition advice.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faazzs4": [
                        {
                            "Parent ID": "t1_faagjoa",
                            "Comment ID": "faazzs4",
                            "Author": "dietthrowaway55",
                            "Date Created": "12-09-2019 12:24:40",
                            "Upvotes": 8,
                            "Text": "But the thing is, people can seem healthy for years while eating quite a lot of unhealthy foods. If you’re active and not overweight and you don’t have other unhealthy habits, then you are not doing as much damage as a lot of other people. However, that doesn’t mean you aren’t still doi nog damage. The damage is incremental and takes years to actually kill you. If she was over 65 and had been eating that way her whole life and she had been tested for many health issues, well then that might mean something. But I think you could attribute that to her personal genetics having a protective effect rather than her diet being “healthy.”\n\nAlso, just because her autoimmune disease were “cured” by her diet doesn’t mean they can’t come back. It could also be partly the placebo effect making her think that her symptoms aren’t as bad. Particularly for her depression, there are a lot of reasons why that could go away that are not related to dietary changes, and again, there is the placebo effect, which you can’t discount when you are talking about 1 person. There are so many explanations and variables that can’t be discounted, that you really can’t say that her story “disproves” all conventional nutritional science. \n\nReally, if you’re a biochemist as you claim, then you should know better that you can’t make claims like that. It’s never as simple as you want it to be. Sure, there may be a lot of bias in research, but is ALL research biased?? No, certainly not. You can look up many current studies and look at conflicts of interest if you don’t believe me. The world isn’t all a huge conspiracy.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "faa7rig": [
                [
                    {
                        "Parent ID": "t1_faa0oup",
                        "Comment ID": "faa7rig",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 09:12:38",
                        "Upvotes": 14,
                        "Text": "nutrition guidelines are for healthy people. this lady was not a healthy person. she probably changed her diet by seeing a dietitian that prescribed her an individualized diet for her specific condition.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faaa5eh": [
                        {
                            "Parent ID": "t1_faa7rig",
                            "Comment ID": "faaa5eh",
                            "Author": "jakeysnakey83",
                            "Date Created": "12-09-2019 09:38:18",
                            "Upvotes": -9,
                            "Text": "Actually no, she did all of that and no dietitian was able to help. So she took it upon herself and found something that worked. Nutrition guidelines are for corporations, agriculture, and sugar industries profit.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fac05ti": [
                [
                    {
                        "Parent ID": "t1_fabvxdo",
                        "Comment ID": "fac05ti",
                        "Author": "tseokii",
                        "Date Created": "12-09-2019 16:44:59",
                        "Upvotes": 4,
                        "Text": "I mean, that would be best but I feel like that's kind of a given lol. Quite a lot of us are well-read in nutrition but the ED gets in the way of treating our bodies right.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "faaeeax": [
                [
                    {
                        "Parent ID": "t1_faaa5eh",
                        "Comment ID": "faaeeax",
                        "Author": "5mokahontas",
                        "Date Created": "12-09-2019 10:08:07",
                        "Upvotes": 11,
                        "Text": "it’s literally a part of the nutrition guidelines to reduce added sugar intake so idk why you think the sugar industry benefits from dietitians. dietitians also forced industries to change their nutrient facts panels and put calorie information on fast food menus (which could deter people from buying unhealthy products). dietitians are fucking dope, take off the tinfoil hat.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "faai45m": [
                        {
                            "Parent ID": "t1_faaeeax",
                            "Comment ID": "faai45m",
                            "Author": "jakeysnakey83",
                            "Date Created": "12-09-2019 10:31:52",
                            "Upvotes": 2,
                            "Text": "I’m done here. I shouldn’t be surprised that people aren’t open to something that goes against something they believe. \n\nTo be clear this isn’t anti dietician. It’s more pointing out that’s what is taught conventionally is flawed and not the whole story. \n\nAs somebody who has studied nutritional biochemistry, I don’t think I’m wearing a tinfoil hat. \n\nPeace out.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "fab48z3": [
                [
                    {
                        "Parent ID": "t1_faaa5eh",
                        "Comment ID": "fab48z3",
                        "Author": "Pretty_strong_friend",
                        "Date Created": "12-09-2019 12:52:15",
                        "Upvotes": 10,
                        "Text": "Maybe you are the one who is too gullible to believe an influencer who has a particular disease and trying to literally make financial profit off her platform. U talk shit abt nutrition science being funded by corportation, as if your influencer doesnt have conflict of interest.    \n   \nAt least nutrition science has some actual scientist behind it and not just some middle aged unemployed lady/housewive trying to guilt you into buying her diet. Were you one of those people who sold herbalife?   \n  \nIf you know anything abt the science of biology, you would have more respect to it.",
                        "Edited?": "12-09-2019 17:27:12",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ]
}