{
    "ehpr49g": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehpr49g",
                "Author": "Rickticia",
                "Date Created": "03-03-2019 13:00:45",
                "Upvotes": 81,
                "Text": "I also really love kids (I’m sure it’s since I have a 7 year old brother and tons of cousins only a few years older than him). I completely get your worry about wanting to be the best role model for them and worrying that you may influence them negatively, but you ARE being an amazing role model. Having someone early on watching it for them and teaching them to move past the skinny/fat comparisons is such a great thing for them to be learning at that age. You’re a wonderful person for being so caring and mindful around them and teaching them things many others neglect to.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehq2u42": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehq2u42",
                "Author": "Inky-flower-",
                "Date Created": "03-03-2019 15:29:20",
                "Upvotes": 77,
                "Text": "my little brother took a bowl of popcorn from my sister and when she got mad he said \"well you're so big you dont need it anyways\"\n\nshe said \"you weigh more than me though\" and he rolled his eyes and told her \"yeah but youre a girl and im a guy so only im supposed to be big!\"\n\nI explained to him why thats not okay and he felt really bad and apologized but i've still noticed my sister eating a lot less lately. it hurts to watch because im so afraid she might end up down the same path as me... she's about the age i was when i first started restricting so ive been extra anxious about it lately.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehq4e1i": [
                {
                    "Parent ID": "t1_ehq2u42",
                    "Comment ID": "ehq4e1i",
                    "Author": "cinnamonbicycle",
                    "Date Created": "03-03-2019 15:48:38",
                    "Upvotes": 38,
                    "Text": "I hope your sister's okay... does she know about your struggles? Maybe if you make yourself an open source of comfort and encouragement, she won't spiral down too far.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "ehqrgps": [
                [
                    {
                        "Parent ID": "t1_ehq4a45",
                        "Comment ID": "ehqrgps",
                        "Author": "[deleted]",
                        "Date Created": "03-03-2019 21:05:50",
                        "Upvotes": 4,
                        "Text": "Thanks :) glad to know others around me are passionate about kids ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ehpr4us": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehpr4us",
                "Author": "onIytoldthemoon",
                "Date Created": "03-03-2019 13:00:58",
                "Upvotes": 44,
                "Text": "I love kids as well! I just wish I could protect them from the world. Seeing happy children breaks my heart, because I know what's waiting for them in the future, and soon enough, they'll find themselves in our place, wondering where it all went wrong and how good it would be to be kids again.\n\nI think that your struggles with EDs is what makes you capable of being a good role model. You're familiar with this stuff, so you're honestly the best person to help them if they ever find themselves in a similar situation. You might be a better influence than you think you are.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehq0vkb": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehq0vkb",
                "Author": "Valer_bear",
                "Date Created": "03-03-2019 15:04:52",
                "Upvotes": 39,
                "Text": "This reminds me of how whenever I go to babysit the kids ask if I’m okay/ dying due to how thin I am. One of them (who’s like 10) even said if I stop eating can I look like you and it broke me bc you shouldn’t care about weight / body image at that age ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehq1ubg": [
                {
                    "Parent ID": "t1_ehq0vkb",
                    "Comment ID": "ehq1ubg",
                    "Author": "cinnamonbicycle",
                    "Date Created": "03-03-2019 15:16:57",
                    "Upvotes": 13,
                    "Text": "That's so heartbreaking <3 ",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "ehqrgps": [
                [
                    {
                        "Parent ID": "t1_ehq4a45",
                        "Comment ID": "ehqrgps",
                        "Author": "[deleted]",
                        "Date Created": "03-03-2019 21:05:50",
                        "Upvotes": 4,
                        "Text": "Thanks :) glad to know others around me are passionate about kids ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ehq3ohp": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehq3ohp",
                "Author": "[deleted]",
                "Date Created": "03-03-2019 15:39:51",
                "Upvotes": 31,
                "Text": "[deleted]",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehq4ijw": [
                {
                    "Parent ID": "t1_ehq3ohp",
                    "Comment ID": "ehq4ijw",
                    "Author": "cinnamonbicycle",
                    "Date Created": "03-03-2019 15:50:11",
                    "Upvotes": 19,
                    "Text": "Is there anything that might have helped you 9-year-old self that maybe I could try to do for her? I really just want to be there for her however I can.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "ehqrgps": [
                [
                    {
                        "Parent ID": "t1_ehq4a45",
                        "Comment ID": "ehqrgps",
                        "Author": "[deleted]",
                        "Date Created": "03-03-2019 21:05:50",
                        "Upvotes": 4,
                        "Text": "Thanks :) glad to know others around me are passionate about kids ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ehq2bxo": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehq2bxo",
                "Author": "[deleted]",
                "Date Created": "03-03-2019 15:23:09",
                "Upvotes": 28,
                "Text": "[deleted]",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehrbdwf": [
                {
                    "Parent ID": "t1_ehq2bxo",
                    "Comment ID": "ehrbdwf",
                    "Author": "unforgettable_potato",
                    "Date Created": "03-04-2019 04:11:47",
                    "Upvotes": 7,
                    "Text": "They make fitness trackers specially for children, I think it's called the Ace? So I guess it's not that surprising. Me, I rather motivate a kid to be active and healthy with something more fun like pokemon go or walking the dog. But if this girl is obsessively checking it, I imagine mom or dad has their own and does the same... But I don't know this kid obviously and I am only guessing. ",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ehqrgps": [
                [
                    {
                        "Parent ID": "t1_ehq4a45",
                        "Comment ID": "ehqrgps",
                        "Author": "[deleted]",
                        "Date Created": "03-03-2019 21:05:50",
                        "Upvotes": 4,
                        "Text": "Thanks :) glad to know others around me are passionate about kids ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ehq2fxh": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehq2fxh",
                "Author": "[deleted]",
                "Date Created": "03-03-2019 15:24:31",
                "Upvotes": 27,
                "Text": "I just try to lift them up as much as possible. Give them opportunities to lead, or to shine in the areas they’re good at, celebrate small victories with them. Even when a kid is in trouble I’ll always end a lecture by telling them, “you’re a good kid”. Make they believe they matter, that you’re on their side. \nAnother line I like to use, when they call each other or themselves stupid, I say: “kids aren’t stupid! Nobody’s stupid until they grow up.” Then they usually point out im a grown up and I say, “well, not all grown ups are stupid, but all stupid people are grown ups.”  It teaches them that they can question the authority figures in their lives, but doesn’t give them permission to dismiss all authority. \nKids are so great and the best thing we can do is let them grow without fear",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehq4a45": [
                {
                    "Parent ID": "t1_ehq2fxh",
                    "Comment ID": "ehq4a45",
                    "Author": "cinnamonbicycle",
                    "Date Created": "03-03-2019 15:47:19",
                    "Upvotes": 15,
                    "Text": "That's such a great line! I'm totally gonna start using that, it's so true.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "ehqrgps": [
                        {
                            "Parent ID": "t1_ehq4a45",
                            "Comment ID": "ehqrgps",
                            "Author": "[deleted]",
                            "Date Created": "03-03-2019 21:05:50",
                            "Upvotes": 4,
                            "Text": "Thanks :) glad to know others around me are passionate about kids ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ehpy6qq": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehpy6qq",
                "Author": "Aleph0-4",
                "Date Created": "03-03-2019 14:30:33",
                "Upvotes": 22,
                "Text": "I've got a niece who's around 12 years old right now and at all the family gatherings, relatives would say that she's chubby and that she should eat less which is especially bad because all the other women in my family are slim. It makes me so angry because I was her size at that age and those same ignorant comments still affect me but I don't know how I can help her...",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehqeuuz": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehqeuuz",
                "Author": "artandtrash",
                "Date Created": "03-03-2019 18:05:16",
                "Upvotes": 13,
                "Text": "something that you should reinforce within them is that there is no value on “heavy” or “light”. recognize and celebrate their internal traits and discourage ANY comment good or bad about external factors",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehqzc2o": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehqzc2o",
                "Author": "wethail",
                "Date Created": "03-03-2019 23:13:55",
                "Upvotes": 8,
                "Text": "I started thinking I was fat in second/third grade, ages 7-8. \nThat’s exactly when an eating disorder first begins to plant the “I’m too big/fat/much” seed in humans’ brains. \n\nKeep being the positive role model you are. Keep reminding them that if they’re getting a little big, it’s their body using storing energy to get ready for a growth spurt. \nJoke about how you used to weigh 80 pounds as an 8 year old and by the time you were 11 you were 110. Whatever truths it takes to make them think their changing and soon to be changing bodies are normal (because it is!!)\n\nYou have an opportunity to positively affect these girls for the rest of their lives and I am immensely proud that you are taking every reasonable action. Thank you. \n\nMy 8 year old self thanks you. \nAnd those girls, when they are old enough to understand, will thank you. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehrhrfz": [
        [
            {
                "Parent ID": "t3_awx59b",
                "Comment ID": "ehrhrfz",
                "Author": "frostfromfire",
                "Date Created": "03-04-2019 06:55:42",
                "Upvotes": 3,
                "Text": "You are doing a good job by being delicate with your words and not framing being thin or light in a positive way.  Kids pick up on so much, and I’m sure they’re already curious or envious of your body type.  Not talking about it or directly saying heavy is okay is the best way to prevent the girls from trying to emulate you, but you might want to be prepared for if/when one of the children asks you directly why you don’t eat or don’t eat healthy amounts.\n\nI have a 2 year old and she’s already noticing that I don’t eat with her and my husband at breakfast and lunch or snacks.  She’s starting to take her own food and hold it up to my face saying “eat mama!” It’s such a tricky and heartbreaking situation to deal with because with an ED I don’t want to be my child’s role model in regards to food but I also want to guide her to eat healthy and be healthy.  I can see you’re struggling with the same issue and I honestly don’t know how to “explain around it” if directly asked why I don’t eat or told to eat by a child.  For now all I’ve got is deflection. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}