{
    "ehzx7c8": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ehzx7c8",
                "Author": "ap0cryphal",
                "Date Created": "03-07-2019 09:08:12",
                "Upvotes": 119,
                "Text": "I was surprised by how candid she was in that article about that topic and many others, which I appreciated. My feelings about her have fluctuated over time but I certainly feel like I’ve grown and evolved with her.",
                "Edited?": "03-07-2019 09:20:31",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ei0qjhy": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ei0qjhy",
                "Author": "cranberryb",
                "Date Created": "03-07-2019 14:32:17",
                "Upvotes": 37,
                "Text": "God, I remember being at the height of my ED struggles — around the time that 1989 came out — and reading an interview with her in an airplane magazine of all places. She said something like “I am literally always thinking about food” and maybe talked about eating only vegetables or restricting in some other way. It wasn’t presented as an ED thing, more of a “oh you know how diets are!” sort of thing, but man, I was sure it signified some ED stuff. I’m glad she seems to be doing better.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ei0xtt9": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ei0xtt9",
                "Author": "icy271",
                "Date Created": "03-07-2019 15:53:00",
                "Upvotes": 33,
                "Text": "I remember watching that 73 questions with Taylor swift video on YouTube and the guy asked her favourite food or something and she immediately was like \"if calories didn't count?\" Which I thought sounded kinda disordered but I figured I was just projecting because well i guess celebrities have to be a little careful about what they eat. Now I'm like, huh,  maybe I wasn't reading into it as much as I thought.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehzz8fb": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ehzz8fb",
                "Author": "DenverTheLastDinosau",
                "Date Created": "03-07-2019 09:32:04",
                "Upvotes": 128,
                "Text": "It's a nice point, she definitely looks healthier now she's gained some weight and it's very refreshing to see her embracing it. I don't know if that quote alone necessarily means she had / has an ED though, definitely not in my opinion. I felt like hating every ounce of fat on your body is actually a really horrible symptom for a lot of young women, ED or not, because of the pressure society has put on us.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ei04h4a": [
                {
                    "Parent ID": "t1_ehzz8fb",
                    "Comment ID": "ei04h4a",
                    "Author": "gigi-has-issues",
                    "Date Created": "03-07-2019 10:30:35",
                    "Upvotes": 53,
                    "Text": "True, it’s just my humble interpretation of “pushing the boundaries of dieting”. Still inspirational to me. 😇 ",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "ei0ir2m": [
                        {
                            "Parent ID": "t1_ei04h4a",
                            "Comment ID": "ei0ir2m",
                            "Author": "waystosaygoodbye33",
                            "Date Created": "03-07-2019 13:08:18",
                            "Upvotes": 21,
                            "Text": "I think it’s not so black and white! Eating behaviors are such a wide spectrum, and it’s not a black and white line between “dieting” and “disordered”. Diets can definitely morph into EDs, but it’s usually the feelings/anxiety and compulsions that define it. So she definitely had disordered behaviors - but most people exhibit those throughout life. \n\nIt’s surely possible!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ei0dp44": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ei0dp44",
                "Author": "chknsoup4thesoil",
                "Date Created": "03-07-2019 12:12:47",
                "Upvotes": 27,
                "Text": "sorry on a less serious note- Bleachella is hated? that’s my favourite look of hers. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ei0ekp5": [
                {
                    "Parent ID": "t1_ei0dp44",
                    "Comment ID": "ei0ekp5",
                    "Author": "gigi-has-issues",
                    "Date Created": "03-07-2019 12:22:26",
                    "Upvotes": 15,
                    "Text": "I liked it too! It was edgy! ",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "ei0ir2m": [
                [
                    {
                        "Parent ID": "t1_ei04h4a",
                        "Comment ID": "ei0ir2m",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-07-2019 13:08:18",
                        "Upvotes": 21,
                        "Text": "I think it’s not so black and white! Eating behaviors are such a wide spectrum, and it’s not a black and white line between “dieting” and “disordered”. Diets can definitely morph into EDs, but it’s usually the feelings/anxiety and compulsions that define it. So she definitely had disordered behaviors - but most people exhibit those throughout life. \n\nIt’s surely possible!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ei0gdkh": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ei0gdkh",
                "Author": "daikon_ashi",
                "Date Created": "03-07-2019 12:42:17",
                "Upvotes": 32,
                "Text": "There are loads of reasons not to like Taylor Swift (among other things, the entire Reputation era was... A lot). But I just keep coming back because a) I live for her music, and b) she's so smart and so, so real. It's amazing how she's been able to maintain humility and a growth mindset even at her level of fame. I relate so much to a lot of these, not just the one about body acceptance. The last one was a punch in the gut because I was the exact same as a child and I think that mindset is what's caused a lot of my eating/self-image issues.\n\nSidenote it's so fucked up how one of her fans who got a meet and greet complimented her on getting \"thick\" without knowing how she felt about her weight gain. That would have triggered me so much.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ei06baz": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ei06baz",
                "Author": "sintos-compa",
                "Date Created": "03-07-2019 10:50:46",
                "Upvotes": 22,
                "Text": "I think it’s amazing that she shared this, it will affect many young people struggling with issues like these, ED or just confidence. \n\nAlthough part of me is worried what awful sexism/fat shaming will come as a reaction. Meh, toxic people will be toxic I guess. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehzywxv": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ehzywxv",
                "Author": "radicalweenie",
                "Date Created": "03-07-2019 09:28:28",
                "Upvotes": 36,
                "Text": "I've followed alongside Taylor for ten years now and reading that broke my heart, the amount of speculation and ridicule she's received from the media over the years has just been horribly unwarranted and cruel. It's so sad that its taken her so long to reach this level of acceptance with her body but I'm glad she's being open about it, she's an incredible artist and role-model I urge everyone to read this article! ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ei0z7ob": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ei0z7ob",
                "Author": "[deleted]",
                "Date Created": "03-07-2019 16:09:01",
                "Upvotes": 9,
                "Text": "I kind of see it as her commenting on her recent weight gain, maybe she was unhappy with gaining weight but then realised there’s nothing actually wrong with it and she looks better and healthier now ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ei27toe": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ei27toe",
                "Author": "shacklackety",
                "Date Created": "03-08-2019 04:31:52",
                "Upvotes": 4,
                "Text": "There was an (unconfirmed) story tweeted by a fan at a Rep Room meet-and-greet where a fan asked how she “got so thick” to which Taylor responded she “got happy and ate well,” which could certainly imply some prior struggles with diet choices.\n\nIt really seems like Taylor is in a good place now, and this Elle piece definitely contributes to that perception! 😊",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ey61yd7": [
        [
            {
                "Parent ID": "t3_ayckkg",
                "Comment ID": "ey61yd7",
                "Author": "Hopeyourwell",
                "Date Created": "08-26-2019 13:52:35",
                "Upvotes": 1,
                "Text": "I think she really might have... On the Ellen show Taylor mentioned how she would sleep eat. Like she wouldn't remember doing it but her body would get up in the middle of the night and just rummage through the fridge to find things to eat. Ellen commented on how that sounded like a problem and Taylor just said \"yup\"",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}