{
    "f2eidj4": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2eidj4",
                "Author": "CoconutTime",
                "Date Created": "10-04-2019 08:35:32",
                "Upvotes": 179,
                "Text": "Same and alcohol makes me binge harder than being stoned does. Drunk me does not care about calories.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2eqr6o": [
                {
                    "Parent ID": "t1_f2eidj4",
                    "Comment ID": "f2eqr6o",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 10:14:33",
                    "Upvotes": 69,
                    "Text": "sameeee lmao. alcohol makes me so hungry for some reason, and then it’s SO hard to sleep afterwards because the alcohol/food metabolizing makes me so hot",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f2idyvb": [
                        {
                            "Parent ID": "t1_f2eqr6o",
                            "Comment ID": "f2idyvb",
                            "Author": "muathrowaway0",
                            "Date Created": "10-05-2019 01:11:11",
                            "Upvotes": 10,
                            "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2eg5nr": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2eg5nr",
                "Author": "luplum",
                "Date Created": "10-04-2019 08:05:18",
                "Upvotes": 123,
                "Text": "same, plus it's too expensive to be an alcoholic.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2fm35y": [
                {
                    "Parent ID": "t1_f2eg5nr",
                    "Comment ID": "f2fm35y",
                    "Author": "ImDemandingARefund",
                    "Date Created": "10-04-2019 15:07:53",
                    "Upvotes": 28,
                    "Text": ">too expensive to be an alcoholic \n\nBig mood.\n\nThe story of a journey.\n\n\nA *long* while back I went on a “mission” to stock up on a 151-192proof grain alcohol of quality. Wanted it so badly because I was giving far too much money to EvanWilliams, JackDaniels, & CaptainMorgan🥃 “*BuTi DIdnThAVeA pROblEmOr NEthANg!” \n\nI figured; “*Hey, it comes in the same 750mL bottles that are around the same price. A 190/192 proof is 95-96% ABV that means to get [gram amount] of pure ethanol alcohol into this tolerant body I only need to drink like half the amount of fluid I’d need to drink for a 100 proof distilled spirit— so a bottle will last twice as long and I can get down my drinks in a smaller time window theoretically. And as a bonus the purealcohol-to-calorie efficiency is also better. SO THIS IS PERFECT FOR ME! I’ll totes get shitfaced for cheap __if I take [medicine-name] and chug some jiggers mixed in a can of of Diet Coke on a totally empty stomach__ IT’LL SOLVE ALL MY PROBLEMS!*”\n\nLong story short: Despite Everclear/Spirytus not being illegal to transport/buy/trade/sell/own in every area of my stare (*in spite of what the web claims*) I couldn’t find a single place in my area or immediate surrounding areas that wanted to stock it or send it to me. Something to do with either the insurance or some tax they have to pay to stock it not being worth it because it was so niche and almost no one around who wasn’t a derelict alcoholic wanted it for more than novelty reasons. I didn’t really give up immediately because the allure of getting equally inebriated for half the price/effort was strong. I still failed and that failure probably saved me from alcohol poisoning tbh.\n\n\nIn conclusion: I decided to just start working 4 extra hours each week to pay for my alcohol painlessly and started skipping lunch again to save calories. Oof",
                    "Edited?": "10-04-2019 15:12:54",
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f2g27xy": [
                        {
                            "Parent ID": "t1_f2fm35y",
                            "Comment ID": "f2g27xy",
                            "Author": "tastefuldebauchery",
                            "Date Created": "10-04-2019 16:48:30",
                            "Upvotes": 11,
                            "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f2fa44y": [
                {
                    "Parent ID": "t1_f2eg5nr",
                    "Comment ID": "f2fa44y",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 13:30:09",
                    "Upvotes": 19,
                    "Text": "literally this lmao",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2ejgxj": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2ejgxj",
                "Author": "steffnizzle",
                "Date Created": "10-04-2019 08:49:36",
                "Upvotes": 46,
                "Text": "Same here, but I’ve got kids to take care of and a job I have to be functional for. I’d prefer to be hopped up on stimulants all day long, but I guess bingeing and restricting will have to suffice to distract me from my emotions.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2fdwud": [
                {
                    "Parent ID": "t1_f2ejgxj",
                    "Comment ID": "f2fdwud",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 14:04:47",
                    "Upvotes": 12,
                    "Text": "i’m in school + a work two jobs, so really this is all a never gonna happen fantasy for me too. i do drink an ungodly amount of coffee tho, so if rn caffeine is my true drug of choice",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f2g1uqd": [
                        {
                            "Parent ID": "t1_f2fdwud",
                            "Comment ID": "f2g1uqd",
                            "Author": "steffnizzle",
                            "Date Created": "10-04-2019 16:46:10",
                            "Upvotes": 4,
                            "Text": "Me too! I literally can’t function without it!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2ekt69": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2ekt69",
                "Author": "Nicolo_Ultra",
                "Date Created": "10-04-2019 09:06:08",
                "Upvotes": 49,
                "Text": "I save half of my calories everyday for my diet gin and tonics at the end of the night just so I can sleep. Feels bad man.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2eqtgf": [
                {
                    "Parent ID": "t1_f2ekt69",
                    "Comment ID": "f2eqtgf",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 10:15:14",
                    "Upvotes": 10,
                    "Text": "oof that sucks i’m sorry",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f2fmyvn": [
                {
                    "Parent ID": "t1_f2ekt69",
                    "Comment ID": "f2fmyvn",
                    "Author": "ImDemandingARefund",
                    "Date Created": "10-04-2019 15:13:31",
                    "Upvotes": 7,
                    "Text": ">just so I can sleep \n\nI know the feels :(",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f2g7jgb": [
                {
                    "Parent ID": "t1_f2ekt69",
                    "Comment ID": "f2g7jgb",
                    "Author": "SweetInstincts",
                    "Date Created": "10-04-2019 17:16:29",
                    "Upvotes": 5,
                    "Text": "Lol throw back to the period of time I used to snort Benadryl and take shots of gin just to get a few hours of sleep. But on a serious note that’s a fucking awful cycle to be in so if you need anyone to talk to lemme know luv.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2eoh83": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2eoh83",
                "Author": "cejuuda",
                "Date Created": "10-04-2019 09:48:58",
                "Upvotes": 19,
                "Text": "Ive been thinking about something like this lately.  I don't drink for the same reasons and I don't smoke because I know that I will become an addict and then I won't be able to over exercise",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2eqwpn": [
                {
                    "Parent ID": "t1_f2eoh83",
                    "Comment ID": "f2eqwpn",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 10:16:16",
                    "Upvotes": 7,
                    "Text": "literally this is part of it too. i just know i’m depressed enough/unhappy enough to use these things to cope at this point, so i either avoid them/engage sparingly",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2ew1bh": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2ew1bh",
                "Author": "Bruiseviolet_",
                "Date Created": "10-04-2019 11:03:54",
                "Upvotes": 19,
                "Text": "I hate alcohol. I’ve always had problems with it but once I got rlly bad (like going thru like half a litre or a litre bottle of spirits per night) I went from underweight to almost overweight pretty fast. I keep trying to go back to restricting but I can’t break out of this cycle of drinking. I hate it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2f9v7x": [
                {
                    "Parent ID": "t1_f2ew1bh",
                    "Comment ID": "f2f9v7x",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 13:28:01",
                    "Upvotes": 10,
                    "Text": "that’s really rough, i’m sorry",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f2fcqae": [
                        {
                            "Parent ID": "t1_f2f9v7x",
                            "Comment ID": "f2fcqae",
                            "Author": "Bruiseviolet_",
                            "Date Created": "10-04-2019 13:53:49",
                            "Upvotes": 4,
                            "Text": "Thank u x 💗",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2exvqu": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2exvqu",
                "Author": "[deleted]",
                "Date Created": "10-04-2019 11:20:58",
                "Upvotes": 18,
                "Text": "Can’t relate, I’m a classic drunkorexic",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2f3jev": [
                {
                    "Parent ID": "t1_f2exvqu",
                    "Comment ID": "f2f3jev",
                    "Author": "Aye-Rose",
                    "Date Created": "10-04-2019 12:23:28",
                    "Upvotes": 8,
                    "Text": "DAE drink to make it easier to purge. Been in that fun, new cycle for a while now 🥴🙃",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        },
        {
            "f2fdz9b": [
                {
                    "Parent ID": "t1_f2exvqu",
                    "Comment ID": "f2fdz9b",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 14:05:29",
                    "Upvotes": 7,
                    "Text": "okay ik i’m op but mood",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2ez4bh": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2ez4bh",
                "Author": "serendipitousbluejay",
                "Date Created": "10-04-2019 11:34:32",
                "Upvotes": 9,
                "Text": "alcohol actually makes me lose my appetite and keeps me feeling nauseous enough that i usually don’t want to eat much the next day 😩 if it didn’t make me so emotional i’d still be drinking and eating maybe one meal a day like my college days rip",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2eymge": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2eymge",
                "Author": "Henrycranium",
                "Date Created": "10-04-2019 11:29:06",
                "Upvotes": 9,
                "Text": "Drunkorexics rise up",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2epe7o": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2epe7o",
                "Author": "broketreebranch",
                "Date Created": "10-04-2019 09:59:15",
                "Upvotes": 6,
                "Text": "basically all of those reasons is why i have an eating disorder.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2f7m5v": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2f7m5v",
                "Author": "beebe20",
                "Date Created": "10-04-2019 13:07:37",
                "Upvotes": 7,
                "Text": "So that’s why I’m a pothead ✌🏽",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2fn8ir": [
                {
                    "Parent ID": "t1_f2f7m5v",
                    "Comment ID": "f2fn8ir",
                    "Author": "ImDemandingARefund",
                    "Date Created": "10-04-2019 15:14:13",
                    "Upvotes": 4,
                    "Text": "and you manage to survive the munchies?",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "f2gh9sf": [
                        {
                            "Parent ID": "t1_f2fn8ir",
                            "Comment ID": "f2gh9sf",
                            "Author": "brainsandb00bs",
                            "Date Created": "10-04-2019 18:09:53",
                            "Upvotes": 5,
                            "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2hfclx": [
                        {
                            "Parent ID": "t1_f2fn8ir",
                            "Comment ID": "f2hfclx",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 21:36:05",
                            "Upvotes": 4,
                            "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2hu7tk": [
                        {
                            "Parent ID": "t1_f2fn8ir",
                            "Comment ID": "f2hu7tk",
                            "Author": "beebe20",
                            "Date Created": "10-04-2019 23:04:42",
                            "Upvotes": 3,
                            "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2fcfma": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2fcfma",
                "Author": "ImDemandingARefund",
                "Date Created": "10-04-2019 13:51:17",
                "Upvotes": 5,
                "Text": "I think this is a very literal truth for many people with EDs but people who are “normal” don’t reallt get how literal it is.\n\nI was up to drinking several dozen drinks a day at one point because I couldn’t cope with life. I wasn’t even complacent with it I wanted to stop but couldn’t bring myself to.\n\nThen I relapsed into my ED and stopped all at once (*surprised I didn’t die or get hospitalized for delirium TBH*) because alcohol is one of my fear “foods” and my ED is stronger than my addiction. Oof.\n\n\n\nI didn’t realize just how much my power my ED had prior to this did cause a short period of me feeling like I was a fraud who was “faking” my addiction and it must of been just a choice. Oof. That’s makes no sense though because I kinda feel like I have nearly all the cliche/classic “very high functioning alcoholic” drinking-habit traits.",
                "Edited?": "10-04-2019 13:55:36",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2fd0d0": [
                {
                    "Parent ID": "t1_f2fcfma",
                    "Comment ID": "f2fd0d0",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 13:56:19",
                    "Upvotes": 5,
                    "Text": "yeah i think for a lot of us there is an “addictive” quality to the ED that makes it so so susceptible to being traded out w other common addictions. thats another big reason i for now i’m staying away; i’m not really eager to drop my ED for alcoholism lol",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2eloo9": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2eloo9",
                "Author": "[deleted]",
                "Date Created": "10-04-2019 09:16:38",
                "Upvotes": 5,
                "Text": "That's why I restrict- it essentially does the same thing.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2ff9az": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2ff9az",
                "Author": "Owlettorexic",
                "Date Created": "10-04-2019 14:17:52",
                "Upvotes": 5,
                "Text": "I wish I could use any of those, but I’m prescribed Klonopin for my anxiety which I actually need for when the anxiety is being an asshole. I’ve OD’d on it and boyfriend said I basically kept trying to kill myself. I don’t remember those three days at all. \n\nMarijuana makes me feel too much pain and anxiety. \n\nI’m allergic to alcohol. \n\nI wish there was a drug I could take that help me lose weight **and** be numb in some way.. just not too numb. Not too apathetic. I’ve been that way. I hate it. It’s so hard to explain, but it has permanently changed my view on life and suicide. It really felt like my world was in black and white. It was like my brain couldn’t care less about processing different colours or shapes because it just couldn’t spend enough fucks to even consider processing colour and other variables.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2ey2zc": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2ey2zc",
                "Author": "jeygglypuff",
                "Date Created": "10-04-2019 11:23:08",
                "Upvotes": 4,
                "Text": "Im similar. A reason I don’t do drugs is being afraid that it’ll cloud my brain enough to eat. \nAlso the money. I’d rather save money to buy diet pills or binge/purge food. *shrug*",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2f9zru": [
                {
                    "Parent ID": "t1_f2ey2zc",
                    "Comment ID": "f2f9zru",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 13:29:07",
                    "Upvotes": 3,
                    "Text": "oof as far as i know most diet pills are just diuretics and/or lax and/or caffeine to suppress ur appetite. i’d save ur money there too tbh",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f2hon91": [
                        {
                            "Parent ID": "t1_f2f9zru",
                            "Comment ID": "f2hon91",
                            "Author": "jeygglypuff",
                            "Date Created": "10-04-2019 22:29:52",
                            "Upvotes": 3,
                            "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fb35k": [
                [
                    {
                        "Parent ID": "t1_f2fawey",
                        "Comment ID": "f2fb35k",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:38:53",
                        "Upvotes": 2,
                        "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fb9u2": [
                        {
                            "Parent ID": "t1_f2fb35k",
                            "Comment ID": "f2fb9u2",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:40:36",
                            "Upvotes": 8,
                            "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2jmjz6": [
                [
                    {
                        "Parent ID": "t1_f2hon91",
                        "Comment ID": "f2jmjz6",
                        "Author": "bluediner",
                        "Date Created": "10-05-2019 06:24:40",
                        "Upvotes": 1,
                        "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fbibj": [
                [
                    {
                        "Parent ID": "t1_f2fb9u2",
                        "Comment ID": "f2fbibj",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:42:46",
                        "Upvotes": 3,
                        "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbqhu": [
                        {
                            "Parent ID": "t1_f2fbibj",
                            "Comment ID": "f2fbqhu",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:44:46",
                            "Upvotes": 9,
                            "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcbd6": [
                [
                    {
                        "Parent ID": "t1_f2fbqhu",
                        "Comment ID": "f2fcbd6",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 13:50:10",
                        "Upvotes": 0,
                        "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fdhwc": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fdhwc",
                            "Author": "crankyhedgiebutt",
                            "Date Created": "10-04-2019 14:00:43",
                            "Upvotes": 3,
                            "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcqsl": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcqsl",
                            "Author": "bluediner",
                            "Date Created": "10-04-2019 13:53:57",
                            "Upvotes": 4,
                            "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "f2fcrhf": [
                        {
                            "Parent ID": "t1_f2fcbd6",
                            "Comment ID": "f2fcrhf",
                            "Author": "Tylly",
                            "Date Created": "10-04-2019 13:54:08",
                            "Upvotes": 1,
                            "Text": "YASSSSSS HERE FOR THIS TEA",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2frwcu": [
                [
                    {
                        "Parent ID": "t1_f2fdhwc",
                        "Comment ID": "f2frwcu",
                        "Author": "dragoono",
                        "Date Created": "10-04-2019 15:43:59",
                        "Upvotes": 3,
                        "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2fjval": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2fjval",
                "Author": "im_nice_trust_me",
                "Date Created": "10-04-2019 14:54:02",
                "Upvotes": 3,
                "Text": "I enjoy alcohol, but don’t let myself drink liquor anymore because I drink so fast that I just get sick and end up hungover the next day. It’s just not worth it, so I stick to beer and wine when I drink, but that’s almost worse because calories. Then if I do end up getting the drunk munchies, it’s double worse because I’ll just binge on top of the alcohol calories!\n\nSmoking is so much better to me, even if I end up getting the munchies for a bit, because at least then I can convince myself to eat the fruit in the fridge rather than burgers and tacos and cookies like when I’m drunk (I only want shit food when I’m drunk). It helps with my depression on the daily, makes me more optimistic, and I’m so much less anxious overall. The problem about it is that I have an addictive personality, and smoking doesn’t impair my ability to do normal tasks (the reason why I don’t drink a lot) so it’s hard for me to not be constantly high when I have weed at my disposal. God forbid I ever get into cartridges, I’d never be sober. 🤦🏾‍♀️",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2h8dub": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2h8dub",
                "Author": "naytertotsandwich",
                "Date Created": "10-04-2019 20:57:49",
                "Upvotes": 3,
                "Text": "Im an admitted alcoholic so I restrict so I CAN drink. Its disgusting. Stay tf away from alcohol if you can. Its terrible. Honestly? I was almost recovered until I became an alcoholic and learned alcohol has calories. The coexisting issues are a bear to deal with. Its awful. Stay tf away while you still can.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2ev1b6": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2ev1b6",
                "Author": "norashepard",
                "Date Created": "10-04-2019 10:54:56",
                "Upvotes": 3,
                "Text": "ED relapse coincided with my quitting alcohol. Not sure which really came first but yeah.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2f9nyf": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2f9nyf",
                "Author": "spaceindividual",
                "Date Created": "10-04-2019 13:26:10",
                "Upvotes": 3,
                "Text": "This plus the breakouts I get",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2f5enk": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2f5enk",
                "Author": "reptarcum",
                "Date Created": "10-04-2019 12:44:12",
                "Upvotes": 5,
                "Text": "I'm so drunkorexic, I wish I could care about the calories but it's far too enticing to numb the pain. It's so goddamn fucking annoying that I eat at MOST one \"meal\" a day and vomit regularly but I don't seem to lose much weight. Thanks a lot, booze.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2fweh4": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2fweh4",
                "Author": "PiperLoves",
                "Date Created": "10-04-2019 16:13:11",
                "Upvotes": 2,
                "Text": "Only reason im not is cause im only 20 so its way easier (and cheaper) to settle for weed",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2g0cjt": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2g0cjt",
                "Author": "Lemon_bird",
                "Date Created": "10-04-2019 16:38:16",
                "Upvotes": 2,
                "Text": "i smoke a lot and i actually need to cut back cause the munchies kill my progress",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2g2a0i": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2g2a0i",
                "Author": "oihl",
                "Date Created": "10-04-2019 16:48:52",
                "Upvotes": 2,
                "Text": "same",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2g2gz4": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2g2gz4",
                "Author": "byie",
                "Date Created": "10-04-2019 16:50:03",
                "Upvotes": 2,
                "Text": "Same, I’d be a crackhead if it wasn’t so expensive",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2h7xj9": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2h7xj9",
                "Author": "kinkyveggielover96",
                "Date Created": "10-04-2019 20:55:18",
                "Upvotes": 2,
                "Text": "This entire thread is too much me. On really bad nights I'd drink and eat and b/p so I could eat and drink more...and then b/p...no bueno.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2hitue": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2hitue",
                "Author": "ilula",
                "Date Created": "10-04-2019 21:55:43",
                "Upvotes": 2,
                "Text": "I was a full time stoner for six years (lol) and found that once you start smoking all the time it completely kills your appetite so it perpetuated the problem for me. My appetite was completely gone with the added bonus of being that high i didn’t feel nauseous from not eating either it was great. Now I’m a year sober and 10 kilos heavier than I was and I’d give anything to be able to sit around and be stoned 24/7 again. Although I’ve progressed a lot in life this past year it feels like none of it matters “BeCauSE IM FaT aND HaTE MySeLF” wow I hate this illness, fuck. 😅",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2i4vgs": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2i4vgs",
                "Author": "holicisms",
                "Date Created": "10-05-2019 00:11:04",
                "Upvotes": 2,
                "Text": "Despite having a personality that latches on to things easily, and having tried various drugs, nothing ever really stuck.\n\nFood is the only thing that gives me problems🥺",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2idtia": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2idtia",
                "Author": "muathrowaway0",
                "Date Created": "10-05-2019 01:10:08",
                "Upvotes": 2,
                "Text": "I'm doing it anyway, tbh it's great motivation to not eat at all so you can get plastered later and stay in your calorie intake range\n\nshoutout to r/drunkorexia",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2fa3sc": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2fa3sc",
                "Author": "dragoono",
                "Date Created": "10-04-2019 13:30:05",
                "Upvotes": 3,
                "Text": "Ehhh, look I know this isn't the point of your post here but I want to pitch in. I'm sort of stoned right now, and it honestly helps with my ED. Sure, if I eat a few edibles every day for a month I would be completely fried, but I've found in reasonable amounts it really calms down my anxiety. It also makes me more introspective, while avoiding all the self-righteous attitudes that might come with a deep look into your own soul. You can do these things in a sober mind, but weed is a nice shortcut. I'm eating a big bowl of vegetable soup right now, because while I was smoking in the quarry I realized that the better I treat myself, the better I'm treating everyone around me. If I'm in pain, mentally or physically, it's not just me who has to deal with that. I'm putting that stuff on everyone I interact with, whether I want to or not, so taking better care of myself is like caring about the people I love more than anything. \n\nSorry for the rambling, but seeing \"useless fucking stoner\" made me mad. It makes me question myself, even though I know what I'm doing is okay and good for me. Maybe it would be good for you too, even though it's a hassle to get and expensive.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f2fawey": [
                {
                    "Parent ID": "t1_f2fa3sc",
                    "Comment ID": "f2fawey",
                    "Author": "bluediner",
                    "Date Created": "10-04-2019 13:37:12",
                    "Upvotes": 9,
                    "Text": "i’m also not trying to be rude but you’re projecting.",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                },
                {
                    "f2fb35k": [
                        {
                            "Parent ID": "t1_f2fawey",
                            "Comment ID": "f2fb35k",
                            "Author": "dragoono",
                            "Date Created": "10-04-2019 13:38:53",
                            "Upvotes": 2,
                            "Text": "How am I projecting right now? Is it the thing I said about \"if I'm taking care of myself, I'm also taking care of the people I love\" because that's literally how my life is working right now. I don't know how that could be a negative thing.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2idyvb": [
                [
                    {
                        "Parent ID": "t1_f2eqr6o",
                        "Comment ID": "f2idyvb",
                        "Author": "muathrowaway0",
                        "Date Created": "10-05-2019 01:11:11",
                        "Upvotes": 10,
                        "Text": "oH MY GOD YES drinking makes me want to consume cereal so badly. I've gone through 5 bags of cereal this week alone. I don't get it. Surely there has to be an upper limit to how much cereal I consume?? Right??",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g27xy": [
                [
                    {
                        "Parent ID": "t1_f2fm35y",
                        "Comment ID": "f2g27xy",
                        "Author": "tastefuldebauchery",
                        "Date Created": "10-04-2019 16:48:30",
                        "Upvotes": 11,
                        "Text": "You just described my 96% (not proof) polish vodka that I occasionally get my hands on.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2g1uqd": [
                [
                    {
                        "Parent ID": "t1_f2fdwud",
                        "Comment ID": "f2g1uqd",
                        "Author": "steffnizzle",
                        "Date Created": "10-04-2019 16:46:10",
                        "Upvotes": 4,
                        "Text": "Me too! I literally can’t function without it!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcqae": [
                [
                    {
                        "Parent ID": "t1_f2f9v7x",
                        "Comment ID": "f2fcqae",
                        "Author": "Bruiseviolet_",
                        "Date Created": "10-04-2019 13:53:49",
                        "Upvotes": 4,
                        "Text": "Thank u x 💗",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2gh9sf": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2gh9sf",
                        "Author": "brainsandb00bs",
                        "Date Created": "10-04-2019 18:09:53",
                        "Upvotes": 5,
                        "Text": "Try to buy strains where the munchies isn’t a huge side effect (check leafly, some types will give you munchies more so than others). Don’t smoke when you’re hungry or on an empty stomach, drink a lot of water before you start, and keep some water nearby to keep sipping while you’re high.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hfclx": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hfclx",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 21:36:05",
                        "Upvotes": 4,
                        "Text": "whenever i do smoke, i usually just keep interesting zero/low cal beverages on hand + maybe some fruit. or i just do it before a meal if i’m gonna smoke during the day",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hu7tk": [
                [
                    {
                        "Parent ID": "t1_f2fn8ir",
                        "Comment ID": "f2hu7tk",
                        "Author": "beebe20",
                        "Date Created": "10-04-2019 23:04:42",
                        "Upvotes": 3,
                        "Text": "All of these yes. Especially the water it fills me up so much that even when I do eat, my tummy is so full of water I can’t eat much. Also some times I’ll save my cals for a smoke sesh and then plan and prepare the meal before smoking and even low cal stuff is bomb af.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "f2hon91": [
                [
                    {
                        "Parent ID": "t1_f2f9zru",
                        "Comment ID": "f2hon91",
                        "Author": "jeygglypuff",
                        "Date Created": "10-04-2019 22:29:52",
                        "Upvotes": 3,
                        "Text": "Oh definitely. But, my brain is never reasonable when it comes to ed matters.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2jmjz6": [
                        {
                            "Parent ID": "t1_f2hon91",
                            "Comment ID": "f2jmjz6",
                            "Author": "bluediner",
                            "Date Created": "10-05-2019 06:24:40",
                            "Upvotes": 1,
                            "Text": "oh I totally understand <3 i just wanted to let you know in case u didn’t already already. best of luck",
                            "Edited?": false,
                            "Is Submitter?": true,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fb9u2": [
                [
                    {
                        "Parent ID": "t1_f2fb35k",
                        "Comment ID": "f2fb9u2",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 13:40:36",
                        "Upvotes": 8,
                        "Text": "listen I feel like you’re maybe getting more defensive than is called for. i’m referring to your entire last paragraph. it’s nice that smoking regularly works for you, but for me, it literally turns me into a “useless fucking stoner” and i have two jobs and i’m in school. that’s not in the cards right now.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fbibj": [
                        {
                            "Parent ID": "t1_f2fb9u2",
                            "Comment ID": "f2fbibj",
                            "Author": "dragoono",
                            "Date Created": "10-04-2019 13:42:46",
                            "Upvotes": 3,
                            "Text": "Yeah, I have a pretty fragile ego. A simple, \"that's nice but weed doesn't work like that for me\" would've been fine. Your original comment read as snarky.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fbqhu": [
                [
                    {
                        "Parent ID": "t1_f2fbibj",
                        "Comment ID": "f2fbqhu",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 13:44:46",
                        "Upvotes": 9,
                        "Text": "that wasn’t my intention! i really meant it when i said i wasn’t trying to be rude. but i do think you should consider that maybe telling someone to further engage in a behavior that they already know is used to numb themselves rather than as a healing instrument in the way you benefit is somewhat tone deaf/bizarre.",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ],
                {
                    "f2fcbd6": [
                        {
                            "Parent ID": "t1_f2fbqhu",
                            "Comment ID": "f2fcbd6",
                            "Author": "dragoono",
                            "Date Created": "10-04-2019 13:50:10",
                            "Upvotes": 0,
                            "Text": "Jeez, okay, you can't just say \"no offense\" and then continue to be rude. I wasn't trying to be \"tone deaf\", all I was saying is that although its really easy to go over your limits with pot (and other drugs) I've found that finding this balance has helped me a LOT. I tried to recover on my own, but I don't think I can because this is take 3. I thought if I pitched in my experience, you might hear something you needed to hear. Just trying to be potentially helpful to you, or anyone who might read my comment. Its been working for me, and it might work for someone else. I'm sorry that it doesn't for you, let's just forget this conversation ever happened, touche?",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fdhwc": [
                [
                    {
                        "Parent ID": "t1_f2fcbd6",
                        "Comment ID": "f2fdhwc",
                        "Author": "crankyhedgiebutt",
                        "Date Created": "10-04-2019 14:00:43",
                        "Upvotes": 3,
                        "Text": "How do you balance it? I’m curious because I have such a hard time not getting blazed all day erryday when I have it. \n\nI’ve been out for like two weeks or so and I’m dying! I’ve been drinking way more instead. I actually decided after last night that I can no longer do liquor. If I could find a healthy balance with weed I think I could be better off. \n\nI would love your input/experiences. Sorry to hijack y’alls debate thread!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "f2frwcu": [
                        {
                            "Parent ID": "t1_f2fdhwc",
                            "Comment ID": "f2frwcu",
                            "Author": "dragoono",
                            "Date Created": "10-04-2019 15:43:59",
                            "Upvotes": 3,
                            "Text": "Honestly, I find this hard too. What's been working for me lately is to buy in smaller amounts. You'll spend more money in the long run this way, but the less I have on hand the less likely I am to go out and buy more to smoke. This helps me space it out, like if I had bought 4 grams the last time and smoked it all in a couple weeks, I can take a break for a while. Also, make it harder for yourself to find the time and place to smoke. Keep yourself busy, with fun things or productive things, so that it can be a once a day treat. \nI'm no master on limiting my use, so take my advice with a grain of salt. This is just what's been working for the past few days. The thing is, I don't have my own place. The lady I'm living with is someone I respect, and she knows I smoke but doesn't want me to smoke inside. She says as long as I smoke in the backyard or something, she has no problem with it. So, when it's dark or cold, its harder for me to smoke. This means I have a limited window during the day for it, and if I miss that window, I don't smoke that day. Maybe a way to do this for yourself, is to arrange your daily life in a way that gives you that little smoking window. Something to think about, hope I helped!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "f2fcqsl": [
                [
                    {
                        "Parent ID": "t1_f2fcbd6",
                        "Comment ID": "f2fcqsl",
                        "Author": "bluediner",
                        "Date Created": "10-04-2019 13:53:57",
                        "Upvotes": 4,
                        "Text": "oof okay obviously you’re not in a place to have a mature conversation/take constructed (and honestly necessary) critique wrt to how you engage with others",
                        "Edited?": false,
                        "Is Submitter?": true,
                        "Stickied?": false
                    }
                ]
            ],
            "f2fcrhf": [
                [
                    {
                        "Parent ID": "t1_f2fcbd6",
                        "Comment ID": "f2fcrhf",
                        "Author": "Tylly",
                        "Date Created": "10-04-2019 13:54:08",
                        "Upvotes": 1,
                        "Text": "YASSSSSS HERE FOR THIS TEA",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "f2esabk": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2esabk",
                "Author": "pixiewynn",
                "Date Created": "10-04-2019 10:30:46",
                "Upvotes": 2,
                "Text": "True dat sister.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2fs2mu": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2fs2mu",
                "Author": "pizzaslut91",
                "Date Created": "10-04-2019 15:45:27",
                "Upvotes": 3,
                "Text": "Not everyone who is a stoner is “completely fucking” useless and honestly I’d take weed over drinking and popping pills. I’ve worked and went to university and still smoked I’m even less functional drinking. Alcoholism isn’t anymore fun than having an ED, it’s best not to charge the negative energy into any self destructive ways and just deal with it and find other coping strategies.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f5o1hgq": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f5o1hgq",
                "Author": "misscrybaby",
                "Date Created": "10-28-2019 19:12:23",
                "Upvotes": 1,
                "Text": "I just drink vodka and Soda water 🤷🏼‍♀️",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f9449h8": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f9449h8",
                "Author": "codedlemons",
                "Date Created": "11-29-2019 19:21:34",
                "Upvotes": 1,
                "Text": "Drunk me just wants to eat saltines and plain slices of bread. She's an asshole",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f2h4glm": [
        [
            {
                "Parent ID": "t3_dd6in9",
                "Comment ID": "f2h4glm",
                "Author": "darkettecs",
                "Date Created": "10-04-2019 20:34:32",
                "Upvotes": 1,
                "Text": "I used to be in this same place, but meditation, breathwork & yoga really helped me. I have not counted a single calorie in 4 months but if I had to guess, I'm eating between 2,700-3,500 a day. I have so much more energy, my hair is freaking long & shiny (down to my butt), my nails grow super fast too, I now loooove moving & don't force myself to workout in any way that I don't feel like. I also am working with a mentor & have been very open about my eating disorder & addiction tendencies with loved ones to keep myself accountable & to give full recovery an honest try this 2nd time around. Please don't give up on yourself 🙏💚",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}