{
    "ejq3z94": [
        [
            {
                "Parent ID": "t3_b76gii",
                "Comment ID": "ejq3z94",
                "Author": "arabella_05",
                "Date Created": "03-30-2019 05:29:55",
                "Upvotes": 38,
                "Text": "your eggo story hits home, fuck. my mum used to buy multipacks of crisps for me and my sibling to take to school or have a packet after dinner. i'd turn on the tap and open two packets, put the contents of one into the other and hide the empty packet in the bottom of the bin. i thought i was so sly lol, no one will ever know i'm having 2 in 1 !! \n\ni have never been on the low low end of the bmi scale but lord knows i've suffered enough for my ed, i'm so done with the idea that once your bmi hits 18.49 you get the biggest trophy or the biggest award for 'crossing a finish line'. it's bullshit. and the tumblr-esque approach to having an ed and feeling almost proud of being so tiny is very very toxic and i see that attitude seeping through into this sub sometimes. and i totally understand that we are all victims of disordered habits and therefore it'll have a direct effect on the way we all think and rationalise things - but when there's comments egging on anorectic behaviours because 'you haven't yet hit an underweight bmi', it becomes unhealthy for not only the OP but for anyone who reads that and is totally invalidated by a random, uninformed comment. \n\nyour struggle is not defined by your weight. anyone who struggles with binging and restricting will know this all too well - your eating habits can go from 0 to 100 and the scale is at a standstill. i wish you all the best, OP, and thank you for this post i really needed to read it today. 💕",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejq0ka6": [
        [
            {
                "Parent ID": "t3_b76gii",
                "Comment ID": "ejq0ka6",
                "Author": "ziyal79",
                "Date Created": "03-30-2019 03:49:51",
                "Upvotes": 30,
                "Text": "Thank you so much for this post! I’ve saved it so that I can come back to it when I need a reminder. I wish I could think clearly enough to write something more meaningful (yay, anaemia, right?), but thank you!\n\nAlso, is there a link to your TED talk?",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ejqt7eo": [
                {
                    "Parent ID": "t1_ejq0ka6",
                    "Comment ID": "ejqt7eo",
                    "Author": "skelekey",
                    "Date Created": "03-30-2019 11:56:24",
                    "Upvotes": 11,
                    "Text": "Thank you for the kind words!\n\n[Here](https://youtu.be/dQw4w9WgXcQ) is the link to my TED talk :)",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ]
        }
    ],
    "ejqbhx2": [
        [
            {
                "Parent ID": "t3_b76gii",
                "Comment ID": "ejqbhx2",
                "Author": "bathroomhaunt",
                "Date Created": "03-30-2019 08:17:32",
                "Upvotes": 12,
                "Text": "honestly op, thank you for posting this bc youre so right! i wish people wouldnt act as if hitting a very low weight is the only thing that makes an ed dangerous. the mindset, the lack of important nutrients and vitamins, the extremes we can go to are dangerous things too. ive never been underweight, but ive still fainted at the gym, ive struggled with laxative abuse and even straight up misused prescription drugs all in the name of my ed, and plenty of other shit that messes with my body and my mind. if someone is suffering they deserve support, it doesnt matter if their bmi says theyre underweight or overweight or anything in between. we all struggle. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejpxnmr": [
        [
            {
                "Parent ID": "t3_b76gii",
                "Comment ID": "ejpxnmr",
                "Author": "mikomikomikomikomiko",
                "Date Created": "03-30-2019 02:25:27",
                "Upvotes": 28,
                "Text": "I'm sure way too many people on this sub needed to hear this 🙁 sometimes ED communities push this idea that you have to look like you're on the verge of dying in order for your disorder to be \"real\" but your experience makes it perfectly clear that is not the case.  \n\n\nIf people knew how much suffering goes on even when you're not bone thin they would understand how serious eating disorders get, and that the danger doesn't just primarily come from being underweight. I wish it was easier to explain to people that haven't been there. I hope you're staying safe and taking care of yourself!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejqem3b": [
        [
            {
                "Parent ID": "t3_b76gii",
                "Comment ID": "ejqem3b",
                "Author": "snakessssssssss",
                "Date Created": "03-30-2019 09:04:23",
                "Upvotes": 9,
                "Text": "I really appreciate you posting this. I’ve struggled with ED for almost 20 years and have never been underweight, yet it has caused me an insane amount of mental and emotional suffering, has damaged many of my relationships... it is so much more than a physical thing to have an ED. It changes the whole way you perceive the world.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejqkzzk": [
        [
            {
                "Parent ID": "t3_b76gii",
                "Comment ID": "ejqkzzk",
                "Author": "N0Th4nkY0u",
                "Date Created": "03-30-2019 10:22:42",
                "Upvotes": 5,
                "Text": "Thank you for sharing! I needed to see this. One of the hardest days of my life is when I tried to tell my mother that I have an ED and I wanted to see a therapist and she didn’t believe me because I was “too fat to have an eating disorder.”   I proceeded into a dark hole of a binge/purge cycle. This sub emulates that feeling sometimes. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}