{
    "f415vsr": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f415vsr",
                "Author": "[deleted]",
                "Date Created": "10-17-2019 07:21:56",
                "Upvotes": 1,
                "Text": "Thank you for making this post, I agree completely. I haven’t been at this sub in some time as I’m trying to recover (but I’ll try to mod more!), but I’ve noticed an influx of newcomers and members who’ve not read the rules properly. \n\n Please take the time to read the rules, for the sake of the sub’s survival, and for the sake of each other. It also helps the mods so much when y’all report, so thank you to those that do.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": true
            }
        ]
    ],
    "f3xpmkm": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3xpmkm",
                "Author": "broketreebranch",
                "Date Created": "10-16-2019 11:06:22",
                "Upvotes": 111,
                "Text": "You can get all those tips on the extreme dieting subs anyway because as long as no one admits they have an eating disorder using ED behaviors is just lIvInG a hEaLtHy lIfEsTyLe.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f3xafyp": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3xafyp",
                "Author": "[deleted]",
                "Date Created": "10-16-2019 09:08:36",
                "Upvotes": 108,
                "Text": "Its literally rule number 1 in the sub to not do that. Just be sure to report rule violating posts. Reddit won't ban a sub because random folks dont follow the rules, so we just need to make a concerted effort to help the mod team by actively reporting.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f3y9nnm": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3y9nnm",
                "Author": "rachihc",
                "Date Created": "10-16-2019 13:31:39",
                "Upvotes": 34,
                "Text": "Only tips are how to get to therapy, how to take care of myself, how to cheer me up, self care. We want everyone here safe and well.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f3ya6z1": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3ya6z1",
                "Author": "RenBumah",
                "Date Created": "10-16-2019 13:35:30",
                "Upvotes": 28,
                "Text": "Yes! The title alarmed me because this isn't a pro ed subreddit. It's just a place where people with EDs/disordered eating can come together and rant about our issues and make one another feel comfortable with eating.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f3xspoq": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3xspoq",
                "Author": "[deleted]",
                "Date Created": "10-16-2019 11:28:05",
                "Upvotes": 42,
                "Text": "Please i really dont want to lose this sub again! Proed was so good and when it was deleted it broke my heart i actually cried over loss of this community. Please everyone were just here to be a support group for each other",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f3y9r6f": [
                {
                    "Parent ID": "t1_f3xspoq",
                    "Comment ID": "f3y9r6f",
                    "Author": "HausDeKittehs",
                    "Date Created": "10-16-2019 13:32:22",
                    "Upvotes": 25,
                    "Text": "I cried too. I remember all the subs created to replace it kept getting banned too. I felt so hopeless and alone. Some amazing soul created like a petition site in which you could vote about why you used the sub and it had a spot to write a story about how the sub impacted your ED. I always wonder if that made a difference, but here we are! I love this little community!",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "f3yl8yt": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3yl8yt",
                "Author": "Nearby_Associate",
                "Date Created": "10-16-2019 14:54:04",
                "Upvotes": 16,
                "Text": "Say it louder for the people in the back \n\nThis reddit community has been so far the only community where actually people can support eachother and where I feel safe. It seems at least to me that especially in non-English speaking countries - like where I live - and their ed forums get incredibly toxic real quick. I don’t know if people in here are just more shittier or if it has something to do with the language - English is def more polite one - or that people just don’t know how to have a conversation on the internet lol\n\nSo I love you guys and I need you guys, let’s keep this place safe and report that kind of behaviour",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "f3yrnw9": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3yrnw9",
                "Author": "[deleted]",
                "Date Created": "10-16-2019 15:40:49",
                "Upvotes": 14,
                "Text": "[deleted]",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f3zafu0": [
                {
                    "Parent ID": "t1_f3yrnw9",
                    "Comment ID": "f3zafu0",
                    "Author": "wistar_rat",
                    "Date Created": "10-16-2019 17:29:29",
                    "Upvotes": 11,
                    "Text": "\"how can I be more mentally ill thx skinnies xoxoxo\"",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "f3zbjdt": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3zbjdt",
                "Author": "briohny",
                "Date Created": "10-16-2019 17:42:27",
                "Upvotes": 7,
                "Text": "Hi, a new user here and wanted to chime in although this might be a little but off topic... Are new users a positive thing or negative thing? Are og:s glad that the sub is expanding? Is it ok to be active and comment a lot if you're new here or will the og:s feel offended? Also, I understand that this is a place where it's free to vent out your feelings but if someone literally asks for advice it's ok to give that as in medical advice? I have one year left of med school so I actually have some knowledge a strong reflex to answer/help but as a new user felt insecure so I don't want to comment too much/offend the og:s etc.\nI feel like my questions seem dumb written out but I'm going to post anyway since I think other new sunscribers might be wondering abt same things. :).",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "f416nzp": [
                {
                    "Parent ID": "t1_f3zbjdt",
                    "Comment ID": "f416nzp",
                    "Author": "[deleted]",
                    "Date Created": "10-17-2019 07:27:35",
                    "Upvotes": 3,
                    "Text": "Hi there and welcome! New users are always welcome (I think I can say this safely on behalf of everyone) and even though it’s sad to see others struggling too, we’re happy to grow our community to be aafe and supportive to everyone. It doesn’t matter how new you are to the sub or your ED history. There’s no “us vs them” mentality, I think the OG’s are more cautious seeing as we lost our original community.\n\nThe aim of the sub is to be primarily emotional support. As a fellow meddie, I think it’s okay to share harm reduction advice with some links to evidence-based literature or gold-standard practices etc",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        },
        {
            "f416xlp": [
                {
                    "Parent ID": "t1_f3zbjdt",
                    "Comment ID": "f416xlp",
                    "Author": "im__a__mess",
                    "Date Created": "10-17-2019 07:29:28",
                    "Upvotes": 3,
                    "Text": "Definitely a positive! I'm glad more people are finding this wonderful community. We just want people to keep to the rules of posting because we don't want this sub to get banned like the last one.\n\nKudos to you for surviving med school so far! I'm just beginning that journey haha. That being said, we tend to try to avoid diagnosing people/offering medical advice and try to encourage them to instead talk to their actual doctor. There are so many factors that couldn't be conveyed over the internet, so better that than accidentally give wrong or harmful advice. Otherwise though, I hope find some comfort in this sub; I know I do!",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "f3zecdz": [
        [
            {
                "Parent ID": "t3_dip6hr",
                "Comment ID": "f3zecdz",
                "Author": "TheCarbdashian",
                "Date Created": "10-16-2019 18:14:46",
                "Upvotes": 3,
                "Text": "This got me all teary eyed",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}