{
    "ejda5ed": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejda5ed",
                "Author": "solaris-et-lunara",
                "Date Created": "03-25-2019 16:12:30",
                "Upvotes": 225,
                "Text": "You’re a totally great friend and I bet she appreciates you for helping out. I think we all know that we struggle with different things in our life and that may be really hard for her. \n\nIt’s not bad at all for you to say that— in fact I know exactly how you feel. Idk, I don’t have anything too constructive to say. But good on you for being so caring",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejdsbf2": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdsbf2",
                "Author": "frozenmargaritas",
                "Date Created": "03-25-2019 19:43:51",
                "Upvotes": 132,
                "Text": "I love you both. As a fat girl with an ED people just don’t get how exhausting life is because ur either dizzy from lack of food or tired from binges and lugging around extra weight and u sound like a great friend that just gets it. Don’t think of yourself as the fat friend but just the yin to her yang who gets why you’d eat only a kale salad all day and then need to sit down for the rest of it. Just cause you guys look different doesn’t mean you don’t potentially have the same issues with food. I wish I had friends who got that. You both sound cute & sweet and like good people. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "eje0gxl": [
                {
                    "Parent ID": "t1_ejdsbf2",
                    "Comment ID": "eje0gxl",
                    "Author": "tseokii",
                    "Date Created": "03-25-2019 21:25:10",
                    "Upvotes": 26,
                    "Text": "this right here is a good comment.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ],
    "ejdgrfk": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdgrfk",
                "Author": "paperklipp",
                "Date Created": "03-25-2019 17:25:57",
                "Upvotes": 112,
                "Text": "You sound like an amazing friend. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejdiidf": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdiidf",
                "Author": "paperclip1213",
                "Date Created": "03-25-2019 17:46:18",
                "Upvotes": 81,
                "Text": "She's really lucky to have a friend like you. If she doesn't say it herself, she's definitely thinking it.\n\nYou're good to have sacrificed those things to make her more comfortable. Not enough friends like you exist.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejdk9fm": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdk9fm",
                "Author": "arabella_05",
                "Date Created": "03-25-2019 18:07:02",
                "Upvotes": 41,
                "Text": "if everyone had an ounce of the kindness you have in your heart, we would all be so much better off in this world. it's the equivalent of seeing someone be talked over in a conversation and maintaining eye contact with them, and asking them to continue their story. i hope you are as kind to yourself as you are to others because you really truly deserve it. 💕",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejdmjbl": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdmjbl",
                "Author": "linedryonly",
                "Date Created": "03-25-2019 18:34:10",
                "Upvotes": 26,
                "Text": "I have a dynamic like this with one of my friends. She's almost exactly the same size as your friend and I just love her so much and don't want anyone to look down on her for her size. I feel like a hypocrite though because I love her  completely and independently from how she looks (which is beautiful, btw) and yet I hate myself for having a BMI over 20 and being ugly. I'm lucky she's willing to put up with my bullshit because I definitely don't deserve her as a friend.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eje8m5p": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "eje8m5p",
                "Author": "kVIIIwithan8",
                "Date Created": "03-25-2019 23:22:13",
                "Upvotes": 20,
                "Text": "I'ma tell a story. Tl;Dr at end. \n\nI have some pretty severe anxiety (I struggle still but am getting much better with an ED and PTSD) and as a result some things are just... Wayyyy too much for me. I need a *lot* of space sometimes just to get through the day. But sometimes, I can't bend the world to meet my needs. That's when my partner steps in and tries to mitigate and do damage control. \nWe made plans to go visit a few friends and agreed to stop at the grocery store to pick up wine and some stuff to cook. I was having a tough day already and grocery stores are notoriously difficult for me, but I went in anyway to try and be a trooper. When we got in, I had to pick something that I would make (I'm the only vegan so I often end up dictating the food choices, pros and cons for me because I love getting to control my food but I hate feeling responsible for other people's happiness, it's too much pressure). I start scanning the aisles, I go up and down each one a thousand times and that anxiety starts to set in. My partner finds me in the frozen aisle looking like I'm about to cry. He asks what's wrong and the best I can come out with is \"I hate this\". He figures it out pretty quickly and asks me to go back to the car, he'll pick something. \nI'm feeling angry and embarrassed at that point, I  march back to the car and do a bit of yelling and telling myself that I'm stupid and why do I let things get to me, etc. \nHe comes back and says \"hey I picked something out and I think it'll be perfect, you're gonna love it  and it's vegan, ill cook it when we get there so you can just chill\" at that point I was grateful but so mad at myself for falling apart. I was in a terrible mood. We got to the address and he asks me if I need to take a minute. Im upset and grumpy so I say \"I don't know\". He reads between the lines and says \"if you want to, you can hang out here and just have some 'you' time. I'll tell them you're on the phone with work. Just text me when you're going to come in and I'll start cooking\". I nod, still grumpy and not appropriately appreciative. He heads in, feeds them the lie, and they just chat and hang out, as far as they know I'm doing great, not hiding in the car pulling myself together. I take about 30minutes before putting on my big girl pants and heading in. They never knew. \n\nBasically, I'm saying OP you're a treasure. Regardless of what your friend is struggling with, you helping her out is a really cool thing to do. For me, its my mental health and I'm so lucky to have someone who can help me and adapt to different situations that I can't control yet. For your friend, she is dealing with her weight and evidently struggling with the consequences of her size, but she is very lucky to have someone who cares enough about her and her feelings and whether or not she's doing okay to prioritize it during their holiday. It's ok that you didn't like doing it, it's ok that you kinda want to bitch about it--bottom line is, you did somebody a massive favor that they couldn't possibly have asked you to do, and it makes you a good person even if you didn't enjoy it. \n\nTl;Dr: I have issues with food and mental health. My bf always helps me out even when I'm being bitchy and inconvenient and lame. It's super cool to do that for other people. I'm proud of OP. \n\n\nEdit to add: HAHAHA  I just realized what sub this is. I straight up thought I was in a different sub. I'm so sorry if any of this was patronizing I was writing it as though it were for people who didn't necessarily understand EDs ",
                "Edited?": "03-25-2019 23:25:58",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejdqu5f": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdqu5f",
                "Author": "ShoopDaWhoopBurrito",
                "Date Created": "03-25-2019 19:25:40",
                "Upvotes": 10,
                "Text": "She sounds like a sweet girl and OP, you sound like an amazing friend.\n\nThings like that trigger me too because it’s just reality; you can’t hide from it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejdv21z": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdv21z",
                "Author": "Aygurlitsyaalt",
                "Date Created": "03-25-2019 20:17:30",
                "Upvotes": 9,
                "Text": "You aren't judgy! You are a good person and I bet she was really grateful. \n\nIt's normal and human to feel this way, and your worries for yourself are valid as well. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejdmgq6": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdmgq6",
                "Author": "prinsith",
                "Date Created": "03-25-2019 18:33:17",
                "Upvotes": 5,
                "Text": "You sound like you’re a good friend!!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejeke8n": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejeke8n",
                "Author": "rachihc",
                "Date Created": "03-26-2019 03:40:41",
                "Upvotes": 3,
                "Text": "Omg you are so sweet to think this tings to make your friend comfortable without making it obvious and uncomfortable, really lovely and you are a great friend. It is normal to reach a point were you feel bad or annoyed, specially cos you put so much to help others, sometimes is not enough and you are neglecting yourself.   \nFor the eating part, I know from a friend in a similar situation as your friend, that she doesn't like to eat in public, she feels deeply ashamed, scare to the point of giving her panic attacks. Because lets be honest, heavier people get a lot of bullshit for enjoying food. If I,  a small person, eats 3 donuts, people would laugh and clap \"because I am so cool to eat like that\" (ignoring if I ate nothing for the past 3 days) but if someone overweight eats like that they get people staring and maybe uncomfortable comments of \" I am just worry about your health\". So understandable they tend to eat in private more comfortable.   \nMaybe if you are open about some of your struggles, not that you have to reveal everything, she will be more open to you too. Almost every woman has body image issues, and not a great relationship with foot at some point, and we can support each other.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ejfkzm3": [
                {
                    "Parent ID": "t1_ejeke8n",
                    "Comment ID": "ejfkzm3",
                    "Author": "clithub",
                    "Date Created": "03-26-2019 12:41:40",
                    "Upvotes": 3,
                    "Text": "omg I never thought of the eating part that way. I hated how she never really wanted to eat anything and I just felt like I was devouring everything in sight without much thought. We were at a restaurant and I was like, \"I'm going to get super messy rn because this chicken is super good\" and that I was comfrotable eating in front of them lolol. I didn't realize she would ever get shit for it because she was with her friends. I always feel like I get shit for eating alone (like why is this girl eating alone? doesn't she have friends?) so I understand now how it must feel to eat outside of your comfort zone. ",
                    "Edited?": false,
                    "Is Submitter?": true,
                    "Stickied?": false
                }
            ]
        }
    ],
    "ejelzey": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejelzey",
                "Author": "alldocsarebastards",
                "Date Created": "03-26-2019 04:27:04",
                "Upvotes": 2,
                "Text": "this doesn't sound fucked up! it sounds like stuff is really difficult for her and people who have never been ++ don't consider that. remember you don't need to help her to the extent that it compromises your own body image <3\n\n(however maybe you might want to think about removing a few identifiable details from this post. i know you were just giving us a visual image and setting the scene but it would suck if someone recognised her from the personal info you mentioned)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejensk6": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejensk6",
                "Author": "StephPowell1",
                "Date Created": "03-26-2019 05:15:51",
                "Upvotes": 1,
                "Text": "That made me so sad. That girl used to be me. I hated myself venemously as amazing as it is that you helped her (and it is), she'd probably be mortified to know you did. Grateful but mortified.\n\nI'm still the fat friend just 100lbs smaller with bulimia and I make it my duty in life to do the exact opposite that the fat friend does. I'l never suggest to stop even if I'm knackered, I make sure I'm the last to sit and the first up, always suggest doing something. Always eat the most healthy meal ect.\n\nThe sad thing I never had any fun, always preoccupied with food and now I don't hang out with them at all. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eje5gm8": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "eje5gm8",
                "Author": "Valer_bear",
                "Date Created": "03-25-2019 22:32:43",
                "Upvotes": -1,
                "Text": "This reminds me of my plus size cousin 😅",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ejdska7": [
        [
            {
                "Parent ID": "t3_b5gfdo",
                "Comment ID": "ejdska7",
                "Author": "throwawayfemcelite",
                "Date Created": "03-25-2019 19:46:54",
                "Upvotes": -28,
                "Text": "she isn't your responsibility, it's not your job to cover for her and therefore inconvenience yourself.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ejdykkf": [
                {
                    "Parent ID": "t1_ejdska7",
                    "Comment ID": "ejdykkf",
                    "Author": "spinthesound",
                    "Date Created": "03-25-2019 21:00:52",
                    "Upvotes": 13,
                    "Text": "True, its not her responsibility.  But she cares about her friend and doesn’t want her to feel ashamed.  Real friendship sometimes means sacrificing your own comfort to help.  It’s absolutely fine to feel frustrated with someone but still love them and want to help.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        },
        {
            "ejdwmvk": [
                {
                    "Parent ID": "t1_ejdska7",
                    "Comment ID": "ejdwmvk",
                    "Author": "RachAgainstLeMachine",
                    "Date Created": "03-25-2019 20:36:51",
                    "Upvotes": 19,
                    "Text": "Yeah, it’s not her responsibility. It’s called being a decent human being. Even more so, a great friend. \n",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ]
        }
    ]
}