{
    "ee3p3fv": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3p3fv",
                "Author": "teasnob22",
                "Date Created": "01-14-2019 23:33:20",
                "Upvotes": 97,
                "Text": "I’m so glad you made this post, this has been my exact experience. Also, I’m WAY more likely to binge now, because I know I can purge afterwards. Never mind that I put on weight anyway, never mind that I KNOW that I never get up all the calories, it feels like I can do something to correct the binge anyway. \n\nAlso, b/p cycles will get more and more regular until there’s no way you can out-restrict them, and everything goes to shit. It’s honestly one of the worst things that’s ever happened to me. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3pabi": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3pabi",
                "Author": "SlipSunshine",
                "Date Created": "01-14-2019 23:36:54",
                "Upvotes": 50,
                "Text": "You have no idea how much my idiot ass needed to see this post today. Thank you thank you thank you for putting this on my feed",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3ua8w": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3ua8w",
                "Author": "sugafreedreams",
                "Date Created": "01-15-2019 01:20:48",
                "Upvotes": 36,
                "Text": "It's a bandaid solution that actually makes things worse over time, the control you have over food will diminish the more you purge. Our brain is constantly monitoring how much energy is coming in compared to how much is being eaten. This is how our appetite has evolved to naturally work: your brain knows that a certain amount of food has a certain amount of energy, and it becomes satisfied after enough energy has been consumed. \n\nWith purging you're essentially fooling your brain into thinking that a massive amount of food only has the small amount of calories that you fail to purge each time. As a long-term result you will become more obsessed with food and need to eat way more than before just to feel somewhat satisfied. This doesn't reverse immediately either, making weight gain more severe when you choose to stop purging due to all the other health complications. \n\nIt's also important to remember that bulimia recovery is a matter of when, not if. It's never ever a permanent solution, it's a demon that harms you the whole time you're doing it and for a long time afterwards. You will win absolutely nothing from it. Only a huge dentist bill and more weight gain in the long long term.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3pl8k": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3pl8k",
                "Author": "jessusisabiscuit",
                "Date Created": "01-14-2019 23:42:23",
                "Upvotes": 30,
                "Text": "Amen. I did this for years and I still slip up, but nothing compared to how I used to compulsively b/p. It's good to have a reminder laid out like this. Thanks for taking the time to put it all down. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3rm0d": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3rm0d",
                "Author": "Pinus_virginiana",
                "Date Created": "01-15-2019 00:21:45",
                "Upvotes": 21,
                "Text": "Thank you so much for this ❤️ I’ve got EDNOS, but only ever restricted. Recently I’ve had super strong urges to start purging...(thanks to my hellbrain) and this post is really helping me to beat those back.\n",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee41mc4": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee41mc4",
                "Author": "alizarincrimson7",
                "Date Created": "01-15-2019 04:48:06",
                "Upvotes": 19,
                "Text": "I would also like to add: I’m a tattoo artist and the other day I was doing a memorial tattoo for a guy’s sister. She looked so young (late 20s early 30s) so I asked what happened. Apparently her heart gave out because of her bulimia. She left behind a husband and kids. It put the fear in me for sure. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3xyqr": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3xyqr",
                "Author": "tzt-t",
                "Date Created": "01-15-2019 02:58:13",
                "Upvotes": 15,
                "Text": "currently stuck in a b/p cycle and I get exactly what you mean about the fear of the oncoming purge. I absolutely dread it, often to the point where I consider not purging to avoid the pain (which increases the anxiety and therefore urge to purge, which like... thanks for that??!)\n\nI am starting to feel the toll this is taking on my body (constant tummy aches and brain fog to oblivion👌🏽) but I. can't. stop.\n\nI need and want help but literally can't get it so like guess I'll die 🤷🏽",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3wttd": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3wttd",
                "Author": "[deleted]",
                "Date Created": "01-15-2019 02:26:36",
                "Upvotes": 13,
                "Text": "OP, you're an angel. i hope you know that. i hope lots of good shit comes your way. thanks for this post",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3sxhn": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3sxhn",
                "Author": "killveemaim",
                "Date Created": "01-15-2019 00:49:33",
                "Upvotes": 11,
                "Text": "Thank you. I needed this tonight. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4175f": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4175f",
                "Author": "PinkyOutYo",
                "Date Created": "01-15-2019 04:35:51",
                "Upvotes": 7,
                "Text": "I've posted this comment in a previous thread but it bears repeating:\n\"This is so important. I've been b/ping for 12 years and now, I get stabbing chest pains whenever I do. I could go at any point. Please, PLEASE, whoever you are, you are far too important, beautiful and valid to risk your life like this.\"",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3uli1": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3uli1",
                "Author": "snefferu",
                "Date Created": "01-15-2019 01:28:29",
                "Upvotes": 6,
                "Text": "I’m so sorry you are going through this. I hope you can find your way out of it. I’ve never done it (bc I tried 2/3x early on and failed and gave up, which I’m so THANKFUL for now) but I used to c/s a lot and it got out of hand and I can relate to the time and money wasting and the shame of doing it in disgusting public toilets. I quit cold turkey one day I’d never believed it would be possible but there is hope to stop these miserable addictions, I wish you all the luck in the world.",
                "Edited?": "01-15-2019 01:36:24",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4jaqm": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4jaqm",
                "Author": "Sparklewhores",
                "Date Created": "01-15-2019 09:44:30",
                "Upvotes": 7,
                "Text": "Yep, I put on 5 stone while in the worst of bulimia and now my teeth are stained and in pain and I have chronic acid reflux. And if I bend over at the waist for too long my body automatically tries to bring up food. Kinda embarrassing on a night out when your body automatically tries to purge and it's not even bringing up your drinks, just stomach acid. And I'm even fatter than when I started so guys, bulimia ain't it. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3xw95": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3xw95",
                "Author": "alyyy30",
                "Date Created": "01-15-2019 02:56:17",
                "Upvotes": 6,
                "Text": "Not being in a b/p cycle is like just trying to have your head above water until you’re pulled under again...",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee49p6v": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee49p6v",
                "Author": "ehloveeash",
                "Date Created": "01-15-2019 07:35:43",
                "Upvotes": 7,
                "Text": "Also no one ever tells you how consistently DRY your hair skin and nails will be. You will literally be a scaly, broken out, puffy mess. But at least you're in control. LOLLLL. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee3sqis": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3sqis",
                "Author": "thisismythrowaway179",
                "Date Created": "01-15-2019 00:45:20",
                "Upvotes": 6,
                "Text": "Can the symptoms heal?",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ee3trpz": [
                {
                    "Parent ID": "t1_ee3sqis",
                    "Comment ID": "ee3trpz",
                    "Author": "[deleted]",
                    "Date Created": "01-15-2019 01:08:37",
                    "Upvotes": 18,
                    "Text": "**Some of the things are somewhat reversible:** \n\n- the skin around your mouth, burst capillaries, bleeding hands, swollen glands, sore throats... I genuinely mean this, not to scare anyone, but these only really heal with time. It may take days, weeks to get back to normal, more depending on your purging frequency.\n\n- Every day you suppress the urge to purge or b/p, you’re on the road to recovery.\n\n\n**Other things you can only prevent gettig worse.** \n\n- At least in my case, I don’t think my teeth or my gut will get much better than it is. It’s a strange curve- you don’t see firsthand the damage your doing to your teeth and gut so you keep with your purging ways... til you’ve fucked them over and then it can be a steep acceleration downhill from there if you aren’t harm minimising.\n\n**Other things tend to linger for years though you can work to fix it**. \n\n- Psychologically, my relationship with food, self-image and self-worth is fucked, as per any ED. \n\n- My social life has been affected so much, esp the friendships I had or could have had. I harbour a lot of guilt and feel like a fraud. \n\n- A minor but debilitating example: I would be eating so little when I was having lunch with friends at uni (in order to compensate for my secret b/p)—> ironically I was actually gaining weight from b/p —> paranoia they would talk behind my back, fear of meeting old friends I hadn’t seen in years —> becoming more shut-in and doing more b/p’s....)\n\n- My relationship with parents is shite esp since they’ve found out about purging. I have no independence from them and no privacy because they worry for me. \n\n- I can’t go back in time and fix my grades.\n\nAll in all, I can’t fix what’s happened in the past. I’m working to minimise purging and other ED behaviours now. I’m trying to forgive myself, learn my lessons and move forwards. I know not everyone is ready for recovery, nor is recovery an easy process... I just wished I knew about all this bad shit before I started. Stay safe 💙",
                    "Edited?": "01-15-2019 01:39:36",
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ee69klu": [
                [
                    {
                        "Parent ID": "t1_ee5teih",
                        "Comment ID": "ee69klu",
                        "Author": "aerienne",
                        "Date Created": "01-15-2019 22:22:00",
                        "Upvotes": 3,
                        "Text": "I don't have any solid techniques since it happened over a while. But figuring out when I was most likely to b/p and trying to do something else was a big help. Since I was most likely to binge after everyone in my house was asleep, I started going to bed earlier or taking a sleeping pill if I needed. Or stopping myself mid-binge and just not going further. Nothing is fool-proof and the temptation is still very much there. But vanity played a fair part as well. I've always hated my face and getting rid of chipmunk cheeks was a huge goal. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ee6c8xm": [
                        {
                            "Parent ID": "t1_ee69klu",
                            "Comment ID": "ee6c8xm",
                            "Author": "tobethinspo",
                            "Date Created": "01-15-2019 23:05:46",
                            "Upvotes": 1,
                            "Text": "Ooh going to bed earlier though is good advice cause I do tend to binge late at night. Vanity-wise my main concern is my teeth and burst blood vessels 😫, haven't really had much issue with chipmunk cheeks thankfully\n\nA big issue for me is that once I feel like binging no matter how long I wait, 15 min, 6 hours, the urge doesn't go away",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ee419fn": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee419fn",
                "Author": "oharacopter",
                "Date Created": "01-15-2019 04:37:42",
                "Upvotes": 4,
                "Text": "thank u so much, i was literally just looking for something like this to show to my friend",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee425ey": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee425ey",
                "Author": "HoldenCaulfield7",
                "Date Created": "01-15-2019 05:03:25",
                "Upvotes": 5,
                "Text": "Hey there, thank you for making this post. And thanks for the shout out. If this deters one person on here from purging, you’ve done something incredible ❤️👏🏻 \n\nReading this also makes me want to make healthier choices so for those of us stuck in the cycle, re-reading this before a binge/purge could help us. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee431jd": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee431jd",
                "Author": "Aleph0-4",
                "Date Created": "01-15-2019 05:27:17",
                "Upvotes": 5,
                "Text": "Thanks for this post you've given me more motivation to not binge. Another effect of purging  is it fucks up your digestive system: I need mild laxatives to induce bowel movements and between that I'm always bloated. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4vs3t": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4vs3t",
                "Author": "aerienne",
                "Date Created": "01-15-2019 12:04:50",
                "Upvotes": 5,
                "Text": "To those who already purge: It's possible to stop. I promise you aren't stuck in this cycle forever.\n\nDespite nearly a decade of bulimia, I haven't b/p-ed in over a year. The few times I have purged was when I felt physically ill from bad food or something that didn't sit well and I chose to purge. \n\nBut I stopped without therapy (not dissing it; I just can't afford it) or any life/death scare. It was gradual and I didn't think I could ever stop. But it's possible and you can do it.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ee5teih": [
                {
                    "Parent ID": "t1_ee4vs3t",
                    "Comment ID": "ee5teih",
                    "Author": "tobethinspo",
                    "Date Created": "01-15-2019 18:42:18",
                    "Upvotes": 1,
                    "Text": "What techniques helped you to stop? ",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ee69klu": [
                        {
                            "Parent ID": "t1_ee5teih",
                            "Comment ID": "ee69klu",
                            "Author": "aerienne",
                            "Date Created": "01-15-2019 22:22:00",
                            "Upvotes": 3,
                            "Text": "I don't have any solid techniques since it happened over a while. But figuring out when I was most likely to b/p and trying to do something else was a big help. Since I was most likely to binge after everyone in my house was asleep, I started going to bed earlier or taking a sleeping pill if I needed. Or stopping myself mid-binge and just not going further. Nothing is fool-proof and the temptation is still very much there. But vanity played a fair part as well. I've always hated my face and getting rid of chipmunk cheeks was a huge goal. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ee6c8xm": [
                [
                    {
                        "Parent ID": "t1_ee69klu",
                        "Comment ID": "ee6c8xm",
                        "Author": "tobethinspo",
                        "Date Created": "01-15-2019 23:05:46",
                        "Upvotes": 1,
                        "Text": "Ooh going to bed earlier though is good advice cause I do tend to binge late at night. Vanity-wise my main concern is my teeth and burst blood vessels 😫, haven't really had much issue with chipmunk cheeks thankfully\n\nA big issue for me is that once I feel like binging no matter how long I wait, 15 min, 6 hours, the urge doesn't go away",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ee3sxxk": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee3sxxk",
                "Author": "vantassell",
                "Date Created": "01-15-2019 00:49:48",
                "Upvotes": 7,
                "Text": "Wow, this is good writing and a great piece. You should submit this to HuffPost.\n\n* Title: Want to Start Purging? This is for you. \n* Artwork: Iconic Army recruiter UNCLE SAM [\"I WANT YOU!\"](https://imgur.com/a/DgKxUjz). Maybe the title is coming out of his mouth, like word vomit. Maybe in a [funky style](https://www.youtube.com/watch?v=0ScYz9sNaQk).",
                "Edited?": "01-15-2019 00:59:10",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ee42l6x": [
                {
                    "Parent ID": "t1_ee3sxxk",
                    "Comment ID": "ee42l6x",
                    "Author": "edimalo",
                    "Date Created": "01-15-2019 05:15:31",
                    "Upvotes": 4,
                    "Text": "I agree with this!",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ee69klu": [
                [
                    {
                        "Parent ID": "t1_ee5teih",
                        "Comment ID": "ee69klu",
                        "Author": "aerienne",
                        "Date Created": "01-15-2019 22:22:00",
                        "Upvotes": 3,
                        "Text": "I don't have any solid techniques since it happened over a while. But figuring out when I was most likely to b/p and trying to do something else was a big help. Since I was most likely to binge after everyone in my house was asleep, I started going to bed earlier or taking a sleeping pill if I needed. Or stopping myself mid-binge and just not going further. Nothing is fool-proof and the temptation is still very much there. But vanity played a fair part as well. I've always hated my face and getting rid of chipmunk cheeks was a huge goal. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ee6c8xm": [
                        {
                            "Parent ID": "t1_ee69klu",
                            "Comment ID": "ee6c8xm",
                            "Author": "tobethinspo",
                            "Date Created": "01-15-2019 23:05:46",
                            "Upvotes": 1,
                            "Text": "Ooh going to bed earlier though is good advice cause I do tend to binge late at night. Vanity-wise my main concern is my teeth and burst blood vessels 😫, haven't really had much issue with chipmunk cheeks thankfully\n\nA big issue for me is that once I feel like binging no matter how long I wait, 15 min, 6 hours, the urge doesn't go away",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ee4e4mj": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4e4mj",
                "Author": "TrueRusher",
                "Date Created": "01-15-2019 08:38:09",
                "Upvotes": 8,
                "Text": "Also: you can’t suck ya man’s dick without getting triggered to purge. And you pee every time you purge cuz of the muscle contractions so now you either can’t hold in your pee or you have to force out all your urine when you pee. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4er1c": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4er1c",
                "Author": "Suppup00",
                "Date Created": "01-15-2019 08:46:20",
                "Upvotes": 4,
                "Text": "i don't have most of these problems. but i do maintain my weight and non food related parts of my life are fucked ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4ih5a": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4ih5a",
                "Author": "Raunchey",
                "Date Created": "01-15-2019 09:34:11",
                "Upvotes": 5,
                "Text": "Thank you for this post ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4mpz3": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4mpz3",
                "Author": "[deleted]",
                "Date Created": "01-15-2019 10:24:19",
                "Upvotes": 3,
                "Text": "Also, tooth damage starts FAST. I remember when I started purging I was thinking if I just did it here and there it wouldn't be terrible for my teeth. NOPE. It just took a few months of doing it once a week or once every other week for my teeth to start chipping and cracking. I didn't have naturally weak teeth or anything and I have really good dental hygiene. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4clj7": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4clj7",
                "Author": "Sushisavage",
                "Date Created": "01-15-2019 08:17:38",
                "Upvotes": 6,
                "Text": "Yep. And it really is possible to stop. I haven't since August 2017. I just took it one day at a time and reminded myself of all that. My binging got better too over time. I no longer binge much because I can't get rid of it easily. And I don't want to. It's wasteful. If I eat it, it's staying in me. This is recovery for me. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4n1jv": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4n1jv",
                "Author": "sunnshine67",
                "Date Created": "01-15-2019 10:27:55",
                "Upvotes": 3,
                "Text": "I had a brief stint of purging (4-5 months?) and stopped because of vanity reasons, which sucks bc I should care more about my health but i don’t 🤷‍♀️ my teeth were yellow and sensitive and my teeth are one of the few things I like so I cut that off plus it did lead to weight gain which made me wanna die. I’m back on my restriction bullshit and I feel much better ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4xb88": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4xb88",
                "Author": "OodietcokeheadoO",
                "Date Created": "01-15-2019 12:21:26",
                "Upvotes": 3,
                "Text": "I think it's almost a curse that I've been purging for 14 years and never had faced one single solitary health consequence from it (my cheeks don't swell and I never got the scars on my knuckles I'm hands free now anyway) but the thing is no one will ever know and you may never look or feel sick enough to get help. It's like you're always on fire but only you can see and feel it. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4mbnu": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4mbnu",
                "Author": "invincibletitan33",
                "Date Created": "01-15-2019 10:19:45",
                "Upvotes": 2,
                "Text": "Thanks for this! Been having really strong desire to purge, even though I'm emetophobic and kinda laxative phobic so...purging still crosses my mind. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4ysrf": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4ysrf",
                "Author": "vydka",
                "Date Created": "01-15-2019 12:38:01",
                "Upvotes": 2,
                "Text": "Thank you so much for this even though it brings back so many memories. I haven't purged in a good amount of time but it's like the gift that keeps on giving. I'm still finding out so much is wrong and destroyed with my body because of my ED, but specifically from purging. And it's still a struggle to control the urge knowing that. \nAll the love and support on your journey ❤️ you can fight this. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "egau17u": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "egau17u",
                "Author": "hushedbalance",
                "Date Created": "02-12-2019 06:09:03",
                "Upvotes": 2,
                "Text": "This post is a month old, but I just found it. I found it just in time, you might say.\n\nI promise I will not purge.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee5sm44": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee5sm44",
                "Author": "tryingwithmarkers",
                "Date Created": "01-15-2019 18:31:51",
                "Upvotes": 1,
                "Text": "Such an incredibly accurate post. I wish I had read this years ago",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee699up": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee699up",
                "Author": "fuck_you_get_pumped",
                "Date Created": "01-15-2019 22:17:27",
                "Upvotes": 1,
                "Text": "i stopped purging cause my teeth were getting sensitive, yellow and ragged at the age of 20. my normal-eater mom just started complaining about sensitive teeth when she was 50.... ugh.   \n    \nit's the number one thing i use to scare kids away from purging, though. don't do it cause enamel decay is irreversible and you'll end up with teeth like mine. fuck",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee6c5uc": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee6c5uc",
                "Author": "rot-and-poetry",
                "Date Created": "01-15-2019 23:04:20",
                "Upvotes": 1,
                "Text": "I've been clean almost two weeks but had been getting the urge to start again the last few days. This post just reminded me why I stopped purging in the first place. Thank you for writing this op. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee6kzjf": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee6kzjf",
                "Author": "justadumbkid1",
                "Date Created": "01-16-2019 02:16:53",
                "Upvotes": 1,
                "Text": "I have found myself getting the urge to start purging after some recent binges, but I won’t. Thank you for the reality check, I needed this.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ee4u7hh": [
        [
            {
                "Parent ID": "t3_ag4us9",
                "Comment ID": "ee4u7hh",
                "Author": "[deleted]",
                "Date Created": "01-15-2019 11:47:52",
                "Upvotes": 0,
                "Text": "Yeah, I thought I recognized this 😂 Great post though ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ee5o7kz": [
                {
                    "Parent ID": "t1_ee4u7hh",
                    "Comment ID": "ee5o7kz",
                    "Author": "[deleted]",
                    "Date Created": "01-15-2019 17:34:25",
                    "Upvotes": 2,
                    "Text": "Thanks :) Also this post isn’t targeted at you by any means, just as a mod and bulimic I thought it would be good to share my two cents. Stay safe love",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ee69klu": [
                [
                    {
                        "Parent ID": "t1_ee5teih",
                        "Comment ID": "ee69klu",
                        "Author": "aerienne",
                        "Date Created": "01-15-2019 22:22:00",
                        "Upvotes": 3,
                        "Text": "I don't have any solid techniques since it happened over a while. But figuring out when I was most likely to b/p and trying to do something else was a big help. Since I was most likely to binge after everyone in my house was asleep, I started going to bed earlier or taking a sleeping pill if I needed. Or stopping myself mid-binge and just not going further. Nothing is fool-proof and the temptation is still very much there. But vanity played a fair part as well. I've always hated my face and getting rid of chipmunk cheeks was a huge goal. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ee6c8xm": [
                        {
                            "Parent ID": "t1_ee69klu",
                            "Comment ID": "ee6c8xm",
                            "Author": "tobethinspo",
                            "Date Created": "01-15-2019 23:05:46",
                            "Upvotes": 1,
                            "Text": "Ooh going to bed earlier though is good advice cause I do tend to binge late at night. Vanity-wise my main concern is my teeth and burst blood vessels 😫, haven't really had much issue with chipmunk cheeks thankfully\n\nA big issue for me is that once I feel like binging no matter how long I wait, 15 min, 6 hours, the urge doesn't go away",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ]
}