{
    "erqhg3u": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "erqhg3u",
                "Author": "cummo22",
                "Date Created": "06-21-2019 13:57:26",
                "Upvotes": 133,
                "Text": "I’m sorry this is not a productive comment at all but a ‘’who can lose the most weight in x amount of time’’ challenge is a stupid fucking challenge. It’s shit like that that got me here.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "erqi46c": [
                {
                    "Parent ID": "t1_erqhg3u",
                    "Comment ID": "erqi46c",
                    "Author": "wetblanketdreams",
                    "Date Created": "06-21-2019 14:04:58",
                    "Upvotes": 39,
                    "Text": "**right**!?\nIt should be about health. You can't expect someone 300 pounds to lose the same as a 200 pound person. It's insane.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "erqotpr": [
                        {
                            "Parent ID": "t1_erqi46c",
                            "Comment ID": "erqotpr",
                            "Author": "anniecakes",
                            "Date Created": "06-21-2019 15:20:38",
                            "Upvotes": 45,
                            "Text": "They did say most weight lost as a percentage of your starting weight.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                },
                {
                    "erqxz42": [
                        {
                            "Parent ID": "t1_erqi46c",
                            "Comment ID": "erqxz42",
                            "Author": "lotsofsqs",
                            "Date Created": "06-21-2019 17:08:45",
                            "Upvotes": 21,
                            "Text": "I'll never get why these aren't like, \"run a 5k\" or pushup contests rather than weight loss.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "erqvy1t": [
                [
                    {
                        "Parent ID": "t1_erqotpr",
                        "Comment ID": "erqvy1t",
                        "Author": "wetblanketdreams",
                        "Date Created": "06-21-2019 16:43:49",
                        "Upvotes": 24,
                        "Text": "Oh, well still. We are the first to know the weight loss number is not the main indicator of health. \nIt's probably blood work, vitals, energy levels without drugs, and sleep pattern more than anything.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "erqaggr": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "erqaggr",
                "Author": "imokayjustfine",
                "Date Created": "06-21-2019 12:40:40",
                "Upvotes": 95,
                "Text": "Are you in therapy at all? Is there someone (anyone) who knows about what you’ve gone through, who might be able to help redirect you towards a more “recovery oriented” mindset?\n\nI don’t think anyone recovers without ever falling back in some way. If there are people who do somehow, I’ve certainly never met them. \n\nPlease be understanding with yourself! 9 months isn’t really very long. It’s going to be an ongoing process at any weight. Legitimately.\n\nHang in there, friend, and stay safe! You deserve to be okay. 💛",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "erqevzj": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "erqevzj",
                "Author": "yellowposy2",
                "Date Created": "06-21-2019 13:29:03",
                "Upvotes": 52,
                "Text": "When I was in treatment, they said one of the steps of recovery is relapse. It is very normal, or terrible and stressful. Good for you for recognizing that you still want to be in recovery!!! The ED is trying to take control but your healthy self is capable of staying in control. You’ve got this. I also recommend therapy, whether or not you’re with a specific ED counselor. Getting the terrible thoughts out of my brain helps me to recognize how not normal or healthy they are, and how in control I am capable of being. Sending you love and support 💓 as for your bitchy coworkers, I’m really sorry. If I were you, I would try to disengage as much as possible. They sound like bullies.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "erquy7o": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "erquy7o",
                "Author": "lintuski",
                "Date Created": "06-21-2019 16:31:48",
                "Upvotes": 18,
                "Text": "Maybe it’s just because I’m hyper aware from having my own ED, but “office weight loss competition” seems like a shockingly bad idea.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ertda6t": [
                {
                    "Parent ID": "t1_erquy7o",
                    "Comment ID": "ertda6t",
                    "Author": "strangernumberone",
                    "Date Created": "06-22-2019 16:32:27",
                    "Upvotes": 2,
                    "Text": "Agreed. My last office was organizing one right before I left them. That's not the reason I was leaving, but it does indicate a lot of other separate toxic crap that was regularly accepted.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "erqotpr": [
                [
                    {
                        "Parent ID": "t1_erqi46c",
                        "Comment ID": "erqotpr",
                        "Author": "anniecakes",
                        "Date Created": "06-21-2019 15:20:38",
                        "Upvotes": 45,
                        "Text": "They did say most weight lost as a percentage of your starting weight.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "erqvy1t": [
                        {
                            "Parent ID": "t1_erqotpr",
                            "Comment ID": "erqvy1t",
                            "Author": "wetblanketdreams",
                            "Date Created": "06-21-2019 16:43:49",
                            "Upvotes": 24,
                            "Text": "Oh, well still. We are the first to know the weight loss number is not the main indicator of health. \nIt's probably blood work, vitals, energy levels without drugs, and sleep pattern more than anything.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "erqxz42": [
                [
                    {
                        "Parent ID": "t1_erqi46c",
                        "Comment ID": "erqxz42",
                        "Author": "lotsofsqs",
                        "Date Created": "06-21-2019 17:08:45",
                        "Upvotes": 21,
                        "Text": "I'll never get why these aren't like, \"run a 5k\" or pushup contests rather than weight loss.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "erqpt1p": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "erqpt1p",
                "Author": "AGirlWithTattoos923",
                "Date Created": "06-21-2019 15:31:42",
                "Upvotes": 16,
                "Text": "Ugh, this makes me so sad for you considering I have been in your position. About 5 years ago and the beginning of my ED, I became a nutritional therapist and weight loss coach. HA! go figure I was helping clients with EDs and healthy weightloss, meanwhile hiding my bulimia and BED. Anyway, I worked in a medical office with a lot of women/nurse assistants, office clerks, etc...and they were always doing the next best diet and constantly making remarks toward me about how thin I was..I guess they considered them compliments, but I didn't.  They patronized me when I didn't take part in the donuts in the break room. After about 2 years there, I realized that it was absolutley not healthy for me and my recovery. None of them knew about my struggles and I know if I had told them, things would be different. But how would that make me look in my career ? I'd be a total hypocrite when I am preaching to clients of mine about living a healthy lifestyle, and \"having treats here and there won't hurt you\", or \"it's all about SELF LOVE\"...whilst I am practicing none of that and secretly taking laxatives, diet pills, binging/purging, etc...\n\nAt the end, I went to my boss who was the leading Doctor whom I worked under. He was the MOST understanding man ever and I explained to him what I was going through and why I felt working there wasnt good for me. He knew that I was great at my job, but he ultimately understood why I couldnt stay. I ended up leaving that career path behind me. I ralized the only reason I had any interest in nutrition, diet, weight loss coaching was because of MY eating disorder. Right around the time my ED started, was when I randomly decided to go to school for nutritional therapy.\n\nAnyywaayyy, not to go on a rant about myself, honestly I would suggest talking to someone. Maybe if you feel comfortable enough with anyone you work with. Ive realized that it's best to give people the benefit of the doubt. Everyone has struggles, so maybe if you opened up to one of them, they would be more understanding and it would definitely lift some weight off your shoulders.\n\nAt my new job I have even casually pointed out that I struggled with ED in the past(still currently struggling hoenstly ) and all of my co workers were very sweet about it. They didn't make a big deal out of it.  some of them  even mentioned they struggled with other diseases like depression,anxiety. And now everyone I work with knows not to question me about food or diets or why I am the only one who brings my food to work (I work at a restaurant so everyone usually orders their food there)",
                "Edited?": "06-21-2019 20:33:09",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "erqjqbi": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "erqjqbi",
                "Author": "ilivetomosh",
                "Date Created": "06-21-2019 14:23:11",
                "Upvotes": 31,
                "Text": "And i love your writing style",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "err5ezn": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "err5ezn",
                "Author": "hotgog",
                "Date Created": "06-21-2019 18:46:08",
                "Upvotes": 9,
                "Text": "TW: numbers, fasting, etc. \nI think working in an office, especially one that does weight loss competitions is extremely triggering for someone with an ED. \nlast year, before I even knew I had an ED (or maybe was just denying it like I am now) I was working in an office and one of the first things my coworkers said to me when i got hired was “you’re going to put a lot of weight working here! all we do is sit all day!” As someone who was already very cautious about my weight and actively losing weight, I took this as a challenge. I used being sedentary as an excuse to fast. I wouldn’t eat for 3-5 days at a time sometimes. Walked the stairs and circled the buildings on my breaks for exercise. Had a strict rule where I wouldn’t eat at work at all, despite the constant offer for free food. Bitchy comments 24/7. It was a mess. \nThere was also always a “biggest loser” competition that lasted 8 weeks with a 2-4 week break between each. I never did it because I didn’t want to waste my money. May rolled around and I was determined to lose weight for summer. I joined. It was $50 to enter, 6 people did it so the winnings were at $300. No fucking way I’m losing that. \nNeedless to say I lost 40 lbs in 2 months and won the competition. I quit a week later. \nNow that I sit back and think about it, I spent my entire time there in a really sick and dark place. And the office-lady-weight-loss culture really fueled me too. \n(I’m in a better place now, I work a job where I’m active so I allow myself to eat more, though it usually turns to binging and sometimes purging, but at least I can walk straight without seeing stars!!)",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "err1zwb": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "err1zwb",
                "Author": "idkman1768",
                "Date Created": "06-21-2019 18:00:27",
                "Upvotes": 7,
                "Text": "Recovery is such a slippery slope. Missing an exchange leads to missing a whole meal leads to several missed meals and on and on and on. Reach out for help, you’re not a bad person and you deserve help with your recovery!",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "erqjpj1": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "erqjpj1",
                "Author": "ilivetomosh",
                "Date Created": "06-21-2019 14:22:56",
                "Upvotes": 8,
                "Text": "Rl8",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "eruv2o8": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "eruv2o8",
                "Author": "Charity1224",
                "Date Created": "06-23-2019 08:58:19",
                "Upvotes": 3,
                "Text": "I totally feel all of this!!! I can relate to an extent ... I honestly don’t even think people even REALIZE how much their seemingly innocent comments can be such a trigger for our ED! Anytime I have ever fallen back into this (which has been about 3 or 4 times total after stopping for a good amount of time since my late teens/early 20’s... I’m 33 now) has been after either successfully losing weight from dang dieting and then starting to gain it back, or just having the fear of gaining it back... or from trying to diet and not losing enough... or sometimes just from sheer loneliness or sadness... stress and anxiety have me a nervous stomach as well so I hadn’t been eating as much from time to time. I have been a healthy BMI, and I have also been considered “overweight” and “big-boned” or “chunky”...   I am a healthy BMI now, but I have been 40 lbs more than I am now, fluctuated up and down over the years, mostly on purpose from dieting and then letting myself go, but it just sucks CONSTANTLY having food and weight on your mind! It’s exhausting... \n\nStrangely enough, over the past 2 years I lost a lot of weight due to stress from divorce from my alcoholic husband, a sick mom, and then an abusive relationship (separate from the guy I divorced, this other abusive guy was a malignant narcissist, fucked with my brain in so many different ways it’s unreal that I dealt with it for 7 to 10 months). Honestly these events had all caused me to have less appetite naturally and to think about other things instead of food, or just stress in general caused my body to metabolize faster, I have no idea... I did eat bad foods from time to time, but I balanced it out with good food... but I would stop eating when I was full, probably wouldn’t eat much sometimes because of such high stress and nerves making me feel less hungry, etc... but in a weird way, I felt like I had a good and normal relationship with food for the first time in my life, oddly enough... because I wasn’t obsessing over it for once in my life. I really have no idea why I hate to say this, but I have almost ENJOYED being so easily a healthy BMI with little effort or concern over food. I have never “easily” been a healthy BMI. But in reality, the circumstances I was under have been some kind of different hell... I have had the hardest and busiest days of my dang life, non-ideal circumstances... but I am in “the best shape” of my life from it. Which sucks! It’s like if I’m happy and want to eat, well there goes that, and then there starts the constant thoughts about food and what I’m putting in my body, restricting, counting, binging, and uhh- purging, etc. ugh. \n\nAnd now back on subject related to your post, while People think I am so healthy and only eat healthy on the outside, they really have honestly NO IDEA that I’m extremely unhealthy in reality, while in private... or I would eat extremely healthy while at work, because I would eat bad elsewhere, etc... but of course, all the comments like “of course she doesn’t want a cupcake” or “she eats so healthy all the time, how do you do it” blah blah blah... it’s like shut up. They have no idea... but I have not consistently been where I am now ever until the past year or so, and hadn’t seen this weight since I was 19 years old... I enjoy it. I want to stay this weight, which is a healthy weight and body frame, for once in my life... I’m happy with my body, but to keep it is gonna be another story... And what really pissed me off recently, after I got out of my abusive situation 4 months ago, my Aunt and Uncle (who I love dearly) felt I looked “sickly” (stress, duh!) and kept tell me to eat and put on some weight! Like it was them telling me that every other day for a few weeks, I was like wtf... finally I told my uncle, look... I am a healthy BMI... I have no plans on gaining any weight back, but I’m going to work on getting healthy and happy in other ways (psychologically, I guess)... I probably look run down due to stress and unhappiness, nothing to do with my healthy weight... they were just used to seeing me a little heavier. It was just annoying hearing their comments... and for people to even give their two-cents about what anyone puts, or doesn’t put, in their mouth... or if they think someone is “too skinny” so they need to eat. Skinny shaming sucks just as bad as fat shaming and I wish it just didn’t exist. If they only KNEW what their comments do! Anyways people just need to mind their dang business!!! \n\nAnd to finish this off... well, now that I have had all this time to myself after breaking free from my situation elsewhere, and I’ve obtained a less stressful lifestyle as far as relationships go... I have sadly went into a downward spiral with food again. I tried so hard not to, but it seemed to be inevitable. I started exercising a lot, because I needed a Healthy way to take out negative energy... but almost felt like it creeped up to excessive level on days I would exercise... then Friends come into town, this friend loves pizza and ice cream... and for some reason pizza was my trigger this time. And then it trickled into eating desserts again unhealthily... I ate pizza and desserts healthily prior to now during my issues the past couple years, but without the anxiety and stress causing me to have less appetite, my food issues have reared their ugly head yet again. And it was almost like I allowed myself to eat those things, and it opened up the dang flood gates. I wanted all the things again. And I’m not sure if subconsciously the comments also have some effect as well... I am back at it myself. I hate it so much. It’s almost worse every time I’ve “relapsed” too... I am to the point again where I’m trying to cut it out again, because I’m pretty sure I have Gastroparesis (again... I had it back about 7 to 8 years ago)... but even then it’s almost like I subconsciously restrict and know what I can have to keep down to a healthy weight. Just the constant thoughts about food and eating SUCK!!!! \n\nSorry this was long, but you’re not alone!!!!",
                "Edited?": "06-23-2019 09:08:24",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "erqhs5m": [
        [
            {
                "Parent ID": "t3_c3clsy",
                "Comment ID": "erqhs5m",
                "Author": "Shorse_rider",
                "Date Created": "06-21-2019 14:01:12",
                "Upvotes": 7,
                "Text": "OMG you poor thing. This sounds awful. I think moving forwards, you should play the health card. 'You know what the challenge made me realise... I eat too much junk and even though I don't really want to lose, I want to cut  down on all that  because it just aint good for you!'. Pretend that you might not appear to eat it much, but 'it's a whole different story at the weekends or when I see my family'.\n\n&#x200B;\n\nDo not let their words touch you. Let it ping off you because honestly, and I mean this, they have forgotten about their stupid comments within seconds of saying those things. And also, as you've already alluded to - a lot of their bullshit is born from jealousy at what they perceive as your iron willpower.\n\n&#x200B;\n\n\\- and that's another thing you can say 'jokingly' - 'the more you try pressuring me to eat it, the more determined I am not too....game on, nice try!'",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}