{
    "ehjyb69": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehjyb69",
                "Author": "[deleted]",
                "Date Created": "03-01-2019 08:02:57",
                "Upvotes": 220,
                "Text": "I think this is a \"correlation equals not causation\" problem. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehjz1rs": [
                {
                    "Parent ID": "t1_ehjyb69",
                    "Comment ID": "ehjz1rs",
                    "Author": "TrueRusher",
                    "Date Created": "03-01-2019 08:13:08",
                    "Upvotes": 89,
                    "Text": "Honestly. \n\nLike if anything, it’s disordered eating that leads to dieting which leads to being diagnosed with an eating disorder. Not the other way around -.-",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehk5rtl": [
                        {
                            "Parent ID": "t1_ehjz1rs",
                            "Comment ID": "ehk5rtl",
                            "Author": "elephants78",
                            "Date Created": "03-01-2019 09:36:10",
                            "Upvotes": 23,
                            "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ehk46se": [
                {
                    "Parent ID": "t1_ehjyb69",
                    "Comment ID": "ehk46se",
                    "Author": "Whypay",
                    "Date Created": "03-01-2019 09:18:01",
                    "Upvotes": 29,
                    "Text": "Aye, this kind of misrepresentation of statistics is the kind of shit that makes people disregard everything else you have to say and does your cause no favours.\n\nFuckin' rocket surgeons right there.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehkdkep": [
                        {
                            "Parent ID": "t1_ehk46se",
                            "Comment ID": "ehkdkep",
                            "Author": "waystosaygoodbye33",
                            "Date Created": "03-01-2019 11:03:53",
                            "Upvotes": 23,
                            "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                            "Edited?": "03-01-2019 11:10:17",
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlbot4": [
                [
                    {
                        "Parent ID": "t1_ehkdkep",
                        "Comment ID": "ehlbot4",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:48:04",
                        "Upvotes": 4,
                        "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlfp8f": [
                        {
                            "Parent ID": "t1_ehlbot4",
                            "Comment ID": "ehlfp8f",
                            "Author": "waystosaygoodbye33",
                            "Date Created": "03-01-2019 18:42:51",
                            "Upvotes": 4,
                            "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ehjz01b": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehjz01b",
                "Author": "TrueRusher",
                "Date Created": "03-01-2019 08:12:28",
                "Upvotes": 93,
                "Text": "Or how about... those who develop eating disorders....are more likely to diet....\n\nLike I think they got that correlation backwards here. \n\nI started dieting because of my unhealthy thinking patterns. My ED thought process caused the dieting that led to bigger symptoms. \n\nIt wasn’t like I just tried dieting and then all the sudden couldn’t eat like a normal person. Wtf ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehk5tii": [
                {
                    "Parent ID": "t1_ehjz01b",
                    "Comment ID": "ehk5tii",
                    "Author": "elephants78",
                    "Date Created": "03-01-2019 09:36:41",
                    "Upvotes": 10,
                    "Text": "I feel this so hard ",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ehkoqwz": [
                {
                    "Parent ID": "t1_ehjz01b",
                    "Comment ID": "ehkoqwz",
                    "Author": "smallmadscientist",
                    "Date Created": "03-01-2019 13:17:47",
                    "Upvotes": 6,
                    "Text": "Ding ding ding! I honestly feel this is more correct :) ",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ehjvgvb": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehjvgvb",
                "Author": "rachihc",
                "Date Created": "03-01-2019 07:22:45",
                "Upvotes": 43,
                "Text": "I never did a diet in my life to loose weight (as a kid I was force feed to gain) and I still developed an already 15 y.o ED.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehkdkpa": [
                {
                    "Parent ID": "t1_ehjvgvb",
                    "Comment ID": "ehkdkpa",
                    "Author": "MissNietzsche",
                    "Date Created": "03-01-2019 11:04:00",
                    "Upvotes": 30,
                    "Text": "Yep. It bothers me so much when people say \"stop restricting and you'll stop bingeing\"...like bruh, I went the first 11 years of my life a completely normal kid then spontaneously started bingeing almost everyday once I hit middle school. Restricting now doesn't perpetuate the bingeing; restricting now keeps me from entering obesity and encountering fat-related health issues.",
                    "Edited?": "03-01-2019 14:18:02",
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehlbwvd": [
                        {
                            "Parent ID": "t1_ehkdkpa",
                            "Comment ID": "ehlbwvd",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:51:05",
                            "Upvotes": 5,
                            "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ehk2sva": [
                {
                    "Parent ID": "t1_ehjvgvb",
                    "Comment ID": "ehk2sva",
                    "Author": "onlysaysNOO",
                    "Date Created": "03-01-2019 09:01:25",
                    "Upvotes": 8,
                    "Text": "Literally same. ",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehk5x6e": [
                        {
                            "Parent ID": "t1_ehk2sva",
                            "Comment ID": "ehk5x6e",
                            "Author": "hrrrrrrrrrrrrr",
                            "Date Created": "03-01-2019 09:37:52",
                            "Upvotes": 4,
                            "Text": "YEP!",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ehjv0u0": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehjv0u0",
                "Author": "ifuckpineapples",
                "Date Created": "03-01-2019 07:15:54",
                "Upvotes": 80,
                "Text": "another example of why neda week is absolutely useless",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehk07h3": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehk07h3",
                "Author": "damnitjanet6",
                "Date Created": "03-01-2019 08:28:45",
                "Upvotes": 28,
                "Text": "When I was 10 I got a letter home from the school saying that I needed to lose weight and suggesting I start a diet. I was literally a normal weight. It’s not just putting on a yellow shirt, it’s having the god damn yellow shirt rubbed all over your face aggressively every single day of your life forever and if you don’t put the yellow shirt on you get told you’ll be unloveable forever 😂🔫\n\nSo anyway I’m going to buy doughnuts because fuck this.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehk354r": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehk354r",
                "Author": "usegao",
                "Date Created": "03-01-2019 09:05:33",
                "Upvotes": 25,
                "Text": "Girls who wash their hands are 18x more likely to develop disordered hand washing behaviors vs girls who never wash their hands; therefore, you should never wash your hands.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehk2k83": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehk2k83",
                "Author": "chezpajama",
                "Date Created": "03-01-2019 08:58:28",
                "Upvotes": 21,
                "Text": "Some people will take any opportunity to make an excuse for why they can’t or shouldn’t lose weight. That is what this sounds like to me. And it’s gross to co-opt mental illness because your delicate feels can’t handle reality. \n\nMost people can manage to lose weight in a healthy manner and make positive lifestyle changes. A small minority of people will develop an ED.\n\nI think stats for adult anorexia in women is 1-2%. Bulimia, if I recall, was 4%. Unsure of stats on BED. \n\nSomething like 50 or 60% of people are overweight. That sounds like the more pressing issue to me. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehk6ynx": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehk6ynx",
                "Author": "CA22TOR",
                "Date Created": "03-01-2019 09:49:43",
                "Upvotes": 20,
                "Text": "I was learning this recently and uh, kinda seems like they got it backwards. Maybe girls who already have EDs that aren’t full blown yet are more likely to diet in the beginning stage. Since many mental disorders can start off more tame and get worse later on.\n\nKinda like how my Grampy would always say I needed glasses because I sat too close to the television and damaged my eyes. No, I sat that close because I needed glasses and couldn’t see it unless I was up close. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehjzokk": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehjzokk",
                "Author": "Throwaway17898753",
                "Date Created": "03-01-2019 08:21:48",
                "Upvotes": 66,
                "Text": "Virtue signaling from people who don’t give a shit about us for 358 days of the year. They ban our subs and discord’s, they unperson you on social media, they rat you out doctors, they say things that they know hurt because “tough love” and throw more positivities to people who *choose* to live the Diabeetus and Heart Disease lifestyle. \n\nI have no use for these people. Either offer support or just stfu. \n\nLuckily, these people forgot about 35yo type A men have ED, too. 💁🏻",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehl15x1": [
                {
                    "Parent ID": "t1_ehjzokk",
                    "Comment ID": "ehl15x1",
                    "Author": "bashytr0n",
                    "Date Created": "03-01-2019 15:38:06",
                    "Upvotes": 9,
                    "Text": "Diabetes type 2 and obesity is caused by disordered eating too. How someone looks on the outside may be different but the disorder is the same. It's mental, its physical, and its a way of internalizing things weve picked up along the way and people die from it every day, fat & thin. If someone was so overweight it hurt them to walk, their doctors repeatedly warning them about amputations, feeling like society ridicules them, full of shame and trapped in their own bodies, unable to do what they want to do, crippled by a disease they *think* that they deserve... i dont think they would choose that.\n\n     \nI know youre mainly having a dig at ignorant people and im totally with you on that first part, i just think its important to remember the scope and complexity of eating disorders.",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehn666z": [
                        {
                            "Parent ID": "t1_ehl15x1",
                            "Comment ID": "ehn666z",
                            "Author": "Throwaway17898753",
                            "Date Created": "03-02-2019 12:27:35",
                            "Upvotes": 3,
                            "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ehktsyn": [
                {
                    "Parent ID": "t1_ehjzokk",
                    "Comment ID": "ehktsyn",
                    "Author": "KOlNAMl",
                    "Date Created": "03-01-2019 14:14:53",
                    "Upvotes": 11,
                    "Text": "i’m type 1 diabetic and i didn’t choose the “diabeetus lifestyle”... and even when you’re talking about type 2 diabetes i think that’s a pretty disrespectful way to talk about health conditions or “lifestyles”. you wouldn’t try to dismiss an anorexic’s health complications by saying they’re someone who chooses to live the organ failure and cardiac arrest life. idk. not everyone who is overweight chooses to be overweight. there just are so many factors ",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehn5pui": [
                        {
                            "Parent ID": "t1_ehktsyn",
                            "Comment ID": "ehn5pui",
                            "Author": "Throwaway17898753",
                            "Date Created": "03-02-2019 12:21:59",
                            "Upvotes": 1,
                            "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehndbqg": [
                [
                    {
                        "Parent ID": "t1_ehn5pui",
                        "Comment ID": "ehndbqg",
                        "Author": "KOlNAMl",
                        "Date Created": "03-02-2019 13:53:32",
                        "Upvotes": 3,
                        "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehnjket": [
                        {
                            "Parent ID": "t1_ehndbqg",
                            "Comment ID": "ehnjket",
                            "Author": "Throwaway17898753",
                            "Date Created": "03-02-2019 15:13:27",
                            "Upvotes": 1,
                            "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehorted": [
                [
                    {
                        "Parent ID": "t1_ehnjket",
                        "Comment ID": "ehorted",
                        "Author": "KOlNAMl",
                        "Date Created": "03-03-2019 02:02:30",
                        "Upvotes": 2,
                        "Text": "I’m not, i just disagree.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ]
        }
    ],
    "ehkanum": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehkanum",
                "Author": "GailaMonster",
                "Date Created": "03-01-2019 10:30:57",
                "Upvotes": 13,
                "Text": "I frankly think a lot of mainstream eating behavior is disordered, but since it's profitable for large businesses, it's normalized, even fetishized somewhat by the media.\n\nSimilarly, MANY for-profit diet plans that are \"sold\" (either thru purchased supplements/foods, thru purchased support groups, thru purchased access to methodology, etc.) rely on unsustainable, somewhat disordered eating patterns. \n\nThus, it's somewhat of a meaningless tautology to say \"dieting increases your risk of ED,\" because many for-profit diets promote ED behavior. After all, they lose you as a customer if you have a truly comfortable, sustainable relationship with food. If anything, they are priming you for the next thing they want to sell you. it's conditioning, both from the food and diet industry, to keep you a customer for life. Just like the pharmaceutical industry - it's much more profitable to MANAGE diabetes with a lifetime of blood glucose monitoring and medication than it is to CURE diabetes.\n\nTelling me \"you're 18x more likely to have ED behavior if you go on a diet is like telling me that people who go outside are at an 18X risk of sun exposure. It might be true, but it's sort of dumb, and not useful information, and I still gotta go outside, and maybe a small amount of sun exposure, monitored and controlled, is actually normal?\n\nI bristle pretty aggressively at the medical community's hypercompartmentalization of ED acknowledgment and treatment, too. you can have the most devastatingly upsetting relationship with food, but only after certain physical markers occur (e.g. your weight gets too low or too high, you initiate self-harm behavior) do they snap into action and intervene and take you seriously, often months or years after the dangerous patterns have had a chance to take hold and become \"normal\" of \"comfortable\" for the person suffering.\n\nI'll also say - maybe lots of those people going on diets already had ED or ED behavior. maybe going on a diet just makes you 18x more likely to acknowledge that you've had an ED all along, since most/almost all diets include acknowledging, focusing on, and attempting to change your relationship/behavior surrounding food. \n\n\nLastly, making a person feel bad about themselves or their plan is a CLASSIC, Don Draper-style tactic to convince you to buy what someone is selling. they may only be \"selling\" an ideology or an Instagram they want you to follow, but it's still emotional abuse to get you to do what THEY think is right by making you feel bad about what YOU think is right. I don't know what part of \"my body, my choice\" some folks don't seem to get, when they scream it from the rooftops when promoting their HAES narrative but then get all up in our business about managing the way we feel is best.\n\nEnd rant.",
                "Edited?": "03-01-2019 10:34:30",
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehl1u5g": [
                {
                    "Parent ID": "t1_ehkanum",
                    "Comment ID": "ehl1u5g",
                    "Author": "bashytr0n",
                    "Date Created": "03-01-2019 15:45:47",
                    "Upvotes": 2,
                    "Text": "I hope more people read this. \nThis shouldve been public information decades ago. The greed of a few has cost so many lives. I like to hope they didnt realize the extent of the damage at the time..",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehl3hm2": [
                        {
                            "Parent ID": "t1_ehl1u5g",
                            "Comment ID": "ehl3hm2",
                            "Author": "GailaMonster",
                            "Date Created": "03-01-2019 16:05:00",
                            "Upvotes": 2,
                            "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlq8zq": [
                [
                    {
                        "Parent ID": "t1_ehl3hm2",
                        "Comment ID": "ehlq8zq",
                        "Author": "bashytr0n",
                        "Date Created": "03-01-2019 21:13:59",
                        "Upvotes": 2,
                        "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ehk0qoc": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehk0qoc",
                "Author": "IamCookies",
                "Date Created": "03-01-2019 08:35:50",
                "Upvotes": 11,
                "Text": "i'd change that for girls with low self-esteem and other comorbid mental disorders have 18x more chance to go on a diet and end up developing an ED\"",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehkb515": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehkb515",
                "Author": "broketreebranch",
                "Date Created": "03-01-2019 10:36:09",
                "Upvotes": 7,
                "Text": "I see it both ways. I don't believe we should encourage dieting in children/adolescents. Calorie restriction can trigger EDs in some people, just like getting a prescription once for pain meds for an injury can start an addiction. However, just like we're not going to stop prescribing short rounds of opioids for broken bones,  when we have only 1% of the American population developing AN compared to 66% being overweight/obese, i don't think we should abstain completely from encouraging adults in making healthier dietary choices who need it. Risk vs. benefit.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehjzn6a": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehjzn6a",
                "Author": "[deleted]",
                "Date Created": "03-01-2019 08:21:16",
                "Upvotes": 8,
                "Text": "I agree with OP that it is the social conditions that ENCOURAGE dieting that are the real problem, but there's a lot of solid evidence to suggest that dieting does change a person's relationship with food.  Starvation does cause neuro-psychological changes that, once triggered, could bring on an ED.\n\nSo thin obsessed culture/family of origin + neuro-psych changes from restricted diets = increased likelihood for EDs.  This seems like a reasonable hypothesis, no? ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehk647e": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehk647e",
                "Author": "hrrrrrrrrrrrrr",
                "Date Created": "03-01-2019 09:40:04",
                "Upvotes": 4,
                "Text": "I only wear black so am I addicted to black?",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehjwby4": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehjwby4",
                "Author": "[deleted]",
                "Date Created": "03-01-2019 07:35:26",
                "Upvotes": 6,
                "Text": "can I be doing keto without developing an eating disorder? I am really confused and not sure if it's safe... I do not base my self-worth on weight, and I think I am not super obsessed about food... I don't know... ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ],
        {
            "ehk2z8d": [
                {
                    "Parent ID": "t1_ehjwby4",
                    "Comment ID": "ehk2z8d",
                    "Author": "[deleted]",
                    "Date Created": "03-01-2019 09:03:34",
                    "Upvotes": 6,
                    "Text": "It’s possible, but personally keto & IF were manifestations of my ED and quickly escalated. ",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehkek2o": [
                        {
                            "Parent ID": "t1_ehk2z8d",
                            "Comment ID": "ehkek2o",
                            "Author": "[deleted]",
                            "Date Created": "03-01-2019 11:15:52",
                            "Upvotes": 4,
                            "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ehjxv89": [
                {
                    "Parent ID": "t1_ehjwby4",
                    "Comment ID": "ehjxv89",
                    "Author": "1ovewaters",
                    "Date Created": "03-01-2019 07:56:55",
                    "Upvotes": 5,
                    "Text": "it’s fine!",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkeiae": [
                [
                    {
                        "Parent ID": "t1_ehk29ex",
                        "Comment ID": "ehkeiae",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:18",
                        "Upvotes": 7,
                        "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        },
        {
            "ehk29ex": [
                {
                    "Parent ID": "t1_ehjwby4",
                    "Comment ID": "ehk29ex",
                    "Author": "Somenewnoname",
                    "Date Created": "03-01-2019 08:54:53",
                    "Upvotes": 5,
                    "Text": "Why only question then is why are you in this sub?",
                    "Edited?": false,
                    "Is Submitter?": false,
                    "Stickied?": false
                },
                {
                    "ehkeiae": [
                        {
                            "Parent ID": "t1_ehk29ex",
                            "Comment ID": "ehkeiae",
                            "Author": "[deleted]",
                            "Date Created": "03-01-2019 11:15:18",
                            "Upvotes": 7,
                            "Text": "I had BED and bulimia and I'm not sure I have completely recovered",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehk5rtl": [
                [
                    {
                        "Parent ID": "t1_ehjz1rs",
                        "Comment ID": "ehk5rtl",
                        "Author": "elephants78",
                        "Date Created": "03-01-2019 09:36:10",
                        "Upvotes": 23,
                        "Text": "Exactly! Completely agree. Disordered eating/emotional shit is at the center, and dieting is a socially acceptable way of controlling food and then it spirals into an ED. Ugggh ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehkdkep": [
                [
                    {
                        "Parent ID": "t1_ehk46se",
                        "Comment ID": "ehkdkep",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 11:03:53",
                        "Upvotes": 23,
                        "Text": "Makes me want to smack my head against a wall. \n\nI hate how there’s this new “down with dieting!!!!!!! It causes eating disorders!!!!” trend. For some it may ~trigger~ an eating disorder, but dieting alone doesn’t do anything without the right stressors, environment, lack of support, predisposition, etc. \n\nIf anything I think it trivializes the struggles of EDs, because it low key supports the narrative of “EDs are just diets gone wrong” versus “EDs are the most deadly mental illness”. \n\nSorry for the rant on your comment, 200% agree! So happy I’ve found people who see it the same way. ",
                        "Edited?": "03-01-2019 11:10:17",
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlbot4": [
                        {
                            "Parent ID": "t1_ehkdkep",
                            "Comment ID": "ehlbot4",
                            "Author": "softcoffee",
                            "Date Created": "03-01-2019 17:48:04",
                            "Upvotes": 4,
                            "Text": "I completely agree, it's trivializing misinformation.  Making EDs out to be just a bad diet suggest that you can help some with an ED just by changing/fixing their diet and saying all of that \"just eat\" bs. People diet to lose weight for their appearance or health, that's NOT what someone with an ED does! It's really annoying. The worst part is everyone wants to talk about EDs in a stereotypical, simplified and just plain false manner, but the truth about what we go through is so stigmatized. No one wants to talk about what it's really like, they just want to blame social media or diet culture and act like they're making changes and being supportive.  \n\nWe can ban Instagram and diet/weight loss media, and condemn diet culture all day everyday, I'm still going to have an ED. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehlbwvd": [
                [
                    {
                        "Parent ID": "t1_ehkdkpa",
                        "Comment ID": "ehlbwvd",
                        "Author": "softcoffee",
                        "Date Created": "03-01-2019 17:51:05",
                        "Upvotes": 5,
                        "Text": "Same. I restrict BECAUSE I binge, and I binge because I've had overeating/emotional eating issues since I was a kid. If I didn't restrict I'd gain a ton, feel even worse, and my health would go down the toilet. Binging is what part of what made me hate my body and go through all of this nonsense. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehk5x6e": [
                [
                    {
                        "Parent ID": "t1_ehk2sva",
                        "Comment ID": "ehk5x6e",
                        "Author": "hrrrrrrrrrrrrr",
                        "Date Created": "03-01-2019 09:37:52",
                        "Upvotes": 4,
                        "Text": "YEP!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn666z": [
                [
                    {
                        "Parent ID": "t1_ehl15x1",
                        "Comment ID": "ehn666z",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:27:35",
                        "Upvotes": 3,
                        "Text": "I’m fully aware of both extremes of the eating disorder spectrum. The acceptance and glorification of conscious choices, without underlying issues, that lead to health implications is what is wrong with society. I would love to be fit, eat normally and be rid of this. Then there are those people who have the mental and physical ability to do so but choose to be a glutton on crap food then are surprised when their diet of processed junk and HFCS leads them to a lifetime of health problems because popular culture says “do whatever, as long as you feel good”. \n\nThose same people hashtag-signal and shame me and others for the losing (versus gaining) side of ED. \n",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehn5pui": [
                [
                    {
                        "Parent ID": "t1_ehktsyn",
                        "Comment ID": "ehn5pui",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 12:21:59",
                        "Upvotes": 1,
                        "Text": "Im a Type 1.5, if that makes sense. Adult onset. There are plenty of choices made by people; garbage in, garbage out. Glorifying these poor choices in the media only reinforces them as positive things. Medical/psychological conditions are totally different than “I choose to eat junk, I wonder why I have acquired these problems”. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehndbqg": [
                        {
                            "Parent ID": "t1_ehn5pui",
                            "Comment ID": "ehndbqg",
                            "Author": "KOlNAMl",
                            "Date Created": "03-02-2019 13:53:32",
                            "Upvotes": 3,
                            "Text": "i don’t know what 1.5 is supposed to mean. my point was it may not as be as simple as people “choosing to eat junk” and you lumped all of it (people who “choose to eat junk” and those with medical and/or psychological conditions) together in a way i thought was really disrespectful.  and how do you personally tell the difference between a glutton for gluttons sake and someone using food to cope? your comment just sounded really judgmental and erased all nuance from the situation. \n\nand if your problem is glorification... we all know anorexia and bulimia are glorified. i just don’t get why you’re taking your anger out on overweight people. ",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehl3hm2": [
                [
                    {
                        "Parent ID": "t1_ehl1u5g",
                        "Comment ID": "ehl3hm2",
                        "Author": "GailaMonster",
                        "Date Created": "03-01-2019 16:05:00",
                        "Upvotes": 2,
                        "Text": ">I like to hope they didnt realize the extent of the damage at the time..\n\nYou shouldn't. this is the same story over and over again, from cigarettes to Roundup to refined sugar. Companies know, companies don't care - if it's cheaper to deny and hide evidence than change, they will resist change. \n\nRemember, corporations are legal fictional placeholders for people - people whose sole motivation is profit maximization. They can't feel guilt or shame, so don't humanize them. Taco Bell literally invented the term \"fourth meal\" and promoted it to normalize the idea that you should go out after dinner and eat another 800+ calories. Don't ever give companies the benefit of the doubt when the shitty thing they do is profitable but harmful.",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehlq8zq": [
                        {
                            "Parent ID": "t1_ehl3hm2",
                            "Comment ID": "ehlq8zq",
                            "Author": "bashytr0n",
                            "Date Created": "03-01-2019 21:13:59",
                            "Upvotes": 2,
                            "Text": "Oh its not so much for the companies sake as my own, as its less depressing to retain some belief that humanity is ultimately kind 🙃 ive seen too many people around me get sick or die and have chronic pain and countless other issues, all because they were denied the write to *know*. Denied the right to their own fucking bodies in such an insidious way they think its their own choices the whole time. Its sick...",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ],
            "ehkek2o": [
                [
                    {
                        "Parent ID": "t1_ehk2z8d",
                        "Comment ID": "ehkek2o",
                        "Author": "[deleted]",
                        "Date Created": "03-01-2019 11:15:52",
                        "Upvotes": 4,
                        "Text": "How do I know if things are escalating? I don't know what normal is supposed to be like...",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehlfp8f": [
                [
                    {
                        "Parent ID": "t1_ehlbot4",
                        "Comment ID": "ehlfp8f",
                        "Author": "waystosaygoodbye33",
                        "Date Created": "03-01-2019 18:42:51",
                        "Upvotes": 4,
                        "Text": "Yes, preach!! \n\nI always compare it to alcoholism. You have the predisposition, and yes - being in college around binge drinking triggered your alcoholism. Does that mean alcohol alone is the cause and toxic to everyone? No. Does it mean you would have had problems in a sober culture? Maybe, maybe not. Who knows. At that point though, going on a crusade against alcohol does nothing but make you seem like an asshat. Eating disorders I feel like are treated the same- except people are going on a crusade against diet culture, and using EDs as a platform to fight such, which just doesn’t make sense. \n\nI feel like eating disorders (especially with the HAES community) are merely another chance to get on the “dieting is bad” soapbox. People don’t seem to genuinely care, which is the case with a lot of issues really. How can we tell? Look at ED treatment, and how there has been such little improvement on (1) how we treat them (2) research on EDs in general in comparison to other MH conditions of their frequency and (3) the fact that we don’t take people with EDs seriously, until it literally looks like they’re about to die, and even then it’s a hit or miss because we think harassing them to eat a cheese burger will cure them!",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ]
            ],
            "ehnjket": [
                [
                    {
                        "Parent ID": "t1_ehndbqg",
                        "Comment ID": "ehnjket",
                        "Author": "Throwaway17898753",
                        "Date Created": "03-02-2019 15:13:27",
                        "Upvotes": 1,
                        "Text": "It’s official name is Latent autoimmune diabetes. Totally different than type 1 and 2. The structure and verbiage of my post did nothing of the sort, as the language of choice was put in italicization for a reason. Yes, Ana and b/p is glorified, but that’s the topic of a different post altogether. The discrimination between the two is clear; those who use over/under eating for a coping mechanism obviously don’t fall within those who freely and voluntarily choose an unhealthy lifestyle then are shocked when the associated health problems come shortly thereafter, all the while shaming and ridiculing those with under-eating disorders, save for hashtag week. I think you are looking for a reason to be offended rather than taking a post at face value. ",
                        "Edited?": false,
                        "Is Submitter?": false,
                        "Stickied?": false
                    }
                ],
                {
                    "ehorted": [
                        {
                            "Parent ID": "t1_ehnjket",
                            "Comment ID": "ehorted",
                            "Author": "KOlNAMl",
                            "Date Created": "03-03-2019 02:02:30",
                            "Upvotes": 2,
                            "Text": "I’m not, i just disagree.",
                            "Edited?": false,
                            "Is Submitter?": false,
                            "Stickied?": false
                        }
                    ]
                }
            ]
        }
    ],
    "ehk56cx": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehk56cx",
                "Author": "ri-ri",
                "Date Created": "03-01-2019 09:29:19",
                "Upvotes": 3,
                "Text": "When I read that title I literally said to myself \"no shit sherlock \"",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehk6acc": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehk6acc",
                "Author": "Valer_bear",
                "Date Created": "03-01-2019 09:42:00",
                "Upvotes": 3,
                "Text": "Lol fasting is how mine started ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehkf0td": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehkf0td",
                "Author": "sstephenn",
                "Date Created": "03-01-2019 11:20:58",
                "Upvotes": 3,
                "Text": "Can’t be true, I’d have to be a girl first ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehkgmp5": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehkgmp5",
                "Author": "gdktsmgy12",
                "Date Created": "03-01-2019 11:48:52",
                "Upvotes": 3,
                "Text": "I am so tired of this narrative that girls develop EDs because they’re stupid and impressionable. Lots of people who diet develop EDs, and lots of people who diet don’t. Of course these behaviors are linked, but nothing is truly that simple. No one takes EDs very seriously because of this constant implication that it’s 100% a choice.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehkagbs": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehkagbs",
                "Author": "lorabore",
                "Date Created": "03-01-2019 10:28:43",
                "Upvotes": 4,
                "Text": "\"Girls who dieted restrictively were 18xs more likely to develop an eating disorder\"\n\nUh...seems like a duh to me since most eating disorders literally ARE restrictive diets. \n\nThe problem is that restrictive dieting is looked at as so mainstream that when someone does develop an eating disorder society literally applauds them for it. \n",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehkqdb4": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehkqdb4",
                "Author": "linedryonly",
                "Date Created": "03-01-2019 13:36:02",
                "Upvotes": 2,
                "Text": "*Girls who 'diet' are 18x more likely to have an UNDERLYING ED.\n\nThere, fixed it for them. \n\nThis is why I take issue with NEDA. For an association that's supposed to represent and support us, they rely too much on outdated and over-simplistic models of eating disorders.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehlf35y": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehlf35y",
                "Author": "lunainterlude",
                "Date Created": "03-01-2019 18:34:15",
                "Upvotes": 2,
                "Text": "GO OFFFFFFF",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehlvlmt": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehlvlmt",
                "Author": "suddenlystevie",
                "Date Created": "03-01-2019 22:37:48",
                "Upvotes": 2,
                "Text": "“Girls with a predisposition to eating disorders are 18x more likely to diet.”",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehkkbm0": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehkkbm0",
                "Author": "Poopyoo",
                "Date Created": "03-01-2019 12:29:40",
                "Upvotes": 1,
                "Text": "Dieting is apparently a gateway drug now? Hahaha",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehkv3qr": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehkv3qr",
                "Author": "CastleInTheAttic",
                "Date Created": "03-01-2019 14:29:35",
                "Upvotes": 1,
                "Text": "I think it is more likely that girls who develop an ED likely diet first.\nThe diet doesn’t create the ED, they diet because of the ED brain.",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehl2ljs": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehl2ljs",
                "Author": "[deleted]",
                "Date Created": "03-01-2019 15:54:38",
                "Upvotes": 1,
                "Text": "Also like most people, especially women, will diet at least once in their lives (likely more). I'm jealous of the minority that wont ever have to diet though lol. But yeah like its been said correlation does not always equal causation ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ],
    "ehn1bda": [
        [
            {
                "Parent ID": "t3_aw4ivh",
                "Comment ID": "ehn1bda",
                "Author": "liteandlil",
                "Date Created": "03-02-2019 11:28:10",
                "Upvotes": 1,
                "Text": "What a bizarre statistic. How did they define diet? Also obviously most girls have been on a diet before because of societal pressures or their own desire or doctors orders. This can be healthy or unhealthy. The people who haven’t dieted are the exception and they’re probably a lot less likely to be concerned about food/body/control over their bodies in general so of course they’re less likely to develop an ED. ",
                "Edited?": false,
                "Is Submitter?": false,
                "Stickied?": false
            }
        ]
    ]
}